{
    "name": "Achilles' Heels",
    "texts": {
        "definition": "A special weakness of an enemy that can be used to defeat that enemy much easier than by other means.",
        "description": [
            "Many of the more difficult enemies in games can more easily, or in some cases only, be defeated by a special form of attack. These kinds of enemies have an \"Achilles Heel\", a special weakness that players can use to their advantage if they can locate it or gain knowledge about it."
        ],
        "examples": [
            "the final monster in \"Half-Life\" can only be damaged by first hitting a special area.",
            "boss monsters in games such as \"Zelda\" or \"Super Mario Sunshine\" usually can only be defeated by special actions, such as grabbing hold of the enemies' tail and spinning around rapidly or hitting the enemies' so that it shows a vulnerable spot and then hitting that spot.",
            "many monsters in roleplaying games can only be damaged by certain weapons, for example silver or magic weapons. This kind of vulnerability can be seen as a kind of \"Achilles Heel\" even though it is not defined by a specific area but by a specific type of attack."
        ],
        "usage": [
            "[Achilles' Heels](achilles-heels) are most commonly used to make [Boss Monsters](boss-monsters) easier to [Overcome](overcome). The two main design choices regarding [Achilles' Heels](achilles-heels) are their effects related to normal attacks, what is required to attack the weak point, and how players become aware of the [Achilles' Heels](achilles-heels).",
            "Three main ways that attacks against [Achilles' Heels](achilles-heels) can affect enemies are: through simply modifying the [Damage](damage), through having a special effect (for example stunning or confusing), or through being the only way to cause [Damage](damage) at all. The two latter can be seen as forms of \"Privileged Actions\". When anyone can attack the \"Achilles Heel\", the only thing required is information about the \"Achilles Heel\", while, if only some players can attack it, the weak point can create the need to fulfill [Gain Competence](gain-competence) goals or acquire the right [Tools](tools). Players can gain awareness of [Achilles' Heels](achilles-heels) through the development of the [Narrative Structure](narrative-structures), through [Clues](clues) and [Traces](traces) in the area the enemy inhabits, or through [Experimenting](experimenting) when fighting the enemy. Gaining this information can be a [Gain Information](gain-information) goal and [Supporting Goal](supporting-goals) when part of the [Narrative Structure](narrative-structures), which may in turn require other [Supporting Goals](supporting-goals) to actually be able to use the information, if the \"Achilles Heel\" requires a specific form of [Tool](tools). [Public Information](public-information) about [Achilles' Heels](achilles-heels) can be used to set the [Right Level of Difficulty](right-levelof-difficulty) to a lower level."
        ],
        "consequences": [
            "The presence of [Achilles' Heels](achilles-heels) is a form of [Strategic Knowledge](strategic-knowledge) that players can use in [Combat](combat). This can be used to provide the [Right Level of Difficulty](right-levelof-difficulty) and can motivate [Gain Information](gain-information) and [Puzzle Solving](puzzle-solving) if the \"Achilles Heel\" is not [Public Information](public-information). As \"Achilles Heels\" often require unique forms of attack or more specific uses of ordinary actions, having to perform them gives [Varied Gameplay](varied-gameplay)."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "gain-information",
            "supporting-goals",
            "varied-gameplay",
            "right-levelof-difficulty",
            "experimenting",
            "puzzle-solving"
        ],
        "modulates": [
            "damage",
            "combat",
            "overcome",
            "boss-monsters"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "public-information",
            "narrative-structures",
            "tools",
            "clues",
            "traces"
        ],
        "conflicts": []
    }
}