{
    "name": "Alliances",
    "texts": {
        "definition": "A group of players who have agreed to obey particular and specific rules of conduct towards each other and who, usually, also have a shared agenda.",
        "description": [
            "The rules of conduct, obviously, have to be relevant to the playing of the game and they also have to be optional from the game system point of view, that is, players should be able also to decide not to obey these rules, effectively leaving them out of the [Alliance](alliances) (otherwise, every game has an alliance of players agreeing to play the game together). That the rules are particular and specific means that, first, they are effective for a certain amount of time during the game play and for a certain group of players, and secondly, that they are specific enough for determining if a player has breached the contract. The rules being specific enough does not necessarily mean that it is possible to determine conclusively that there is a breach of contract. Especially player defined [Alliances](alliances) have a tendency to allow different interpretations, and sometimes the fun comes from arguing whether there is a breach of contract.",
            "The agenda of the [Alliance](alliances) defines the reason for having the [Alliance](alliances) and is usually concerned about possible goals that the members of the [Alliance](alliances) want to reach together.[Alliances](alliances) in general are not mutually exclusive. Players can therefore, at least in principle, belong to many different [Alliances](alliances) at the same time. [Alliances](alliances) can also consist of smaller sub-[Alliances](alliances), which may have their own rules of conduct and agendas. In any case, the player composition is one of the most important, and concrete, characteristics of an [Alliance](alliances)."
        ],
        "examples": [
            "\"Return to Castle Wolfenstein: Enemy Territory\" has two teams, Axis and Allies, fighting each other in a World War II first-person--shooter environment. These teams are examples of [Alliances](alliances) where the rules of conduct to not shoot, but try to help, members of one's own team, and the agenda of overcoming the opposing team, are clear cut and stable. The player composition in open games, however, might change during the play as players might drop out and new players join on both sides. People may break the rules of conduct, e. g., shooting their own teammates, but the game supports collective actions such as banning offending players by voting.",
            "The computer game \"Civilization\" allows a player to have different diplomatic relations with other players. The peace relation effectively creates an [Alliance](alliances) as the players agree not to attack each other as the defining rule of conduct.",
            "The board game \"Diplomacy\" does not have explicit [Alliances](alliances), but the players agree upon the rules of conduct outside the game system. These agreements range from the simple \"let's not attack each other during this turn\" to more complex \"we will coordinate the use of our armies and fleets in a way so that we can invade Italy within two years, and we will split the spoils of war equally.\" The latter agreement is also a good example of a formulation of the rules of conduct that is open to interpretation."
        ],
        "usage": [
            "[Alliances](alliances) typically emerge around [Mutual Goals](mutual-goals) or common [Enemies](enemies). [Alliances](alliances) differ from [Team Play](team-play) in that they do not necessarily promote [Cooperation](cooperation) but can consist of agreeing not to interfere with actions or goals of the other members in the alliance.",
            "The use of [Shared Rewards](shared-rewards) and [Shared Penalties](shared-penalties) usually make the [Alliances](alliances) more stable while [Shared Resources](shared-resources), [Individual Penalties](individual-penalties), and possibilities of [Betrayal](betrayal) make them more volatile. [Alliances](alliances) make more sense in games where players can have an effect on the progress or game situation of the other players; that is, there are [Interferable Goals](interferable-goals) in the game or there are [Player Decided Results](player-decided-results). The rules of conduct of the [Alliance](alliances) can be defined in terms of the game itself, and there is at least some benefit for being in an [Alliance](alliances).",
            "[Alliances](alliances) do not have to be explicitly stated or declared within the game system, since it is possible that players define the rules of conduct themselves as illustrated in the previous \"Diplomacy\" example. [Social Interaction](social-interaction) is typically required for negotiating the [Alliances](alliances) unless the game system gives the player a possibility of offering, declaring, and accepting alliance proposals as actions in the game itself, as is the case in the previous \"Civilization\" example. There are, however, games that are especially based on having [Alliances](alliances) without explicit alliance actions or having [Social Interaction](social-interaction) that allows some forms of [Social Dilemmas](social-dilemmas). Some of the more common types of [Alliances](alliances) are described in more detail in [Uncommitted Alliances](uncommitted-alliances), [Dynamic Alliances](dynamic-alliances), and [Secret Alliances](secret-alliances) patterns."
        ],
        "consequences": [
            "[Alliances](alliances) can lead to the players automatically creating and maintaining [Social Organizations](social-organizations), but [Social Organizations](social-organizations) can exist as [Alliances](alliances) also with the sole purpose of providing [Social Interaction.](social-interaction)",
            "Stable [Alliances](alliances) promote [Team Play](team-play), such as teams in sports, and tend to create strong cohesiveness in the group, especially in cases where there are [Mutual Goals](mutual-goals) and a common enemy, the opposing team. These stable [Alliances](alliances) or teams also lead to \"us\" versus \"them\" feelings, where the players outside the [Alliance](alliances) are viewed as inferior or even bad and evil in character. This is especially the case when there is a direct [Competition](competition) between the different teams. The more stable [Alliances](alliances) almost naturally get characteristics of [Social Organizations](social-organizations) such as different levels of [Social Status](social-statuses) within the members of the [Alliance](alliances) and role-differentiation."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "competition"
        ],
        "instantiated_by": [
            "cooperation",
            "social-interaction",
            "enemies",
            "social-organizations",
            "mutual-goals"
        ],
        "modulated_by": [
            "social-statuses",
            "shared-resources",
            "individual-penalties",
            "player-decided-results",
            "competition",
            "interferable-goals",
            "uncommitted-alliances",
            "secret-alliances",
            "dynamic-alliances",
            "shared-penalties",
            "shared-rewards",
            "social-dilemmas",
            "betrayal"
        ],
        "conflicts": []
    }
}