{
    "name": "Alternative Reality",
    "texts": {
        "definition": "The game is described as taking place in an alternative reality in order to justify and motivate game elements, possible actions, and rules that contradict the ordinary laws of nature or the usual rules of social conduct.",
        "description": [
            "All games taking place in fantasy and science fiction settings make use of this pattern, but the pattern is also used in games taking place in alternative histories. Some forms of live-action roleplaying games take place in a historical setting and, although it is an alternative reality, the participants try to make the [Game World](game-world) as similar as possible to the known facts about that historical period. Even though it can be argued that every game takes place in an alternative reality, which is defined and bound by the rules of the game, this pattern is mainly concerned with making the theme and the function of the [Game World](game-world) seem life-like."
        ],
        "examples": [
            "\"Medieval: Total War\" is a strategy game set in the power struggles of medieval Europe and as such can be classified as an alternative history game. The game contains huge amounts of references to historical facts, such as political events and real people. The tactical part of the game allows the player to control seemingly realistic troops in a fluid three-dimensional environment."
        ],
        "usage": [
            "Using the [Alternative Reality](alternative-reality) pattern mainly concerns describing and explaining to the players the theme and setting of the game. When properly done, this makes non-intuitive parts of a game, for example explaining [Construction](construction) in most games or [New Abilities](new-abilities) through [Rewards](rewards), easy to understand and remember. If the actions and events in games are to be tied to the [Alternative Reality](alternative-reality) description to strengthen it, [Game Worlds](game-world) and [Narrative Structures](narrative-structures) must be designed with fitting objects and [Characters](characters) so that the games have[Predictable Consequences](predictable-consequences) and are also socially and emotionally believable. This may be done through the audiovisuals of the [Game World](game-world), [Clues](clues), [Extra-Game Information](extra-game-information), and typically part of the [Narrative Structure](narrative-structures) is described using [Cut Scenes](cut-scenes). [Clues](clues) and [Helpers](helpers) are ways to introduce [Indirect Information](indirect-information) without breaking the illusion of an [Alternative Reality.](alternative-reality)"
        ],
        "consequences": [
            "[Alternative Realities](alternative-reality) provide other realms in which players can experience [Emotional Immersion](emotional-immersion). This [Immersion](immersion) is typically promoted by [Storytelling](storytelling) and [Cut Scenes](cut-scenes) but also by providing players the opportunity to control [Storytelling](storytelling) and \"Roleplaying of\" [Characters](characters) so they may experience [Identification](identification).",
            "An [Alternative Reality](alternative-reality) can be used to explain components in the game that are included to improve the gameplay but do not have a counterpart in the real world. By doing so, an [Alternative Reality](alternative-reality) can provide a [Consistent Reality Logic](consistent-reality-logic) even though the logic is different from that of the real world. The archetypical examples that are explained by [Alternative Realities](alternative-reality) are players' [Focus Loci](focus-loci), since few games let players play themselves as part of the gameplay.",
            "The degree of difference between the [Alternative Reality](alternative-reality) and the real world can affect the ability to relax and forget the real world. The more unlike reality, the easier it may be for players to take chances, play aggressively, or try something unusual, since consequences of the actions are less realistic and remind less of the full consequences of corresponding real-world actions, but games taking place in unrealistic settings may also limit the number of potential players. The [Alternative Reality](alternative-reality), however, has to be consistent with the game itself to ensure [Consistent Reality Logic](consistent-reality-logic)."
        ]
    },
    "relations": {
        "instantiates": [
            "predictable-consequences",
            "emotional-immersion",
            "consistent-reality-logic"
        ],
        "modulates": [
            "indirect-information",
            "new-abilities"
        ],
        "instantiated_by": [
            "roleplaying"
        ],
        "modulated_by": [
            "ephemeral-goals",
            "focus-loci",
            "identification",
            "rewards",
            "characters",
            "narrative-structures",
            "clues",
            "storytelling",
            "cut-scenes",
            "construction"
        ],
        "conflicts": []
    }
}