{
    "name": "Analysis Paralysis",
    "texts": {
        "definition": "The players can spend considerable amounts of time planning their actions, because the consequences of the actions are at least somewhat predictable, and the number of possible outcomes grows exponentially the further in game time the players plan ahead.",
        "description": [
            "The classic case of \"Analysis Paralysis\" is that the players are unable to make any useful decisions regarding future actions because they attempt to think too far ahead, and the possible game state space is far too large for proper min-max analysis. \"Analysis Paralysis\" depends also on the players' play style; some players are more prone to \"Analysis Paralysis\" than the others."
        ],
        "examples": [
            "\"Chess\" and \"Go\" have been used as prime examples of games where there is a possibility to almost endlessly analyze the possible actions for the future. Both have decision trees, which grow exponentially over game time.",
            "\"Diplomacy\", even though the possible actions are quite limited, can cause \"Analysis Paralysis\" when the players start to think recursively about what the other players are trying to do and how the other players would perceive the players' actions."
        ],
        "usage": [
            "\"Analysis Paralysis\" can be achieved by letting players have \"Freedom of Choice\" between several actions with \"Predictable Consequences\", even if these are \"Limited Set of Actions\" or players have \"Limited Resources\". This forces players to consider \"Tradeoffs\" and the more difficult the values of the actions are to judge, the more likely \"Analysis Paralysis\" is to occur. The likelihood can also be modulated by \"Irreversible Actions\", as well as \"Predefined Goals\" in games where the players have \"Perfect Information\" and \"Symmetric Information\" about the discrete game states. This allows the players to plan the consequences of their current and future actions. \"Irreversible Actions\" guarantee that consequences of the chosen action will be effective also in the future, and this makes it possible to plan several actions ahead while at the same time decreasing the chances to perform \"Experimenting.\" \"Budgeted Action Points\" provide means of expanding the number of decisions the players have to make in each decision point, in effect, broadening the scope of \"Freedom of Choice\", as are open \"Discard Piles\" in card games, which allow the players to have \"Game State Overviews\" and may cause \"Analysis Paralysis\".",
            "It is possible to lessen the possibility for \"Analysis Paralysis\" by introducing \"Randomness\" to the consequences of the actions and thereby giving players \"Limited Foresight\" and \"Limited Planning Abilities\"."
        ],
        "consequences": [
            "\"Analysis Paralysis\" is caused by \"Stimulated Planning\" and \"Cognitive Immersion\", and is usually a feature game designers try to avoid. That players have \"Analysis Paralysis\" can be a sign that the game does not have the \"Right Level of Complexity\" for those players.",
            "In games with \"Turn Taking\", the presence of \"Analysis Paralysis\" leads to excessive \"Downtime\" for the other players in case some of the players get stuck in planning their turns. The nature of \"Analysis Paralysis\" situations has a somewhat adverse effect on the \"Anticipation\" of the uncertain outcome during the play.",
            "The negative effects of \"Analysis Paralysis\" for other players can easily be avoided by having \"Time Limits\"."
        ]
    },
    "relations": {
        "instantiates": [
            "downtime"
        ],
        "modulates": [],
        "instantiated_by": [
            "cognitive-immersion",
            "stimulated-planning",
            "limited-set-of-actions",
            "irreversible-actions",
            "budgeted-action-points",
            "tradeoffs",
            "freedom-of-choice",
            "turn-taking",
            "predefined-goals",
            "right-level-of-complexity",
            "game-state-overview"
        ],
        "modulated_by": [
            "predictable-consequences",
            "discard-piles",
            "time-limits",
            "perfect-information",
            "symmetric-information"
        ],
        "conflicts": [
            "limited-foresight",
            "anticipation",
            "limited-resources",
            "randomness",
            "limited-planning-ability"
        ]
    }
}