{
    "name": "Arithmetic Rewards for Investments",
    "texts": {
        "definition": "The possible rewards have a linear relationship to the investments, that is, if the investment is double, the comparable reward is doubled.",
        "description": [
            "\"Arithmetic Rewards for Investments\" are those rewards in game that are directly proportional with the resources used to gain them. As long as requirements of minimum and maximum investments are met, \"Arithmetic Rewards for Investments\" allow players to split resources into several smaller investments rather than one large investment with no other penalty than maybe not receiving all rewards at the same time."
        ],
        "examples": [
            "the unit construction in strategy games is often based on \"Arithmetic Rewards for Investments\". If it costs 100 production points to construct a tank, it costs 200 points to construct two tanks, 300 points to construct three tanks, and so on."
        ],
        "usage": [
            "\"Arithmetic Rewards for Investments\" use linear functions between the \"Resources\" and \"Rewards\" of \"Investments\" and are thereby incompatible with \"Geometric Rewards for Investments\" and \"Diminishing Returns\". They make the planning of the \"Investments\" straightforward as there is no real incentive for hoarding the \"Resources\" before investing. As the \"Investments\" can be done in smaller chunks and do not represent so great \"Risk/Reward\" choices they give players a \"Freedom of Choice\" how to make \"Investments\". The ease of understanding the \"Rewards\" received from \"Arithmetic Rewards for Investments\" makes them have \"Predictable Consequences\", both for the players who are making the \"Investments\" and those observing the \"Investments\" being made."
        ],
        "consequences": [
            "When implementing \"Arithmetic Rewards for Investments\" the costs involved have to be balanced compared to other possible \"Investments\" in the game. It is also possible to artificially limit the maximum possible amount used in single \"Investments\" or require minimum amounts to be invested to modulate the \"Risk/Reward\" choices that have to be made. Another way of modulating the \"Risk/Reward\" choices is to not make several identical \"Investments\" using arithmetic reward schemes possible at the same time by imposing \"Time Limits\" between such \"Investments\"."
        ]
    },
    "relations": {
        "instantiates": [
            "predictable-consequences",
            "freedom-of-choice"
        ],
        "modulates": [
            "investments",
            "rewards",
            "risk-reward"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "time-limits",
            "diminishing-returns"
        ],
        "conflicts": [
            "geometric-rewards-for-investments",
            "diminishing-returns"
        ]
    }
}