{
    "name": "Asymmetric Abilities",
    "texts": {
        "definition": "Players, or game elements, do not all have the same actions available.",
        "description": [
            "When not all players have the same actions available, they have [Asymmetric Abilities](asymmetric-abilities). This makes the game more complex in one sense, as more types of actions need to be considered when visualizing future game states, but also makes the experiences of playing the game depend on what role a player has.",
            "[Asymmetric Abilities](asymmetric-abilities) can also exist between the game elements under a player's control. In this case, the variety of actions available gives players more opportunities to create different tactics and increases the value of each game element as losing all elements that have an ability means that the ability is lost to the player."
        ],
        "examples": [
            "The pieces of one type in \"Chess\" have asymmetrical movement abilities compared to all other types.",
            "\"Fox &amp; Geese\" gives the two players different abilities but one player has a single piece that can capture the opponent's pieces while the other player has many pieces that can only move.",
            "Roleplaying games and class-based multiplayer first-person shooters encourage co-operation between players by giving them [Asymmetric Abilities](asymmetric-abilities) that can be put to most efficient use by coordinating actions.",
            "The card game \"Citadels\" lets players have different roles every turn where each role has different special abilities.",
            "The board game \"Space Hulk\" has one player controlling a few space marines with guns under time pressure that do not get reinforcement in conflict with a player controlling many genestealers that can only fight in close combat but continuously get reinforcements and whose numbers are not exactly known the other player."
        ],
        "usage": [
            "The primary reasons for using [Asymmetric Abilities](asymmetric-abilities) are usually to provide [Varied Gameplay](varied-gameplay) or to support [Asymmetric Goals](asymmetric-goals). In [Multiplayer Games](multiplayer-games), this is expanded with the reasons of promoting [Team Play](team-play) and [Social Organizations](social-organizations) (as the division of labor is one characteristic of civilizations). [Asymmetric Abilities](asymmetric-abilities) can either be explicit or implicit in games.",
            "The creation of explicit [Asymmetric Abilities](asymmetric-abilities) is done by designing [Privileged Abilities](privileged-abilities), for example, how [Fog of War](fogof-war) affects vision or what [Communication Channels](communication-channels) are available, but the primary design choices lie in whether to create the asymmetry on a [Unit](units) or player level and how to achieve [Player Balance](player-balance). Choosing asymmetry on the [Unit](units) level makes symmetry possible on the player level and thereby aids in avoiding potential balancing problems. Asymmetry on the player level gives different gameplay experiences for the players but may require rules for determining who plays what role.",
            "Implicit [Asymmetric Abilities](asymmetric-abilities) are not enforced by the game system but depend on either [Asymmetric Information](asymmetric-information) or different levels of [Game Mastery](game-mastery) between players. The former can be intentionally made part of a game design while the latter is more difficult, at least requiring [Trans-Game Information](trans-game-information) as a source of how good players are.",
            "Ways of balancing [Asymmetric Abilities](asymmetric-abilities) include having [Paper-Rock-Scissors](paper-rock-scissors) relations between the abilities, shifting the abilities every turn in [Turn-Based Games](turn-based-games), or playing [Tournaments](tournaments) where every combination of players and abilities are played. When a game has been play tested extensively, [Handicap](handicaps) can be given as a [Balancing Effect](balancing-effects)."
        ],
        "consequences": [
            "[Asymmetric Abilities](asymmetric-abilities) are a consequence of [Privileged Abilities](privileged-abilities). The presence of [Asymmetric Abilities](asymmetric-abilities) modulates the [Right Level of Complexity](right-levelof-complexity) by increasing it unless the asymmetry is temporary. When the asymmetry can be alleviated by the completion of [Gain Competence](gain-competence) goals, this gives rise to [Red Queen Dilemmas](red-queen-dilemmas).",
            "Games may contain [Asymmetric Abilities](asymmetric-abilities) on a [Unit](units) level without having it between players by having the same setup of [Units](units) between players. This is the typical case in games combining [Symmetry](symmetry) and [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) such as \"Chess\" or \"Stratego\".",
            "In the same fashion as with [Units](units), games may have [Asymmetric Abilities](asymmetric-abilities) between players within a team. This encourages [Team Play](team-play) to make the most efficient use of possible actions and often requires [Constructive Play](constructive-play) in the form of [Negotiation](negotiation) to perform [Collaborative Actions](collaborative-actions). However, the development of [Asymmetric Abilities](asymmetric-abilities) of one team compared to another team may be a more relevant way of measuring [Team Development](team-development) in games with [Team Play](team-play).",
            "Games with roles that have permanent [Asymmetric Abilities](asymmetric-abilities) and do not have [Team Play](team-play) can easily have problems with [Player Balance](player-balance) unless they form [Paper-Rock-Scissors](paper-rock-scissors) power relations. However, they do give players a [Freedom of Choice](freedomof-choice) between the roles and varying between these roles gives [Varied Gameplay](varied-gameplay) between game sessions and promotes [Replayability](replayability)."
        ]
    },
    "relations": {
        "instantiates": [
            "gain-competence",
            "collaborative-actions",
            "constructive-play",
            "negotiation",
            "team-play",
            "freedomof-choice",
            "orthogonal-unit-differentiation",
            "varied-gameplay",
            "replayability",
            "social-organizations"
        ],
        "modulates": [
            "fogof-war",
            "game-mastery",
            "communication-channels",
            "asymmetric-goals",
            "team-development"
        ],
        "instantiated_by": [
            "privileged-abilities"
        ],
        "modulated_by": [
            "balancing-effects",
            "tournaments",
            "asymmetric-information"
        ],
        "conflicts": [
            "symmetry",
            "player-balance"
        ]
    }
}