{
    "name": "Avatars",
    "texts": {
        "definition": "Avatar is a game element, which is tightly connected to the player's success and failure in the game. In many cases, the Avatar is the only means through which a player can affect the game world.",
        "description": [],
        "examples": [
            "The computer game \"Paradroid\" used an extended variant of the [Avatar](avatars) pattern. The player controlled a defenseless robot, which could control one other robot, and the gameplay consisted of switching between these second-order [Avatars](avatars) to defeat all robots on a spaceship.",
            "The players are represented as personalized [Avatars](avatars) in Massively Multiplayer Online Roleplaying Games."
        ],
        "usage": [
            "When used, an [Avatar](avatars) is typically the only way in which a player can affect the game world. Thus, of primary importance in the design of an [Avatar](avatars) regarding gameplay is what actions it can perform. By limiting the actions that can be performed early in the game (for example, \"Super Mario\" and \"The Legend of Zelda\" series), the game can provide a [Right Level of Difficulty](right-levelof-difficulty) in the beginning and [Smooth Learning Curves](smooth-learning-curves) as the game commences. Further, the game design can support the [Narrative Structure](narrative-structures) by limiting access to game areas until various [Privileged Abilities](privileged-abilities) have been acquired, either by [Tools](tools) or [Character Development](character-development). The possibility to improve the \"Avatar's\" abilities and attributes through [Character Development](character-development) can thereby be used to merge the development of the [Narrative Structure](narrative-structures) with goals the player has. This can strengthen the player's empathic link with the [Avatar](avatars) as an effect of the [Investments](investments) made while developing the [Avatar](avatars).",
            "[New Abilities](new-abilities) or [Improved Abilities](improved-abilities) given to players can either be given to [Avatars](avatars) or [Characters](characters); the abilities are linked to [Avatars](avatars) when the abilities are only observable through actions in the [Game World](game-world) or there is no abstract representation of a [Character](characters) behind the [Avatar](avatars).",
            "[Avatars](avatars) may be used in a layered fashion where the player's [Avatar](avatars) controls another game element directly. This is presented to the player by replacing the [Avatar](avatars) with the other game element and providing the actions of the game element to the player. Examples of this are the possessing of other droids in \"Paradroid\" and the possibility to enter the driving position in vehicles in \"Battlefield 1942\".",
            "The death or destruction of the [Avatar](avatars) typically signifies the end of the game or the loss of one of the [Lives](lives) available for the [Avatar](avatars). This makes the [Survive](survive) goal an integral part of games using [Avatars](avatars) in [Player Killing](player-killing). Other possible options include the loss of [Privileged Abilities](privileged-abilities), [Score](score), or [Tools](tools).",
            "Many [Avatars](avatars) are designed to let the players feel a positive empathic link towards the [Avatar](avatars) to achieve [Emotional Immersion](emotional-immersion). This can be achieved either through a design so that the [Avatars](avatars) have a sympathetic personality or appearance, have abilities the players would like to have, or have been mistreated. However, they do not usually have strongly developed personalities, as this can prevent the players from interpreting what they want into the \"Avatar's\" actions. Further, if the [Avatar](avatars) can initiate actions on its own, this lessens the players' [Freedom of Choice](freedomof-choice) and may destroy an [Illusion of Influence](illusionof-influence) as well as [Emotional Immersion](emotional-immersion) directed towards other objects or players in the [Game World](game-world). The use of [Avatars](avatars) in [Persistent Game Worlds](persistent-game-worlds) is common to create stronger [Emotional Immersion](emotional-immersion) and a sense of [Ownership.](ownership)"
        ],
        "consequences": [
            "[Avatars](avatars) are the representations of players' [Characters](characters) or are players' [Focus Loci](focus-loci) and are therefore an expression of player [Ownership](ownership). They are what are created by [Producers](producers) when players are [Spawning](spawning). They allow [Improved Abilities](improved-abilities) to be presented to other players within a [Consistent Reality Logic](consistent-reality-logic) by changing the \"Avatar's\" appearance to reflect the current abilities the player has.",
            "The use of an [Avatar](avatars) gives players a focus for [Immersion](immersion) ---particularly [Spatial Immersion](spatial-immersion) when used with [First-Person Views](first-person-views) ---and a focus for [Roleplaying](roleplaying) without affecting [Consistent Reality Logic](consistent-reality-logic) negatively; players can pretend that they are the [Avatars](avatars) on a physical level. The [Spatial Immersion](spatial-immersion) is further increased by the use of a [Camera](cameras) for [Third-Person Views](third-person-views) at the expense of [Consistent Reality Logic](consistent-reality-logic). [God Views](god-views), on the contrary, are not necessarily suitable for use with [Avatars](avatars). Being a [Focus Loci](focus-loci) for players, [Avatars](avatars) can have strong emotional links to the players: what is good for the [Avatars](avatars) is good for the players and what is bad for the avatars is bad for the players. [Avatars](avatars) can provide [Enemies](enemies) for other players, and their abilities usually modulate [Combat](combat) and can provide the basis for [Orthogonal Unit Differentiation](orthogonal-unit-differentiation)."
        ]
    },
    "relations": {
        "instantiates": [
            "spatial-immersion",
            "immersion",
            "ownership",
            "enemies"
        ],
        "modulates": [
            "combat",
            "persistent-game-worlds",
            "player-killing",
            "roleplaying",
            "consistent-reality-logic",
            "survive"
        ],
        "instantiated_by": [
            "mule"
        ],
        "modulated_by": [
            "privileged-abilities",
            "tools",
            "character-development",
            "characters",
            "improved-abilities",
            "producers"
        ],
        "conflicts": [
            "god-views",
            "units",
            "parallel-lives",
            "emotional-immersion"
        ]
    }
}