{
    "name": "Balancing Effects",
    "texts": {
        "definition": "Rules and effects in games that lessen the differences of value used to measure competition between players.",
        "description": [
            "For games where players play against opponents, the players need to feel that they can affect the outcome of the game. If a game is designed with a certain game time or amount of gameplay, and players feel powerless, these players have to two possibilities: endure gameplay that is uninspiring or suffer that gameplay breakdown due to the players desire to stop playing. To avoid these situations, games can have [Balancing Effects](balancing-effects) built into them so that all players are more likely to feel that they have a chance to win over their opponents until the intended conclusion of the competition."
        ],
        "examples": [
            "Power-ups in \"Monkey Race 2\" in \"Super Monkey Ball 2\" give speed boosters only to the players that are not leading the races. Further balancing effects can be added by players through the option that makes the leader have a lower maximum speed than the other players.",
            "multiplayer online first-person shooters often have possibilities to force teams to be balanced in numbers. Some, such as \"Return to Castle Wolfenstein: Enemy Territory\", have functionality that can automatically reassign teams based on experience to try and balance the teams further."
        ],
        "usage": [
            "[Balancing Effects](balancing-effects) can be designed in a game to be preemptive or correcting. Preemptive [Balancing Effects](balancing-effects) try to maintain [Player Balance](player-balance) so that imbalances do not occur, while correcting [Balancing Effects](balancing-effects) try to correct imbalances when they have occurred. An alternative to [Balancing Effects](balancing-effects), which can be used together with them, is [Limited Foresight](limited-foresight). This also gives players a [Perceived Chance to Succeed](perceived-chanceto-succeed) but in this case, it may only be an [Illusion of Influence](illusionof-influence).",
            "[Handicaps](handicaps) are preemptive [Balancing Effects](balancing-effects) that are put into effect before gameplay begins. Making [Extended Actions](extended-actions) into [Interruptible Actions](interruptible-actions) is a form of preemptive [Balancing Effect](balancing-effects) as other players can interfere with the actions, especially if they do not have any effect before they are completed. [Delayed Effects](delayed-effects) in general have a certain [Balancing Effect](balancing-effects), as they give players the possibility to prepare for the effects. Other ways of creating preemptive [Balancing Effects](balancing-effects) consist of designing [Illusionary Rewards](illusionary-rewards), requiring [Tradeoffs](tradeoffs), allowing players to choose [Selectable Sets of Goals](selectable-setsof-goals) that best fit their abilities, or providing [Diminishing Return](diminishing-returns) to players that otherwise could become clear leaders. If the effects are direct, these effects can ruin the [Illusion of Influence](illusionof-influence) for players and even make them avoid trying to achieve what should be goals for them. Having [Balancing Effects](balancing-effects) affect the players indirectly can solve this, for example through [Character Development](character-development) or making [New Abilities](new-abilities) additions to those already used with [Budgeted Action Points](budgeted-action-points).",
            "Examples of correcting [Balancing Effects](balancing-effects) include giving [New Abilities](new-abilities) or [Improved Abilities](improved-abilities) to disadvantaged players and giving [Ability Losses](ability-losses) or [Decreased Abilities](decreased-abilities) to advantaged players. The classic case used in [Races](race) is a [Decreased Ability](decreased-abilities) in the form of [Movement Limitation](movement-limitations) giving a lower maximum speed. To avoid players losing [Illusion of Influences](illusionof-influence), the positive effects are usually [Rewards](rewards) to the disadvantaged players for completing goals, while the negative effects are usually [Penalties](penalties) to the advantaged players for failing goals. The evaluation function that determines the [Balancing Effects](balancing-effects) is for the same reason often hidden from players, for example, by making all [Pick-Ups](pick-ups) look the same though they have different effects, or by hiding the actual rolling of [Dice](dice) to be able to fudge the results. Another example of a correcting is to decide the order of [Turn Taking](turn-taking) so that disadvantaged players give the most advantageous positions.",
            "[Transfer of Control](transferof-control) can also be used to correct imbalances, but these are often linked to the [Rewards](rewards) or [Penalties](penalties) of any of the players. A common solution is to have forced [Shared Rewards](shared-rewards), so that the player who gains the [Reward](rewards) must share it with someone else, typically the most disadvantaged player. Controlling how [Spawning](spawning) occurs can also be corrective, either placing disadvantaged players at [Strategic Locations](strategic-locations) or placing advantaged players at bad locations.",
            "Games with more than two teams or players competing against each other automatically have some corrective [Balancing Effects](balancing-effects). Players in these games perceived as leading may be the starting point of [Mutual Goals](mutual-goals) for [Uncommitted Alliances](uncommitted-alliances), which have the intentions of ganging up against the leader. This is common in games with [King of the Hill](kingofthe-hill) goals but can also be found in games that allow [Player Decided Results](player-decided-results) and [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties). Sufficient [Game State Overviews](game-state-overview), for example, public [Scores](score), so players can notice leaders, are required for this form of [Balancing Effect](balancing-effects) to occur.",
            "[Game Masters](game-masters), as [Dedicated Game Facilitators](dedicated-game-facilitators) that have constant access to the complete game state and can enforce their own [Player Decided Results](player-decided-results), can perform both preemptive and corrective balancing effects during gameplay.",
            "Games using primarily [Randomness](randomness) to judge outcomes can easily be designed to have [Balancing Effects](balancing-effects) over time or when considering several game sessions together. However, games with [Dedicated Game Facilitators](dedicated-game-facilitators) can fake the [Randomness](randomness), for example, the results of [Dice](dice) rolls, to explicitly create [Balancing Effects](balancing-effects) during gameplay."
        ],
        "consequences": [
            "The presence of [Balancing Effects](balancing-effects) strengthens or prolongs players' [Perceived Chance to Succeed](perceived-chanceto-succeed) but lessens the [Perceivable Margins](perceivable-margins) of the game and removes feelings of [Game Mastery](game-mastery) in the game. [Balancing Effects](balancing-effects) often provide the [Right Level of Difficulty](right-levelof-difficulty) and [Smooth Learning Curves](smooth-learning-curves) in games by making challenges sufficiently difficult.",
            "[Balancing Effects](balancing-effects) are used in [Multiplayer Games](multiplayer-games) to avoid too large differences of [Asymmetric Abilities](asymmetric-abilities) between players. They can achieve [Player Balance](player-balance) or [Team Balance](team-balance) during gameplay, often to maintain [Tension](tension) as long as possible in the game and to allow [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses)."
        ]
    },
    "relations": {
        "instantiates": [
            "player-balance",
            "smooth-learning-curves",
            "team-balance",
            "tension",
            "right-levelof-difficulty",
            "perceived-chanceto-succeed"
        ],
        "modulates": [
            "character-development",
            "penalties",
            "asymmetric-abilities",
            "multiplayer-games",
            "transferof-control",
            "improved-abilities",
            "ability-losses",
            "decreased-abilities",
            "spawning",
            "rewards",
            "dice",
            "turn-taking"
        ],
        "instantiated_by": [
            "extended-actions",
            "player-decided-results",
            "movement-limitations",
            "interruptible-actions",
            "illusionary-rewards",
            "budgeted-action-points",
            "handicaps",
            "diminishing-returns",
            "dedicated-game-facilitators",
            "game-masters",
            "tradeoffs",
            "delayed-effects",
            "randomness",
            "score",
            "shared-rewards",
            "rewards",
            "kingofthe-hill"
        ],
        "modulated_by": [
            "game-state-overview",
            "uncommitted-alliances"
        ],
        "conflicts": [
            "perceivable-margins"
        ]
    }
}