{
    "name": "Bidding",
    "texts": {
        "definition": "Players invest resources, usually some kind of a currency, for an uncertain outcome in order to get a reward of some kind.",
        "description": [
            "A [Bidding](bidding) instance is a process consisting of several parts: the bidding where players invest resources with the hope to achieve a certain game state, the determination of the outcome of these investments, and the distribution of possible rewards."
        ],
        "examples": [
            "In \"Poker\", players bid on the value of their card hands. The bidding instance consists of rounds where the players can raise their bids one after another. The player who does not wish to call the last bid matches his bid to the same amount as the last bid, or if he does not wish to raise the bid, he has to fold. The player who folds is out of the [Bidding](bidding) instance and he has to leave his bid in the pot. The [Bidding](bidding) instance ends when there is only one player left or all the remaining players call the last bid. The player with the best hand, or the only remaining player, in the [Bidding](bidding) instance wins the whole bid as the reward.",
            "Kicking out a player from an open game instance of \"Return to Castle Wolfenstein: Enemy Territory\" requires that a certain amount of players have voted for kicking the player out."
        ],
        "usage": [
            "For [Bidding](bidding) to be effective in a game, [Resources](resources) usedhave to be of the [Limited Resource](limited-resources) kind, be it throughout the whole game or just for the specific [Bidding](bidding) instance. Although [Resources](resources) in [Bidding](bidding) events are usually normal game elements, [Bidding](bidding) can also concern [Area Control](area-control) or the order in which players should perform [Turn Taking](turn-taking). Players often have [Direct Information](direct-information) to what is being bid about, in order to do [Tradeoffs](tradeoffs) between what [Resources](resources) they are using in the bidding and what [Resources](resources) they can gain.",
            "[Bidding](bidding) consists of two separate mechanisms: how the [Bidding](bidding) is conducted and how the outcome is determined. The mechanisms for conducting the [Bidding](bidding) can be separated into two categories, open and closed, based on the information available for the participants. Open [Bidding](bidding) means that the players have [Symmetric Information](symmetric-information) about the amount of [Resources](resources) the other players have used in the bid, whereas closed [Bidding](bidding) uses [Asymmetric Information](asymmetric-information). It is also possible to use a hybrid system, where the size of the pot is known to all the players but the amount bid by individual players is not known.",
            "The necessary decision for [Bidding](bidding) is to determine what mechanisms govern the order, if any, of the players doing the [Bidding](bidding) and if there is [Negotiation](negotiation) between the players. The most common way, at least in card and board games, is that players place their bids in a predetermined sequence of [Turn Taking](turn-taking): a round. Some games using this method also allow a player to pass the round, if need be, and in this case, the player can be out of the [Bidding](bidding) instance through [Player Elimination](player-elimination), as is the case in \"Poker\", or still be able to participate in later phases. One [Bidding](bidding) instance can have several rounds, as again is the case in \"Poker\", or there is a predetermined number of rounds, usually just one. [Bidding](bidding) instances with several rounds and some methods of [Social Interaction](social-interaction) between the players can often lead to [Bluffing](bluffing). If the [Bidding](bidding) does not have a predetermined number of rounds, there has to be some other form of end condition for the [Bidding](bidding) instance. Usually the end condition is that all players participating in the [Bidding](bidding) decide to end the [Bidding](bidding) round.",
            "Another way of conducting the [Bidding](bidding) is not to have a specified order for the players but allow them to place the bids in any order. A common way to achieve this is to have just one [Bidding](bidding) round where players secretly placing their bids, and the bids are revealed as soon as all players have done their bids. In cases where there is a [Dedicated Game Facilitator](dedicated-game-facilitators), such as a computer program, it is also possible to have more complex versions of this kind of simultaneous [Bidding](bidding), where the players can also change their bids before the end of the [Bidding](bidding) instance. Usually this involves some kind of [Asymmetric Information](asymmetric-information) about the amount players bid or about the whole bid.",
            "The next phase, how the outcome of the [Bidding](bidding) is determined, has two variants: that the pot is the reward and who wins it is determined in another way, or that the reward is specified outside the [Bidding](bidding) and the bid is used to determine the outcome. \"Poker\" and other [Betting](betting) games are examples of the first variant: the whole bid is the reward and the value of the cards is used to determine who gets the [Reward](rewards). Examples of the second variant are games using voting or auctions, as in both these cases the [Reward](rewards) itself is outside the bid. The first category assumes that the player bids are consumed or transferred after the determination of the outcome. This is not (necessarily) the case in the second category as, for example, in an auction, only the players getting the [Reward](rewards) lose their bids. [Bidding](bidding), especially in the form of voting, is often used in [Player Decided Results.](player-decided-results)",
            "There are two special cases of [Bidding](bidding): auction and voting. Both auction and voting have characteristics where the game state the players are bidding on is actually the same as the [Reward](rewards). In the case of the auction, the [Reward](rewards) is given to the player who has placed the highest bid, and in the case of voting, the majority of votes decide how the game state should change."
        ],
        "consequences": [
            "[Bidding](bidding) offers a way to achieve [Transfer of Control](transferof-control) of [Resources](resources) through [Collaborative Actions](collaborative-actions) with [Player Decided Results](player-decided-results). This offers an alternative to [Combat](combat) regarding how to achieve [Gain Ownership](gain-ownership) or [Eliminate](eliminate) goals. As [Bidding](bidding) nearly always is voluntarily, winning the bid is a [Player Defined Goal](player-defined-goals) concerning how much [Resources](resources) one wants to spend on the [Bidding](bidding), and in the case of [Bidding](bidding) on different objects, what objects to get.",
            "The act of [Bidding](bidding) involves making [Investments](investments) and [Risk/Reward](risk-reward) considerations, and in some cases, can be affected by [Bluffing](bluffing). The [Bidding](bidding) is often a source of [Competition](competition) between players, and the ability to use certain [Resources](resources) in [Bidding](bidding) to gain others can be seen as a form of abstract [Converter](converters)."
        ]
    },
    "relations": {
        "instantiates": [
            "converters",
            "competition",
            "transferof-control",
            "area-control",
            "player-elimination",
            "tradeoffs",
            "player-defined-goals",
            "collaborative-actions"
        ],
        "modulates": [
            "cooperation",
            "resources",
            "gain-ownership",
            "eliminate",
            "turn-taking"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "direct-information",
            "turn-taking",
            "symmetric-information",
            "asymmetric-information",
            "negotiation",
            "betting",
            "bluffing",
            "rewards"
        ],
        "conflicts": []
    }
}