{
    "name": "Cameras",
    "texts": {
        "definition": "Camera is an abstract game element that decides what is the player's current view to the game world.",
        "description": [
            "<B>Example:</B> Real-time strategy games allow the players to move the camera across the whole game world but the position of the game elements, and in many cases not even the terrain, is typically not revealed. God games, in contrast, allow players to have a complete view of the area that is being viewed. First-person shooters, as the name implies, usually provide first-person views while racing games often let players choose between first-person views to support spatial immersion and third-person views that allow better overview of the local game world environment."
        ],
        "examples": [
            "\"Super Mario 64\" provides an exception to the rule that \"Cameras\" are abstract objects that are not explained within the game world: although not affected by events in the game world, the camera, and the cameraman, can be seen in mirrors. Another minor exception is the camera in the party game \"Monkey Boxing\" in \"Super Monkey Ball 2\", which can be hit during the celebration scene when one of the monkeys has won the game."
        ],
        "usage": [
            "The type of \"Camera\" is usually closely linked to how \"Focus Loci\" and \"Spatial Immersion\" are used in the game: games with \"Avatars\" use\"First-Person Views\" or \"Third-Person Views\", while games with \"Units\" use \"God Views\". While \"First-Person Views\" and \"Third-Person Views\" easily support \"Imperfect Information\" to players by limiting their control of the \"Camera\", \"God Views\" can achieve similar effect by using \"Fog of War\".",
            "Games with \"Avatars\" that include fast movement often let the players choose from several different camera views based on \"First-Person View\" or \"Third-Person Views\". Examples of these are chase cameras, which do not follow the \"Avatar\" but missiles or bullets shot by the \"Avatar\" and fly-by cameras, which lock the camera position while tracing the movement of the \"Avatar\".",
            "Making the decision to allow players to control the \"Camera\" include making decision of what \"Extra-Game Actions\" related to \"Cameras\" should be provided: rotation, zooming and absolute movement for \"God Views\" and rotation and zooming movement for \"First-Person Views\" and \"Third-Person Views\". This increases players \"Freedom of Choice\" and \"Spatial Immersion\" (as not only the player can make the \"Avatar\" or \"Unit\" move in the world but also the \"Game World\" move around these) but increases the conflict with \"Consistent Reality Logic\"."
        ],
        "consequences": [
            "\"Cameras\" that can be manipulated by the players allow the players to decide what parts of the \"Game World\" they want to focus their attention on. In games with \"Avatars\" this is typically limited in such a way that the \"Avatar\" is always in the center of the view. This maintains the symmetry between what the \"Avatar\" and the player sees so that \"Tension\" and \"Surprises\" can be achieved and also to strengthen spatial \"Immersion\".",
            "In games with \"Units\", the \"Camera\" movement may be completely free to allow the players to move between different game elements and to enforce them to make \"Tradeoffs\" between which parts of the \"Game World\" to focus their attention on. The ease of the use of the \"Camera\", and relevant \"Game State Overview\", decides how much the game helps the players to perform \"Attention Swapping\"."
        ]
    },
    "relations": {
        "instantiates": [
            "attention-swapping",
            "extra-game-actions"
        ],
        "modulates": [
            "god-views",
            "spatial-immersion",
            "units",
            "tradeoffs"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "fog-of-war"
        ],
        "conflicts": [
            "consistent-reality-logic"
        ]
    }
}