{
    "name": "Camping",
    "texts": {
        "definition": "Staying in one location in the game for extended periods of time and perform the same action repeatedly.",
        "description": [
            "Some areas in games are so advantageous to players that they can form the game tactics on being in that area and letting players and game events come to them. This usually is combined with performing a small range of actions and waiting for the opportunity to do them."
        ],
        "examples": [
            "Weapons in first-person shooters that are good for sniping together with inaccessible areas create opportunities for camping."
        ],
        "usage": [
            "Creating the possibility of [Camping](camping) consist of designing weapons and locations that support the activity. The weapons are typically powerful but do not have to be fast as campers are usual well-prepared. The locations should be difficult to reach, in practice being [Inaccessible Areas](inaccessible-areas) except through the line of fire from the camper.",
            "Making [Camping](camping) difficult or impossible in a game simply consist of making the game design not contain the prerequisites for [Camping](camping)."
        ],
        "consequences": [
            "[Camping](camping) requires that players have [Strategic Knowledge](strategic-knowledge) of weapons and locations in the [Game World](game-world), especially [Inaccessible Areas](inaccessible-areas). Further, it forces them to wait for events to occur which they can react to, making them do [No-Ops](no-ops).",
            "The possibility for [Camping](camping) in a game lessens the incentives for [Varied Gameplay](varied-gameplay) and may disrupt [Player Balance](player-balance) if other players have no or little chance of disrupting the [Camping](camping) activity. [Camping](camping) is especially prone to disrupt game balance when the area watched is a [Spawn Point](spawn-points) as [Spawning](spawning) players have little possibilities to organize. However, in [Team Play](team-play) the [Spawn Points](spawn-points) themselves may be design to support [Camping](camping) to let the team control an extended area based around the [Spawn Point](spawn-points).",
            "[Camping](camping) requires the same kind of actions that are required to succeed with [Stealth](stealth) goals and can easily be designed to be part of such goals. They can also be designed as being part of [Guard](guard) goals when the guarding does not require movement."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "stealth",
            "spawn-points",
            "guard",
            "spawning"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "game-world",
            "inaccessible-areas"
        ],
        "conflicts": [
            "player-balance",
            "varied-gameplay"
        ]
    }
}