{
    "name": "Card Hands",
    "texts": {
        "definition": "A Card Hand consists of the cards, which are owned by the player, but which have not yet been put into play.",
        "description": [],
        "examples": [
            "in \"Poker\" each of the players is dealt five cards, which define the [Card Hand](card-hands) for each player.",
            "\"Bohnanza\" is a card game where the order of the cards in the [Card Hand](card-hands) is important, as the players have to play the cards in a specific sequence."
        ],
        "usage": [
            "The basic design question when using [Card Hands](card-hands) is determining the size of the hand; should all cards be distributed at the beginning of the game or should some cards be left in, for example, a [Drawing Stack](drawing-stacks).",
            "Another fundamental design question regarding [Card Hands](card-hands) is how the size and content of the hands change. Having an initial set of cards that shrinks as cards are played makes use of [Limited Resources](limited-resources) and allows the game designer to limit the length of the game. Refilling the hand continuously as cards are being played creates a [Closed Economy](closed-economies) and frees the game design to determine the game length by other means.",
            "Although most often consisting of [Cards,](cards) a [Card Hand](card-hands) can also consist of [Tiles](tiles) in games that have [Tile-Laying](tile-laying)."
        ],
        "consequences": [
            "[Card Hands](card-hands) are [Containers](container) of [Cards](cards) that assign players [Ownership](ownership) to the [Cards.](cards) Typically [Card Hands](card-hands) are secret to all other players and being able to deduce the other players' hands offers a strategic advantage (i. e. a [Gain Information](gain-information) goal). However, the other players may know how many cards are in the [Card Hand](card-hands) and the cards might be marked, so the players have [Asymmetric Information](asymmetric-information) about the [Card Hands](card-hands) in play."
        ]
    },
    "relations": {
        "instantiates": [
            "gain-information",
            "asymmetric-information",
            "secret-resources",
            "container",
            "ownership"
        ],
        "modulates": [
            "tiles",
            "cards"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": []
    }
}