{
    "name": "Cards",
    "texts": {
        "definition": "Cards are physical game elements used to distribute tokens, often with different characteristics, to players without necessarily revealing the distribution.",
        "description": [
            "Cards are common game elements in traditional games. They provide an easy way to randomize distribution and keep that distribution secret from players. The information can either be secret to all players, as for example when the game uses a stack from which cards are drawn, or known only to one player, as is the case in card games where each player has a card hand. The use of cards also allow game designers to choose the exact distribution, not only guaranteeing the overall chance for a value specified by a card to be drawn but also guaranteeing that certain values will appear during gameplay.",
            "See The Penguin Encyclopedia of Card Games by Parlett for numerous examples of card games."
        ],
        "examples": [
            "The common set of cards, used for example in \"Blackjack\" or \"Poker\", consists of 52 cards split between four suits of 13 cards each, where the 13 cards are numbered from 2 to 10 and include a knight, queen, king and ace.",
            "alternative card designs include the \"card sets\" of collectable card games such as \"Magic: the Gathering\" or \"Illuminati: New World Order\". In both of these several different categories of cards are mixed and are required to be used in order to win, some enabling actions, some acting as resources generators. \"Illuminati: New World Order\" also uses spatial relationships of the \"Cards\" as a meaningful element of the gameplay.",
            "the board game \"Talisman\" uses \"Cards\" to randomize the contents of areas on the game board, and the \"Card Hands\" players possess are public inventories of items found."
        ],
        "usage": [
            "The most well-known card games use the common card pack with 52 cards in four suits. However, there are many other types of card packs and many games use game specific card sets to provide either additional or different information or to have different distributions of the cards.",
            "Games where players have control over the cards, i. e. by using \"Card Hands\", the \"Cards\" are given to players either by distributing all cards before the gameplay begins or by using a \"Drawing Stack\".",
            "\"Cards\" usually are taken out of play after being used once, making them \"Non-Renewable Resources\" and \"Focus Loci\" for the actions they represent, and the actions of playing them can be seen as an abstract form of \"Consumers\" or \"Converters\". Independent of how cards are used by players, most games use \"Discard Piles\" to separate the cards that have been used from others, except for card games which use tricks."
        ],
        "consequences": [
            "Sets of \"Cards\" allow game designers to determine exactly the distribution between different resources, events or outcomes in a game while still providing \"Randomness\". Since cardsare two-sided, the information contained on the card can be distributed in various ways between the two-sides: having no information on one side (except that it is a card in the set) as is the case for traditional cards; marking functionally different cards on both sides but not the specific characteristics or placing one of several categories of information on both sides. This allows fine-tuning of the use of \"Imperfect Information\" in the game design, including using it in \"Book-Keeping Tokens\"."
        ]
    },
    "relations": {
        "instantiates": [
            "randomness",
            "imperfect-information",
            "non-renewable-resources",
            "book-keeping-tokens",
            "focus-loci"
        ],
        "modulates": [],
        "instantiated_by": [],
        "modulated_by": [
            "discard-piles",
            "drawing-stacks",
            "card-hands",
            "consumers",
            "converters"
        ],
        "conflicts": []
    }
}