{
    "name": "Clues",
    "texts": {
        "definition": "Clues are game elements that give the players information about how the goals of the game can be reached.",
        "description": [
            "The clues may be explicit, describing exactly how to reach the goal, or implicit, describing facts and events in the game world which need to be interpreted by the player. Of course, this categorization is not clear-cut, as the vagueness of the clues can vary between these two poles."
        ],
        "examples": [
            "Arrows and signs in \"The Legend of Zelda\" series are direct clues, which can guide the player through the game.",
            "Many racing games contain warnings for the next turns as signs on the side of the road."
        ],
        "usage": [
            "[Clues](clues) may take the form of advice, encouragement, or warning. Advice tells players what to do before they have started performing a set of actions; encouragement provides feedback that a given action is correct although the goal or the closure is not completed yet; and warning gives players advice on what not to do. Encouragement is typically used to indicate completion of low-level subgoals or to promote further [Exploration](exploration) of a given area or object. A more specific encouragement is to use a [Near Miss Indicator](near-miss-indicators) to indicate that the player started performing the right actions but failed to do them correctly.",
            "A [Clue](clues) can either be an object in the game, which has to be taken or manipulated to change the game state, or plain information. In the latter case, the [Clue](clues) is an [Outstanding Feature](outstanding-features) and can also be [Extra-Game Information](extra-game-information) if it is about something outside the [Game World](game-world). Of course, the [Clue](clues) may be about how to use the game controls or the game mechanics, which automatically makes it [Extra-Game Information](extra-game-information). These forms of [Clues](clues), however, may break the [Consistent Reality Logic](consistent-reality-logic) and [Emotional Immersion](emotional-immersion) in the game, with one example being arrows that show the way to the exit of a [Level](levels). If the clues are set within the [Consistent Reality Logic](consistent-reality-logic) of the game or support the [Alternative Reality](alternative-reality) of the game, they can also be used to support the [Narrative Structure](narrative-structures).",
            "Two typical forms of [Clues](clues) are [Helpers](helpers) and [Traces](traces). [Helpers](helpers) can provide [Indirect Information](indirect-information) to the players on how to reach the goals, and [Traces](traces) allow the players to indirectly deduce how to locate [Deadly Traps](deadly-traps) and [Enemies](enemies), for example. Other [Clues](clues) provide more [Direct Information](direct-information), for example, arrow signs to indicate directions where the player should go or explicit warning signs about dangers ahead.",
            "[Clues](clues), especially warnings and [Helpers](helpers), may be used to indirectly guide players who have gone astray toward the goals and the main areas of the [Game World](game-world) thus enacting [Game World Navigation](game-world-navigation). An excellent example of such a [Helper](helpers) is the owl in \"The Legend of Zelda: The Ocarina of Time\", who sometimes flies in to steer the player to the correct places.",
            "The direct use of [Clues](clues) is as goal objects in either a [Gain Information](gain-information) or [Gain Ownership](gain-ownership) goal, for example to learn about [Achilles' Heels](achilles-heels). The player knows about the existence of the [Clue](clues) and strives to retrieve the additional information by going to a specific location in the [Game World](game-world).",
            "A [Clue](clues) may not necessarily lead the players towards actions they perceive as beneficial for the progress in the game. When this is the case, the [Clue](clues) is used to promote actions, which the players would probably not otherwise initiate, in order to support the [Narrative Structure](narrative-structures) or to promote [Player Balance](player-balance) and [Cooperation](cooperation). This may be construed as a [Red Herring](red-herrings) pattern, used to trick players into actions that are against their low-level goals but that may be required to complete the game narrative or to put the players in positions so that they can reach the higher-level goals of the game. [Clues](clues) to finding [Easter Eggs](easter-eggs) are examples of luring players to perform actions that are not necessarily required to complete or win games but can rather be seen as [Clues](clues) to [Unknown Goals](unknown-goals)."
        ],
        "consequences": [
            "[Clues](clues) can be used to provide the [Right Level of Difficulty](right-levelof-difficulty) and [Smooth Learning Curves](smooth-learning-curves), especially in the case where the game provides more [Clues](clues) to the player if the progress is too slow. The [Clues](clues) are often used to guide the player through the [Narrative Structure](narrative-structures) of the game and create [Tension](tension) by signaling the existence of dangers before they actually occur. This is especially the case in adventure games, which use [Clues](clues) as the basic [Resources](resources) of the player.",
            "[Clues](clues) are a form of [Illusionary Reward](illusionary-rewards), since they do not have to help players nor do they actually have to change the game state in a beneficial way for the players."
        ]
    },
    "relations": {
        "instantiates": [
            "indirect-information",
            "smooth-learning-curves",
            "resources",
            "illusionary-rewards",
            "outstanding-features"
        ],
        "modulates": [
            "game-world-navigation",
            "exploration",
            "red-herrings",
            "unknown-goals",
            "levels",
            "alternative-reality",
            "gain-ownership",
            "imperfect-information",
            "narrative-structures",
            "right-levelof-difficulty",
            "easter-eggs",
            "tension"
        ],
        "instantiated_by": [
            "helpers",
            "traces"
        ],
        "modulated_by": [
            "direct-information"
        ],
        "conflicts": [
            "red-herrings",
            "emotional-immersion",
            "consistent-reality-logic"
        ]
    }
}