{
    "name": "Cognitive Immersion",
    "texts": {
        "definition": "Having ones attention focused upon problem-solving aspects of a game.",
        "description": [
            "Many games offer players many possible actions and the possibility to plan several actions ahead. By doing so they let players regard the game as a problem-solving activity and thereby have \"Cognitive Immersion\" in the game.",
            "Although the processes in the human brain regarding emotions and spatial thinking are parts of what are classified as cognitive processes, the meaning of \"Cognitive Immersion\" is limited to that of abstract logical reasoning, as the spatial and emotional immersion has specific meaning regarding gameplay."
        ],
        "examples": [
            "\"Chess\" and \"Go\" are examples of traditional board games that require \"Cognitive Immersion\" for skillful play.",
            "laying puzzles can be seen as a game where the \"Cognitive Immersion\" is completely externalized by the rearrangement of pieces players make while completing the puzzle."
        ],
        "usage": [
            "The basic requirement for \"Cognitive Immersion\" is that players have a \"Freedom of Choice\" between actions and need to consider what action to perform. \"Cognitive Immersion\" can be encouraged by having action and activities requiring abstract reasoning while actions or events disrupting players' attentions make \"Cognitive Immersion\" difficult to maintain. However, \"Cognitive Immersion\" depends heavily on providing the \"Right Level of Complexity\": too little complexity makes the reasoning about actions trivial while too much complexity can lead to \"Analysis Paralysis\" or \"Downtime\" for other players. The level of complexity in games can be increased while still providing \"Cognitive Immersion\" through the use of \"Book-Keeping Tokens\" or other forms of \"Game State Overviews\". Providing a \"Consistent Reality Logic\" can be used to modulate the \"Right Level of Complexity\" by removing the need to have to deal with special cases within a complex environment.",
            "Examples of actions that require \"Tradeoffs\" and \"Risk/Reward\" choices and thereby promote \"Cognitive Immersion\" include \"Game World Navigation\" and \"Resource Management\", especially the use of \"Budgeted Action Points\" or having to choose how to do \"Attention Swapping\" between \"Focus Loci\". \"Memorizing\" is helped by \"Cognitive Immersion\" but does not rely upon \"Tradeoffs\" and \"Risk/Reward\" choices, while \"Constructive Play\" typically encourage \"Cognitive Immersion\" simply because it encourages planning. \"Experimenting\" and \"Puzzle Solving\" allow \"Cognitive Immersion\" as activities in the game rather than as planning activities. \"Disruption of Focused Attention\" events, \"Surprises\", and forced \"Attention Swapping\" between \"Focus Loci\" are all examples of how \"Cognitive Immersion\" can be negatively affected.",
            "\"Emotional Immersion\" and \"Cognitive Immersion\" affect each other negatively: one is difficult to achieve when one has the other, and the game events that are used to promote one usually makes one lose the other form of \"Immersion\"."
        ],
        "consequences": [
            "\"Cognitive Immersion\" is the \"Immersion\" in abstract reasoning about actions, events, and goals in games while playing the game. Being able to reason about these properties of the game does not require \"Perfect Information\" about them but the game need to have \"Predictable Consequences\". Having both \"Predictable Consequences\" and \"Cognitive Immersion\" allows player \"Anticipation\" to emerge but also gives rise to \"Analysis Paralysis\". Games with clearly \"Predictable Consequences\" and game states that are sufficiently easy to generalize can even promote \"Cognitive Immersion\" and \"Stimulated Planning\" as \"Extra-Game Actions\" between game sessions. Games allowing this form of \"Cognitive Immersion\" automatically have a level of \"Replayability\" since players may want to test their plans and strategies."
        ]
    },
    "relations": {
        "instantiates": [
            "immersion",
            "anticipation",
            "analysis-paralysis",
            "downtime"
        ],
        "modulates": [
            "replayability"
        ],
        "instantiated_by": [
            "attention-swapping",
            "game-world-navigation",
            "focus-loci",
            "budgeted-action-points",
            "predictable-consequences",
            "resource-management",
            "puzzle-solving",
            "experimenting",
            "stimulated-planning",
            "right-level-of-complexity",
            "book-keeping-tokens",
            "game-state-overview",
            "constructive-play",
            "memorizing",
            "consistent-reality-logic",
            "freedom-of-choice"
        ],
        "modulated_by": [
            "attention-swapping",
            "tradeoffs",
            "risk-reward",
            "extra-game-actions"
        ],
        "conflicts": [
            "surprises",
            "emotional-immersion",
            "disruption-of-focused-attention",
            "limited-planning-ability"
        ]
    }
}