{
    "name": "Committed Goals",
    "texts": {
        "definition": "Goals that players have entered a form of contract to try and fulfill.",
        "description": [
            "Although most games have many goals in them, players do not have to accept or strive to complete all of them. However, those goals that players have chosen to strive towards and will result in some form of penalty if not completed are committed. The commitment to a goal may, depending on the goal, be present from the beginning of the game or come later during play."
        ],
        "examples": [
            "The winning conditions of games such as \"Chess\" or \"Go\" are [Committed Goals](committed-goals) that players have to strive for; if they are not working toward these conditions, they are not playing the game.",
            "In the board game \"Ticket to Ride\", players can commit to building a railway line between cities. Once committed, the player will at the end of the game either receive a certain amount of points if successful or be penalized by the same amount if the line is not completed. A similar example can be found in the trick-based card game \"Bridge\"."
        ],
        "usage": [
            "One can separate [Committed Goals](committed-goals) into three different categories, and making a goal a [Committed Goal](committed-goals) requires the game designer to choose which category the goal should belong to. The first category consists of the goals that define the winning condition of the game, or subgoals that are required to solve the main goal of the game. The commitment toward completing the goal is the same as the commitment to try and win the game; if a player is performing legal actions in the game but not committed to such a goal, one can argue that the player is not actually playing the game.",
            "The second category of [Committed Goals](committed-goals) includes the first category and consists of those goals that have explicit [Penalties](penalties) within the game if they are not completed. Designing a goal so that it is in this category lets players judge [Risk/Reward](risk-reward) situations and make [Tradeoffs](tradeoffs) between striving to gain the [Rewards](rewards) but possibly receiving [Penalties](penalties) from other [Committed Goals](committed-goals) or vice versa. A simple way of implementing this category of goals is to require [Investments](investments), which lets players choose their level of commitment and ties the penalty of not completing the goal (in the sense of misused [Resources](resources)) and the closeness to a closure to the commitment. Formalized [Collaborative Actions](collaborative-actions), possibly with [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties), can be examples of the second category, as can maintaining [Area Control](area-control).",
            "The third category of [Committed Goals](committed-goals) are those that are not implicitly encoded into the game system, either being those that a player has chosen individually or those decided by players in [Uncommitted Alliances](uncommitted-alliances), often regarding [Collaborative Actions](collaborative-actions) that are not formalized by the game system. The last category has the least commitment from a structural perspective but can be more important than other [Committed Goals](committed-goals) due to [Negotiation](negotiation), [Extra-Game Consequences](extra-game-consequences), and the risk of [Betrayal](betrayal).",
            "Those [Committed Goals](committed-goals) that are governed by explicit game mechanics allow for actions to affect what information players have about them. This includes letting them be [Unknown Goals](unknown-goals), opening up for [Gain Information](gain-information) goals, and modulating the [Risk/Reward](risk-reward) of committing to a goal. [Committed Goals](committed-goals) in the second and third category can be [Ephemeral Goals](ephemeral-goals) and as such they can appear during gameplay and force players to reconsider the [Risk/Reward](risk-reward) of plans and strategies of other goals.",
            "Goals that are [Committed Goals](committed-goals) from the beginning of gameplay cannot be [Optional Goals](optional-goals). However, [Ephemeral Goals](ephemeral-goals) that are made available to players during gameplay can be both [Optional Goals](optional-goals) and \"Commited Goals\"; once a player has accepted this form of goal, the player is then committed, but he is not forced to accept the goal in the first place."
        ],
        "consequences": [
            "[Committed Goals](committed-goals) always have [Penalties](penalties) associated with them. They influence the plan and actions of players and, as such, can be used to make players reach [Closure Points](closure-points) and thereby develop the [Narrative Structure](narrative-structures). If players have information about other players' [Committed Goals](committed-goals), this increases the \"Predictability\" of the game as well as opens up for [Uncommitted Alliances](uncommitted-alliances) to enable ganging up. [Committed Goals](committed-goals) that are also [Unknown Goals](unknown-goals) for players naturally create [Gain Information](gain-information) independently of if those [Gain Information](gain-information) goals are explicitly supported in the game."
        ]
    },
    "relations": {
        "instantiates": [
            "penalties",
            "betrayal",
            "gain-information"
        ],
        "modulates": [
            "ephemeral-goals",
            "risk-reward",
            "rewards",
            "area-control",
            "closure-points"
        ],
        "instantiated_by": [
            "collaborative-actions",
            "investments"
        ],
        "modulated_by": [
            "risk-reward",
            "unknown-goals",
            "negotiation",
            "tradeoffs"
        ],
        "conflicts": []
    }
}