{
    "name": "Communication Channels",
    "texts": {
        "definition": "Communication Channels are the medium and the methods players can use to send messages to other players.",
        "description": [
            "The game itself can be a \"Communication Channel\": players can send \"messages\" to other players by making changes to the game state. This lowest level of communication does not necessarily have interesting social interaction between the players. More interesting situations happen when there is a possibility for verbal and especially non-verbal communication in addition to just sharing the game state."
        ],
        "examples": [
            "In \"Pictionary\", teams score points when members of the team guess correctly the words that one of the members tries to draw within a time limit. The player doing the drawing is not allowed to use any verbal communication. Drawing and non-verbal signs, such as gestures, are the only allowed methods of communication for that player. The players trying to guess the word are, of course, allowed to use verbal communication.",
            "Current MMORPGs usually provide many different kinds of \"Communication Channels\" for the players, from chat channels to predefined gestures for the players' \"Avatars\". Players can, of course, use \"Communication Channels\", such as IRC and even telephones, which are not part of the game system itself."
        ],
        "usage": [
            "For the sake of this brief discussion, the communication methods and channels and social situations are classified in terms of three rather crude and slightly interdependent dichotomies: face to face versus mediated, synchronous versus asynchronous, and verbal versus non-verbal. All these also use a simple model of communication based on the sender sending a message through a channel to the (potential) receiver.",
            "Face-to-face situations occur when players share the same physical location. This is the case for almost all traditional and more current games from \"Hide &amp; Seek\" to \"Chess\" to \"Pictionary\". In face-to-face situations, players use natural non-verbal cues, such as gestures and facial expressions---in many cases unconsciously---as \"Indirect Information\" to determine the current situation. \"Poker\" is perhaps the best example of a game where these natural social cues present only in face-to-face situations have an extremely strong impact on the game play experience. Mediated communication is the opposite: the players are not (necessarily) sharing the same physical location, and the communication between the players is mediated by, for example, semaphores, telephone lines, or computer networks, which all can be considered part of a \"Dedicated Game Facilitator\".",
            "The communication between players can be either synchronous or asynchronous. In synchronous communication players share the situation as there is no significant delay in communication, and the situation usually requires attention from all the participants. Asynchronous communication can have time delays of hours, days, or in extreme cases, millennia between sending the message and receiving it. Asynchronous communication always has to be mediated, in contrast to face-to-face communication where there cannot be time delays between sending and receiving the message. It is possible, however, to devise a situation where there is an enforced time delay in respondingto the message in face-to-face situations using, for example, one-directional mirrors, but this area might remain marginal in commercial games.",
            "Verbal communication is based on using a shared language for messages. The simplest case, of course, is physically talking to other players. Forms of non-verbal communication range from gestures and facial expressions in face-to-face situations to visual messages such as drawings, diagrams, and animations. As the \"Pictionary\" example demonstrated, it is possible to base a whole game on requiring players to communicate by using \"Asymmetric Abilities\". Game systems, as \"Dedicated Game Facilitators\", often provide and control the \"Communication Channels\" available to the players as in most current MMORPGs. In these cases, the game system can even manipulate the characteristics of the \"Communication Channels\" to cause, for example, even more \"Uncertainty of Information\" by garbling the messages. The nature of \"Communication Channels\" used in \"Real-Time Games\" and \"Synchronous Games\" depends on the pace of the game time."
        ],
        "consequences": [
            "Existence and use of \"Communication Channels\" is a prerequisite for any \"Social Interaction\" between players and can heavily influence how \"Social Organizations\" emerge or are maintained. As \"Indirect Information\" requires that information is first translated and then transmitted to players, it also naturally requires that there are \"Communication Channels\" available to transmit the information. \"Communication Channels\" can also cause \"Uncertainty of Information\" for the receiver, if they have disturbances (called \"noise\" in technical contexts) or if the sender can intentionally send false messages. However, \"Communication Channels\" can also be used to ensure that players only get \"Direct Information\" about the game state, without any chance of information being hidden or changed.",
            "Many cases of \"Public Information\" also require that the game state is compressed and translated and then broadcast or otherwise transmitted to the \"Spectators\". Free use of \"Communication Channels\" can also cause social problems within the game in situations where communication is mediated. In order to alleviate this problem, many games that provide chat systems allow players to ban, mute, or otherwise ignore players who use the \"Communication Channels\" inappropriately."
        ]
    },
    "relations": {
        "instantiates": [
            "direct-information",
            "indirect-information",
            "uncertainty-of-information"
        ],
        "modulates": [
            "real-time-games",
            "social-organizations",
            "asynchronous-games",
            "synchronous-games",
            "public-information"
        ],
        "instantiated_by": [
            "dedicated-game-facilitators"
        ],
        "modulated_by": [
            "asymmetric-abilities"
        ],
        "conflicts": []
    }
}