{
    "name": "Configuration",
    "texts": {
        "definition": "Configuration is the goal of forming a spatial, temporal, or logical arrangement of game elements.",
        "description": [
            "Providing goals which consist of arranging game elements according to some predefine rule are a common use of game elements in games where the game elements can be moved. These goals make players try to form a [Configuration](configuration) of the available game elements.",
            "<B>Example:</B> The card game \"Illuminati\" uses [Configuration](configuration) for control groups, which can be spatially arranged to draw benefit of similarities in alignment and maximize the use of control arrows."
        ],
        "examples": [
            "\"Zendo\", an abstract game where the winning condition is to guess a \"Gonfiguration\".",
            "\"Poker\", where winning rounds consists of having the rarest set of a set of predetermined [Configuration](configuration) s."
        ],
        "usage": [
            "The completion of a [Configuration](configuration) goal can require three different forms of challenges. The first, knowing the rules for completing the [Configuration](configuration) is a [Gain Information](gain-information) goal requiring [Imperfect Information](imperfect-information) about the [Configuration](configuration) goal. The second form of challenge can be to find the game elements required, in essence using [Gain Ownership](gain-ownership), while the last is the actual task of putting the game elements in the right [Configuration](configuration) which may require [Puzzle Solving](puzzle-solving). The two first challenges may be designed so that one can perform them in parallel sequences, making them a \"Selectable Set of Goals\", while the third is impossible to complete without completing the two former.",
            "Basically any combination using the size, color, shape, position or other defined characteristics of game elements can be used to create a [Configuration](configuration). However, some configurations are intuitive and will be seen even if they have no explicitly defined by game rules. Thus, even though [Connection](connection), [Alignment](alignment) and [Enclosure](enclosure) are, in one sense, just special cases of configuration, they are very common and intuitive forms, and as such, they are treated as patterns of their own. The use of symmetrical configurations strengthens [Hovering Closures](hovering-closures) and the presence of [Symmetry](symmetry) in the game.",
            "The use of [Configuration](configuration) can be combined with [Continuous Goals](continuous-goals); when this is the case, the goal of [Configuration](configuration) is to use game elements to form a sort of [Combo](combos) that changes values in the game state for as long as the [Configuration](configuration) is maintained. Examples of this can be found linking groups with the same alignments in \"Illuminati\", and defending pieces with other pieces in \"Diplomacy\".",
            "Many games using [Configuration](configuration) allow several different [Configuration](configuration) s which overlap or require some of the same game elements. Used for example in \"Tic-Tac-Toe\" or \"Poker\", these [Configuration](configuration) s form [Selectable Sets of Goals](selectable-setsof-goals) and require players to do [Tradeoffs](tradeoffs) but can also allow [Varied Gameplay](varied-gameplay) and [Unknown Goals](unknown-goals) in more complex games. Different [Configurations](configuration) may be [Excluding Goals](excluding-goals), either because they need the same game element to have different values of the same characteristic or because the completion of one of the goals changes the mode of play. In the former case the goals can be solved in sequence, and if their completion creates [Combo](combos) effects they may be [Supporting Goals](supporting-goals) to each other. However, thy may also require players to do [Tradeoffs](tradeoffs) choices to determine which goals to try and achieve first."
        ],
        "consequences": [
            "[Configurations](configuration) are [Collections](collection) of goals regarding the arrangement of individual game elements. As long as they are not [Unknown Goals](unknown-goals), spatial [Configurations](configuration) give players explicit goals which are their own [Progress Indicator](progress-indicators) and give strong [Hovering Closures](hovering-closures). The feeling that one has missed out something from the [Collection](collection) is a strong urge for keeping on playing. Not finishing the [Collection](collection), especially when the player is given a clear \"Near Miss Indicator,\" can lead to a near-miss effect, which promotes [Replayability](replayability). [Configuration](configuration) goals that allow for several different combinations of game elements, including using different game elements, provide players with a \"Selectable Set of Goals\" as well as increase players' [Freedom of Choice](freedomof-choice).",
            "Goals where the game elements move, or temporal [Configuration](configuration) goals, can require [Timing](timing). The temporal [Configuration](configuration) goals can also be used to require [Rhythm-Based Actions](rhythm-based-actions)."
        ]
    },
    "relations": {
        "instantiates": [
            "hovering-closures",
            "selectable-setsof-goals",
            "collection",
            "puzzle-solving"
        ],
        "modulates": [
            "symmetry",
            "capture"
        ],
        "instantiated_by": [
            "connection",
            "enclosure",
            "alignment",
            "combos"
        ],
        "modulated_by": [
            "timing",
            "gain-ownership",
            "imperfect-information"
        ],
        "conflicts": []
    }
}