{
    "name": "Consistent Reality Logic",
    "texts": {
        "definition": "Consistent Reality Logic governs that the game elements, the player actions and their consequences, and the game events are consistent.",
        "description": [
            "For a game to be consistent means, first, that there are no contradictions or irregularities in the functioning of the game. For example, if the player can blow up a crate, the player should also be able to blow up all other similar crates. Another, more fundamental, layer of consistency concerns the degree to which our intuitive and natural ways of being in the real world are transformed into the metaphors used in the game itself. This means that all games have an internal logic that mimics reality or at least relates to how we understand reality through categories and relations."
        ],
        "examples": [
            "\"The Sims\", one of the most popular computer games ever, takes some of the features of suburban life and blends them into a consistent totality. The play experience is intuitive, seamless, and fluid. This is partly because of a great user interface but also because the [Consistent Reality Logic](consistent-reality-logic) of \"The Sims\" is extremely well constructed. Even though the player actions do not always have a direct counterpart in the real world, the consequences are life-like and consistent."
        ],
        "usage": [
            "A [Consistent Reality Logic](consistent-reality-logic) in a game almost always creates a stronger sense of [Immersion](immersion) even without having realistic audiovisual representations of the game elements. Concentrating on [Consistent Reality Logic](consistent-reality-logic) on the expense of the graphical outlook of the [Game World](game-world) may promote [Cognitive Immersion](cognitive-immersion) instead of [Emotional Immersion](emotional-immersion), and may be more suitable for a particular game design. For example, it is doubtful that the experience of playing computer \"Chess\" would benefit from photorealistic and animated movement of the pieces; the outcome would probably be negative regarding gameplay. A sign of [Consistent Reality Logic](consistent-reality-logic) that is combined with [Emotional Immersion](emotional-immersion) in games is when players can have [Identification](identification) with their [Enemies](enemies).",
            "[Consistent Reality Logic](consistent-reality-logic) also helps players get started. If the actions, events, rules, and especially the [Penalties](penalties) of the game are intuitive and have [Predictable Consequences](predictable-consequences), i. e., they resemble the basic notions of how the reality works, it is much easier to learn the controls and the rules of the game, thus supporting [Smooth Learning Curves](smooth-learning-curves) and [Predictable Consequences](predictable-consequences). This, of course, does not mean that the game should simulate the reality as accurately as possible; on the contrary, games are caricatures of reality, and as such, it is in most cases detrimental to the whole gameplay to make the simulation too real.",
            "Common ways [Consistent Reality Logic](consistent-reality-logic) is challenged include: any kind of [Extra-Game Information](extra-game-information); the use of [Lives](lives), [Rewards](rewards), or [Ability Losses](ability-losses) not motivated by what caused them within the [Game World](game-world); [Spawning](spawning), as this has few plausible real world explanations; and [Easter Eggs](easter-eggs), which provide [Extra-Game Consequences](extra-game-consequences) or [Games within Games](gameswithin-games). \"Clues, Indirect Information\", and [Game Pauses](game-pauses) that are not designed in such way that they function within the [Alternative Reality](alternative-reality) of the game also negatively affect [Consistent Reality Logic](consistent-reality-logic)."
        ],
        "consequences": [
            "The primary design challenge with creating [Consistent Reality Logic](consistent-reality-logic) is how to limit the [Game World](game-world). The most common ways are to partition the [Game World](game-world) into [Levels](levels), to use [Inaccessible Areas](inaccessible-areas), and to make the world appear infinite in size by making movement off an \"edge\" of the [Game World](game-world) cause game elements to enter from the \"other edge.\" [Invisible Walls](invisible-walls) can serve the same purpose but are harder to explain within an [Alternative Reality](alternative-reality). The choice of how to limit the [Game World](game-world) through [Consistent Reality Logic](consistent-reality-logic) can be used to modulate how easy or difficult [Game World Navigation](game-world-navigation) is.",
            "When dealing with the [Consistent Reality Logic](consistent-reality-logic) of the game, two levels of consistency have to be considered: the level of logical contradictions and irregularities between the game elements in the game and the level of how the [Game World](game-world) reflects the real world. The second layer is defined by carefully making the actions and their consequences and the game events consistent with both the internal logic of the game and, to some extent, with the fundamental features of the real world. As previously mentioned, this does not necessarily mean that they should simulate their real-word counterparts, but there should be some resemblance to how we as human beings act and perceive the world. For example, even though \"Tetris\" is an abstract game, the basic actions and events have their counterparts in real life. Moving and rotating objects---in this case, the falling blocks---are very fundamental actions in the real world. Changes in the game can nearly always be explained by real world equivalents: introduction of new game elements can be explained by [Construction](construction), and [New Abilities](new-abilities) can be explained through [Tools](tools) or [Character Development](character-development). Other changes such as [Ultra-Powerful Events](ultra-powerful-events) can be explained through [Storytelling](storytelling) or unfolding of the [Narrative Structure](narrative-structures) without breaking the reality logic, but such changes may require [Downtime](downtime) for players during the explanation.",
            "The first layer of consistency, not having logical contradictions or irregularities in the game, is somewhat easier to deal with. When the basic actions, events, and game elements have been designed for a game, it is just a matter of going through these and checking that there are no outright contradictions in their behavior. For example, if some of the items can be picked up, it makes sense to make all items portable or to otherwise indicate clearly the difference between static and moveable items. [Alternative Reality](alternative-reality) can also be used to mold the elements and actions according to the theme of the game.",
            "The choice of [Focus Loci](focus-loci) easily affects the [Consistent Reality Logic](consistent-reality-logic): [Avatars](avatars) and [Units](units) may maintain it while a controllable [Camera](cameras) or a[God's Finger](god-finger) likely damages it."
        ]
    },
    "relations": {
        "instantiates": [
            "cognitive-immersion",
            "emotional-immersion",
            "immersion",
            "predictable-consequences"
        ],
        "modulates": [
            "game-world-navigation",
            "indirect-information",
            "penalties",
            "game-pauses"
        ],
        "instantiated_by": [
            "levels",
            "inaccessible-areas",
            "symmetry",
            "alternative-reality",
            "construction"
        ],
        "modulated_by": [
            "avatars",
            "character-development",
            "units",
            "downtime",
            "improved-abilities",
            "identification",
            "narrative-structures",
            "gameswithin-games",
            "tools",
            "storytelling"
        ],
        "conflicts": [
            "cameras",
            "invisible-walls",
            "ability-losses",
            "new-abilities",
            "spawning",
            "clues",
            "rewards",
            "easter-eggs",
            "lives"
        ]
    }
}