{
    "name": "Consumers",
    "texts": {
        "definition": "A game element, usually some kind of a resource, is consumed as a consequence of a player action, certain game element configuration, or other type of a game event.",
        "description": [
            "The consumption of the game element means that the element is out of the game totally or that the status of the game element changes radically, as for example blocks in \"Tetris\" having a fixed position after being placed. The latter category, of course, takes the consumption metaphorically, but in some cases it is a useful level of analysis."
        ],
        "examples": [
            "\"Tetris\" has (at least) two levels of \"Consumer\" governing the behavior of the blocks. The first one, when the falling block stops, \"consumes\" the block metaphorically by changing the state from being dynamic and under player control to static. The next consumption level happens when the full horizontally aligned rows are removed from the screen.",
            "in \"Pac-Man\" the pills are consumed by \"Pac-Man\" and ghosts can consume \"Pac-Man\" when he is not under the effect of the power-pill.",
            "the units in \"Civilization\" are consumed, that is, removed from the game, when they lose battles against other units or cities.",
            "in fantasy roleplaying games the hit points of the character are consumed when the character is hurt, for example, in a melee combat."
        ],
        "usage": [
            "From the players' point of view there are two distinct variants: \"Consumer\" as a threat or as an opportunity. The first variant, \"Consumer\" as a threat, is more concrete. The \"Consumer\" in this case is simply something that tries to forcefully take over or destroy the players' \"Resources\". For example, in \"Chess\" the \"Consumer\" pattern dictates that the other player can capture the players' pieces and in \"Civilization\" the units can be eliminated in combat against hostile units. The \"Damage\" pattern can be used to modulate the \"Consumer\" so that the \"Resources\" are not immediately destroyed by the consumption. The players' \"Resources\" can also be automatically depleted according to the game time, to create a \"Time Limit\" and to raise \"Tension\". Another way to create this kind of \"Tension\" is to have a \"Time Limit\" before automatic consumption of the \"Resources\" and giving the players a possibility to control the \"Resources\" before consumption. For example, the \"Tetris\" block is a \"Resource\" for the player, and there is a \"Time Limit\" before the block is consumed by touching other blocks. The player is able to move and rotate the block within that \"Time Limit\". Using \"Non-Renewable Resources\" with Consumer also naturally limits the lifetime of a game instance.",
            "The second variant, \"Consumer\" as an opportunity, is most often used in games based on explicit \"Resource Management\". In these cases the players have certain \"Resources\", for example \"Cards\", which they have to use in order to reach their goals. The \"Resources\" are consumed by the players' actions and the players have to choose which \"Resources\" to use and when, forcing players to do \"Tradeoff\" choices. These \"Resources\" are also often used as \"Investments\" and sometimes in complex chains of \"Producer-Consumers\". Another way to accomplish this is to have the players \"Eliminate\" certain game elements. For example, in \"Pac-Man\" the goal is to eat all the pills in the level, that is, to \"Eliminate\" the pills by \"Contact\" with \"Pac-Man\". Another, slightly more complex, example is the consumption of available space in \"Qix\". To do this the player encloses the area by drawing with the marker."
        ],
        "consequences": [
            "Similar to \"Producer\", \"Consumer\" is almost always an integral part of the \"Producer-Consumer\" pattern and is usually tightly connected to the \"Producer\" part. \"Consumer\" is an abstract pattern but with very concrete effects on the flow of the game. The existence of non-player controlled, and often hostile, \"Enemies\" that can consume players' \"Resources\" are a threat for the player and sometimes also to a motivation for the struggle in the game. For example, without the ghosts being able to consume the \"Pac-Man\" there would not be much of a game left. The \"Consumer\", however, can also be the opposite of a threat, a sort of opportunity, for the player. For example, the consumption of full rows in \"Tetris\" is rewarding to the player in two ways: first, the player's \"Score\" increases and second, there is more room for the player to move the blocks around."
        ]
    },
    "relations": {
        "instantiates": [
            "producer-consumer",
            "tension",
            "eliminate",
            "investments",
            "tradeoffs"
        ],
        "modulates": [
            "deadly-traps",
            "cards",
            "resource-management",
            "resources",
            "eliminate",
            "enemies"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "damage"
        ],
        "conflicts": []
    }
}