{
    "name": "Construction",
    "texts": {
        "definition": "The action of introducing new game elements that are presented as intentional constructions into the Game World.",
        "description": [
            "The introduction of game elements in the game can be the cause of players' actions. When the game elements introduced are perceived as something requiring organizing the environment (in technical terms, countering entropy) this can be framed as \"Construction\"."
        ],
        "examples": [
            "\"Pontifex\" by ChronicLogic allows players to build bridges that are tested by a physics engine that sends a train over the bridges.",
            "\"The Sims\" allows players to construct homes for their Sims, redecorating and rebuilding the houses as the needs and living conditions of the Sims change.",
            "The board game \"The Settlers of Catan\" allows players to build villages and towns at the intersections of hexes in the game, and roads between them.",
            "Massively multiplayer online roleplaying games usually allow players to construct houses by buying them and construct items through actions. Text-based multiplayer dungeons take this further by letting high-level players create new areas in the \"Game World\" and program the functionality of areas and game elements."
        ],
        "usage": [
            "The main design choices for supporting \"Construction\" include the design of the new game elements that are the product of the action, what \"Resources\" are needed, the possibility of succeeding, and the variations in designs that the players can create. Requiring scarce \"Resources\" for construction to occur can give rise to \"Exploration\" or \"Gain Ownership\" as well as \"Trading\". Linking the chance of success to a \"Skill\" encourages \"Construction\" as a \"Competence Area\". Allowing a large variation in the possible \"Constructions\" give players a \"Freedom of Choice\" and the \"Creative Control\" to \"Experiment\" and select \"Player Defined Goals\". The possibility of failed \"Constructions\" leading to alternative \"Constructions\" also encourages \"Experimenting\".",
            "The amount of \"Construction\" in a game can easily be limited by making it a \"Privileged Ability\"."
        ],
        "consequences": [
            "\"Construction\" allows the introduction of new game elements as the effect of \"Producers\", instead of having to rely on \"Spawning\". As such, it can be used to explain within the \"Consistent Reality Logic\" of an \"Alternative Reality\" the appearance of artificial objects by non-automatic processes.",
            "\"Construction\" is typically a form of \"Investment\" but is often perceived as \"Constructive Play\" since the \"Investment\" is toward creating something. When the \"Construction\" gives players sufficient \"Creative Control\" the results can be \"Surprises\". When the players can create game elements that affect the \"Game World\", especially in \"Persistent Game Worlds\", \"Construction\" can enable \"Player Constructed Worlds\". An obvious way to affect the \"Game World\" in this fashion is through \"Tile-Laying\".",
            "Goals to \"Eliminate\" are typically the antithesis of the intentions of \"Construction\" as may be used to create \"Preventing Goals\" and \"Conflict\"."
        ]
    },
    "relations": {
        "instantiates": [
            "competence-areas",
            "surprises",
            "exploration",
            "constructive-play",
            "experimenting",
            "player-constructed-worlds",
            "preventing-goals",
            "investments",
            "player-defined-goals",
            "freedom-of-choice",
            "creative-control",
            "trading",
            "gain-ownership",
            "consistent-reality-logic"
        ],
        "modulates": [
            "persistent-game-worlds",
            "game-world",
            "alternative-reality"
        ],
        "instantiated_by": [
            "producers",
            "tile-laying"
        ],
        "modulated_by": [
            "producers",
            "resources",
            "privileged-abilities"
        ],
        "conflicts": []
    }
}