{
    "name": "Controllers",
    "texts": {
        "definition": "Controllers are game elements fixed in particular locations in the Game World that allow players to perform actions that would not be possible otherwise.",
        "description": [],
        "examples": [
            "First-person shooters, such as \"Quake\", often have doors that have to be opened through activating [Controllers](controllers).",
            "The cannons in \"Super Mario 64\" are [Controllers](controllers) that allow Mario to reach areas otherwise inaccessible by shooting himself from a cannon.",
            "Abstract [Controllers](controllers) can be found in \"Return to Castle Wolfenstein: Enemy Territory\" as players can construct bridges, command centers, and towers in certain places."
        ],
        "usage": [
            "[Controllers](controllers) share many design possibilities with [Tools](tools). After choosing what [Privileged Abilities](privileged-abilities) the [Controllers](controllers) support, a game designer has to decide which [Units](units) or [Avatars](avatars) can use the [Controller](controllers), any specific skills that are needed, and any [Resources](resources) the [Controller](controllers) might consume. However, [Controllers](controllers) differ in some respects from [Tools](tools). First, they are public in the sense that they are stationary, and whoever is near it can activate it (unless specific skills or resources are needed). This means that any [Gain Ownership](gain-ownership) goals related to the [Controllers](controllers) are linked to controlling the game area. Second, they may need [Tools](tools) to be activated besides any requirements on skills and [Resources](resources). Third, as they often are presented as part of a large machine or system, they often can affect something outside the usual reach of [Units'](units) or [Avatars'](avatars) actions without breaking the [Consistent Reality Logic](consistent-reality-logic) of the game. The activation of [Controllers](controllers) can often be the completion of a goal or a [Level](levels). Further, the actions can be both [Extended Actions](extended-actions) (requiring the constant activation of a player) and [Ultra-Powerful Events](ultra-powerful-events) (for example when activating [Moveable Tiles](moveable-tiles)).",
            "The archetypical type of [Controller](controllers) is a [Button](buttons). However, [Controllers](controllers) do not have to be tangible game elements, but they can be areas where the construction or destruction of game elements is possible. Examples of this are boxes of construction material, which can be assembled to specific game elements, such as bridges or bases in \"Return to Castle Wolfenstein: Enemy Territory\"."
        ],
        "consequences": [
            "[Controllers](controllers) are natural [Strategic Locations](strategic-locations) since [Area Control](area-control) over the location gives players or teams access to actions that otherwise may not be performed. In addition, as they are an integral part of the [Game World](game-world) and thus linked to its structure, the actions they provide, including [Ultra-Powerful Events](ultra-powerful-events), usually have greater effects than mere [Tools](tools).",
            "[Controllers](controllers) that are [Resource Generators](resource-generators) provide a way to have [Renewable Resources](renewable-resources) in games and create [Resource Locations](resource-locations) in [Game Worlds.](game-world) Other [Controllers](controllers) are simply [Obstacles](obstacles) that allow players to perform actions to remove them."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-locations",
            "resource-locations"
        ],
        "modulates": [
            "renewable-resources",
            "gain-ownership",
            "moveable-tiles",
            "area-control"
        ],
        "instantiated_by": [
            "buttons"
        ],
        "modulated_by": [
            "resource-generators",
            "tools",
            "helpers"
        ],
        "conflicts": []
    }
}