{
    "name": "Cooperation",
    "texts": {
        "definition": "Players cooperate, i.e., coordinate their actions and share resources, in order to reach goals or subgoals of the game.",
        "description": [
            "[Cooperation](cooperation) in games allows players to divide goals between them and rely upon each other's abilities and resources. It may enable players to perform otherwise impossible actions or may make players feel that they are part of a team. The notion of a fully cooperative game, without any kind of competition or conflict, seems to be a moot point. Games without struggle to achieve some form of goal are not games at all, and any game containing competition or conflict situations automatically introduces struggle and makes full [Cooperation](cooperation) impossible."
        ],
        "examples": [
            "Laying a puzzle together with friends has [Cooperation](cooperation) between the players, but one can still see the puzzle as containing [Competition](competition) (or even [Conflict](conflict)) against the game system or designers of the puzzle.",
            "The members of a \"Soccer\" team have to cooperate in order to beat the opposing team.",
            "In \"Lord of the Rings\", the board game, the players coordinate their actions in order to defeat Sauron. The gameplay in this game is basically fully cooperative since the main goal, defeating Sauron, is common to all players, that is, either the players win the game or they all lose.",
            "MMORPG sections where there is no possibility for destructive player versus player actions, such as attacking or stealing, encourage [Cooperation](cooperation) as the possibility of [Betrayal](betrayal) is lessened. Further, a player that does not cooperate can lose compared to the other players if all the other players collaborate."
        ],
        "usage": [
            "The simplest way to achieve [Cooperation](cooperation) is to use [Team Play](team-play), but equal levels of [Cooperation](cooperation) can be achieved by introducing [Mutual Goals](mutual-goals) with [Shared Rewards](shared-rewards) to players. This creates incentives for the players to strive towards the goals together, and it has been shown that cooperative groups with [Shared Rewards](shared-rewards) perform better, are more strongly motivated, and more willingly engage in [Social Interaction](social-interaction). The [Mutual Goals](mutual-goals), however, do not need to be the highest level goals in the game; that is, it is possible to have [Competition](competition) and [Conflict](conflict) between the players as a high level goal and use [Mutual Goals](mutual-goals) as subgoals for reaching the high level goal.",
            "All [Alliances](alliances) and [Team Play](team-play) are based on [Cooperation](cooperation) between the players. Even the lowest level of [Alliance](alliances), agreeing not to hinder or harm the other player, is a form of [Cooperation](cooperation), as the players coordinate their actions, even though they might not be trying to achieve [Mutual Goals](mutual-goals).",
            "Every mode of play where the players perform actions together for mutual benefit requires [Cooperation](cooperation) from basic [Collaborative Actions](collaborative-actions) to [Trading](trading) and even [Bidding](bidding). The benefit does not have to be direct to all the cooperating players but there can be a time delay for the [Individual Rewards](individual-rewards) as is described in [Delayed Reciprocity](delayed-reciprocity).",
            "[Shared Resources](shared-resources) gives players the opportunity to decide between cooperating on how to use the [Resources](resources) as fairly as possible or going into [Conflict](conflict) over how to use them."
        ],
        "consequences": [
            "[Cooperation](cooperation) increases [Social Interaction](social-interaction) between the players, as they have to coordinate their actions in order to reach the goals of the game. Having, or having the possibility, to cooperate allows players to make use of [Competence Areas](competence-areas) and provides a form of [Constructive Play](constructive-play) as the coordination in itself is a common achievement. [Cooperation](cooperation) is also the basis for having [Social Organizations](social-organizations) and [Social Dilemmas](social-dilemmas) in the game. The different perceived [Social Statuses](social-statuses) of the players may lead to spontaneous chains of command in [Cooperation](cooperation) situations.",
            "Games where [Cooperation](cooperation) and [Competition](competition) coexist raise the level of [Social Interaction](social-interaction) even further and also increase the [Tension](tension) between the players. When there is a possibility of [Betrayal](betrayal) for the cooperating players, this also tends to raise the [Tension](tension) and sometimes lowers the motivation for [Cooperation](cooperation)."
        ]
    },
    "relations": {
        "instantiates": [
            "constructive-play",
            "alliances",
            "betrayal",
            "social-interaction"
        ],
        "modulates": [
            "competition",
            "tension",
            "dynamic-alliances",
            "team-play"
        ],
        "instantiated_by": [
            "collaborative-actions",
            "shared-rewards",
            "team-play",
            "mutual-goals"
        ],
        "modulated_by": [
            "social-statuses",
            "competence-areas",
            "shared-resources",
            "bidding",
            "trading",
            "delayed-reciprocity",
            "individual-rewards",
            "social-dilemmas",
            "social-organizations"
        ],
        "conflicts": [
            "conflict",
            "betrayal"
        ]
    }
}