{
    "name": "Damage",
    "texts": {
        "definition": "Effects from actions or events that can lead to negative consequences.",
        "description": [
            "[Damage](damage) is an indication that players have failed to avoid the actions of enemies or dangerous objects in the game. The effects of [Damage](damage) in most games are minor; it is mainly used as an indicator of how many times one may fail in a certain manor before more serious effects occur."
        ],
        "examples": [
            "Few first-person shooters make all hits instantaneous kills. Rather they require players to succeed with shots or strikes several times, each one giving [Damage](damage), before killing their opponents.",
            "Roleplaying games often have detailed rules for [Damage](damage), dividing character's bodies into different hit areas and having different consequences for taking [Damage](damage) in each area.",
            "In the board game \"RoboRally\" the first points of [Damage](damage) reduced the number of cards received each round. However, more [Damage](damage) makes some cards be repeated each turn and severely limit the possible actions each turn. Even more [Damage](damage) destroys the robot."
        ],
        "usage": [
            "Designing a [Damage](damage) effect consists of determining what type of [Damage](damage) is caused, how the severity of the [Damage](damage) is calculated, how much accumulated [Damage](damage) is needed before additional effects take place, if players can affect the severity of a [Damage](damage), and if [Damages](damage) can be healed or repaired. If the [Damage](damage) comes as an effect of a [Surprise](surprises), the severity of the [Surprise](surprises) is increased but players [Illusion of Influence](illusionof-influence) may be negatively affected.",
            "The most common type of [Damage](damage) is simply a reduction of a health, hit points, or armor [Resource](resources). Additional effects such as forced [Downtime](downtime) and reduced [Skills](skills), or other [Ability Losses](ability-losses), can be used to create other types of [Damage](damage), but these are often reserved for special hits. Independent of how the [Damage](damage) was caused its numerical values can either be fixed or be determined by a function. Fixed [Damage](damage) values give [Predictable Consequences](predictable-consequences) while function can be used to create [Randomness](randomness) and increase the potential interest for each time [Damage](damage) is received.",
            "[Damage](damage) allows modulation of [Eliminate](eliminate) goals so that not one single successful attack eliminates an opponent but rather several successes are required. How much [Damage](damage) can be received before more severe [Penalties](penalties) are inflicted modulates the [Risk/Reward](risk-reward) choices player do when determining if the risk of [Damage](damage) is worth the potential [Rewards](rewards). Giving different [Units](units) different values for this breakpoint can be one dimension in creating [Orthogonal Unit Differentiation](orthogonal-unit-differentiation).",
            "Modulating damage by affecting where it is given can allow players to have an influence of the severity of [Damage](damage). An example of this is the possibility to do instantaneous kills with head shots in many first-person shooters. If it is not obvious where to hit to inflict greater damage, this area is an [Achilles' Heels](achilles-heels) and the information is [Strategic Knowledge](strategic-knowledge).",
            "Player may also diminish or cancel the amount of [Damage](damage) they receive by counter or pre-emptive actions. Examples of counter actions include using [Privileged Abilities](privileged-abilities) (most common in games with the special effect as [Cards](cards)) or performing blocking or parrying maneuvers. Examples of pre-emptive actions include gaining invulnerability or armor, both usually received as [Privileged Abilities](privileged-abilities) of [Power-Ups](power-ups) or [Pick-Ups](pick-ups).",
            "The amount of [Damage](damage) received is usually indicated by a [Status Indicator](status-indicators) in order for players to perceive the severity of the [Damage](damage) and gain knowledge about what caused the [Damage](damage).",
            "If [Damages](damage) can be healed or repaired, they can make [Resources](resources) such as health or armor into [Renewable Resources](renewable-resources). The actual effect of healing or repairing offers the same design choices as for other [Renewable Resources](renewable-resources)."
        ],
        "consequences": [
            "The possibility of [Damage](damage) in games gives [Tension](tension). [Damage](damage) is a form of [Penalty](penalties) and usually has very [Predictable Consequences](predictable-consequences). The cause for receiving [Damage](damage) is the most often due to failing to [Evade](evade) the effects of [Deadly Traps](deadly-traps) or [Combat](combat). Less common reasons for [Damage](damage) include not being the [King of the Hill](kingofthe-hill) or making a [Consumer](consumers) perform actionswhere the resources used are described in terms of [Damage](damage).",
            "Like [Lives](lives), [Damage](damage) can be seen as a measure of how many times one may fail avoiding bad effects in a game before a more severe [Penalty](penalties) is imposed. However, [Damage](damage) works on a smaller scale and may have no effect on player's [Freedom of Choice](freedomof-choice) until the accumulated [Damage](damage) is translated into another form of [Penalty](penalties), typically loss of [Lives](lives) or the destruction of a [Unit](units). When [Damage](damage) gives immediate effects, the most common types of effects are [Ability Loss](ability-losses), forced [Downtime](downtime), or [Disruption of Focused Attention](disruptionof-focused-attention)."
        ]
    },
    "relations": {
        "instantiates": [
            "predictable-consequences",
            "randomness",
            "orthogonal-unit-differentiation",
            "tension"
        ],
        "modulates": [
            "strategic-knowledge",
            "lives",
            "deadly-traps",
            "combat",
            "units",
            "evade",
            "kingofthe-hill",
            "consumers",
            "resources",
            "risk-reward",
            "eliminate",
            "skills",
            "surprises",
            "characters"
        ],
        "instantiated_by": [
            "deadly-traps"
        ],
        "modulated_by": [
            "penalties",
            "status-indicators",
            "ability-losses",
            "downtime",
            "renewable-resources"
        ],
        "conflicts": []
    }
}