{
    "name": "Dice",
    "texts": {
        "definition": "Dice are physical game elements that are used to randomize an outcome from a predefined set of outcomes, each outcome having the same likelihood.",
        "description": [
            "The normal die is 6-sided with markings from one to six but many alternatives exist: 2-sided (coins), 4-sided, 8-sided, 10-sided, 12-sided, 20-sided, 24-sided, and ball-shaped with a 100 markings. It is possible to vary these \"Dice\" further by exchanging the markings with other numbers, or icons representing resources, actions, or other more specific outcomes. The distribution of the outcomes can be further modified with multiple instances of the same outcome in the predefined set, for example, by creating random numbers from one to three using two markings for each of the numbers in a 6-sided die. Several \"Dice\" can be used together to create approximations of normal distributions.",
            "See Dice Games Properly Explained by Knizia for numerous examples of dice games."
        ],
        "examples": [],
        "usage": [
            "Although not mechanically necessary in computers, \"Dice\" can be used in computers either because the non-computerized game use \"Dice\" or because \"Dice\" provide a well-known means of randomizing with well-known distributions. In computer games, the outcome of a die roll may, of course, be fudged to achieve \"Balancing Effects\" but the player may over time perceive this and this may prevent the \"Perceived Chance to Succeed\"."
        ],
        "consequences": [
            "\"Dice\" support \"Randomness\" and \"Luck\" in games, and in the case of more complex combinations, the possibility of \"Strategic Knowledge\". They are most common when simulating real world actions and events that are difficult to exactly predict, for example \"Combat\" or how successful uses of \"Skills\" are. They are the \"Focus Loci\" for abstract actions depending on the outcome of the \"Dice\"."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "focus-loci",
            "randomness",
            "luck"
        ],
        "modulates": [
            "combat",
            "skills"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "balancing-effects"
        ],
        "conflicts": []
    }
}