{
    "name": "Discard Piles",
    "texts": {
        "definition": "The Discard Pile is the area or stack where cards or tiles are placed after they have been used.",
        "description": [
            "The use of \"Discard Piles\" is common in all games that use cards."
        ],
        "examples": [],
        "usage": [
            "\"Discard Piles\" can be either closed or opened. Closed \"Discard Piles\" hide the important information of the game elements in them and do not let the players go through the piles. These piles can be used to provide an advantage of \"Memorizing\" (with the most famous example being the cards played in games such as \"Blackjack\"). Open \"Discard Piles\", by contrast, either place the game elements so that they can all be seen or allow the players to go through the pile. These open piles support \"Stimulated Planning\" but may also cause \"Analysis Paralysis\" since they allow players a more complete view of the game state.",
            "\"Discard Piles\" make possible a certain kind of \"Privileged Ability\": going through the \"Discard Pile\" and taking, or directly using, one of the items in the pile."
        ],
        "consequences": [
            "The most basic function of \"Discard Piles\" is purely bureaucratic: it defines a place where to place the used game elements. However, the size of the \"Discard Pile\" allows players to judge the progress of the game.",
            "\"Discard Piles\" are often combined with \"Drawing Stacks\" to create a \"Closed Economy\" of cards or tiles; when the \"Drawing Stack\" is depleted, a new is created by shuffling all the game elements in the \"Discard Pile\" and making it the new \"Drawing Stack\"."
        ]
    },
    "relations": {
        "instantiates": [
            "stimulated-planning",
            "memorizing"
        ],
        "modulates": [
            "tiles",
            "analysis-paralysis",
            "cards"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": []
    }
}