{
    "name": "Drawing Stacks",
    "texts": {
        "definition": "A Drawing Stack is the collection of cards or tiles that are drawn in sequence by the players.",
        "description": [
            "[Drawing Stacks](drawing-stacks) are used in card games that do not distribute all cards or tiles to the players at the beginning of the game."
        ],
        "examples": [
            "A special case can be found in collectable card games, such as \"Magic: The Gathering,\" where players get to construct their own [Drawing Stacks](drawing-stacks) before the gameplay begins."
        ],
        "usage": [
            "Although [Drawing Stacks](drawing-stacks) are most commonly used for [Cards](cards) they can also be used for [Tiles](tiles), and then most often to introduce [Randomness](randomness) into [Tile-Laying](tile-laying). Multiple [Drawing Stacks](drawing-stacks) can be used to allow the players to perceive a chance of [Luck](luck) as well as making it easier to judge the individual sizes of the stacks. If certain categories of the [Cards](cards) or [Tiles](tiles) are specially marked, multiple stacks may also be used to distinguish these and let players choose within which subset of [Cards](cards) or [Tiles](tiles) they draw. A special case of having additional [Drawing Stacks](drawing-stacks) is to use drafting, i. e. by having some [Cards](cards) or [Tiles](tiles) placed openly beside the [Drawing Stack](drawing-stacks), which can be chosen instead of the topmost items from the stack.",
            "[Drawing Stacks](drawing-stacks) are usually combined with [Discard Piles](discard-piles), stacks of [Cards](cards) or [Tiles](tiles) that have been used in the game after having been drawn.",
            "Collectable card games allow the players to have individual [Drawing Stacks](drawing-stacks) which they have created within certain boundaries. This allows the players to create various strategies and make [Tradeoffs](tradeoffs) between commonality and the variety of the types of cards."
        ],
        "consequences": [
            "[Drawing Stacks](drawing-stacks) are a form of [Container](container) for game elements. [Drawing Stacks](drawing-stacks) makes it possible to define the exact distribution of outcomes while providing a random and secret sequence in which they occur. However, the order is set once the stack has been shuffled. Many card games use [Drawing Stacks](drawing-stacks) to postpone the distribution of cards to the players, in effect causing the players to have [Imperfect Information](imperfect-information) and only [Limited Foresight](limited-foresight) of the resources they will have, forcing them to plan for several possible distribution possibilities. [Drawing Stacks](drawing-stacks) give players a sense of how many cards have been played and how many are left to play, which can support [Stimulated Planning](stimulated-planning)."
        ]
    },
    "relations": {
        "instantiates": [
            "container",
            "randomness"
        ],
        "modulates": [
            "tiles",
            "cards"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": []
    }
}