{
    "name": "Early Elimination",
    "texts": {
        "definition": "There is a possibility that a player's game session may finish before the other players.",
        "description": [
            "\"Early Elimination\" is usually considered to be an unwanted feature in multiplayer games with long play time, especially in the case of face to face board or card games, as the eliminated player remains outside the play for the rest of the game instance."
        ],
        "examples": [
            "it is possible, although quite rare, to eliminate one of the players in \"Magic: The Gathering\" in the early phases of the game instance.",
            "in \"Counter-Strike\" the players can be killed in very early phases of the game round and they remain outside the play for the rest of the round. Some configurations of \"Counter-Strike,\" however, allow the eliminated players to observe what is happening during the game."
        ],
        "usage": [
            "\"Early Elimination\" requires that there is \"Player Elimination\" in the first place. An easy way to introduce \"Early Elimination\" is to make the possibilities to complete \"Eliminate\" goals present from the beginning of gameplay. For example, in \"Counter-Strike\" one well-placed shot from the enemy is all it takes to \"Eliminate\" a player. The available actions do not have to instantly \"Eliminate\" players. The same can be achieved if the effects of harmful actions can be stacked or accumulated in a short time in such way that the player is taken out of the game.",
            "\"Early Elimination\", however, does not require that the fulfillment of \"Eliminate\" goal can take place in the early phases of the game. For example, \"Monopoly\" has \"Early Elimination\" because it is possible to \"Eliminate\" players while there is still potentially hours of remaining play time although more than an hour can already have passed. In case of \"Monopoly\" this amount of possible \"Downtime\" in social play is often far too long. The length of the possible \"Downtime\" is ultimately what matters and has different consequences depending on if the game is played in face to face situation with friends or anonymously over the net. Some of the downsides of \"Early Elimination\" can be avoided by setting known \"Time Limits\" for the game instances and letting the players modify this \"Time Limit\" according to their needs. Another way is to let the \"Eliminated\" players participate in the game in some manner, for example, as \"Spectators\" or as neutral \"Enemies\" for the rest of the players."
        ],
        "consequences": [
            "\"Early Elimination\" is, in one sense, just a more drastic version of \"Player Elimination\". \"Early Elimination\" has a similar effect on \"Tension\" during the play, but in the end the concrete consequences of \"Early Elimination\", that the player is outside the play for the rest of the game instance, in most cases reduced the heightened \"Tension\". This effect, of course, is dependent on the average play time of each game instance. Short game instances with \"Early Elimination\" are quite similar to games with \"Spawning\", but if the resulting \"Downtime\" for the players can be long it is worthwhile to consider carefully whether to introduce \"Early Elimination\" to the game."
        ]
    },
    "relations": {
        "instantiates": [
            "downtime",
            "tension"
        ],
        "modulates": [
            "multiplayer-games"
        ],
        "instantiated_by": [
            "player-elimination"
        ],
        "modulated_by": [
            "spectators",
            "spawning",
            "time-limits"
        ],
        "conflicts": [
            "spawning"
        ]
    }
}