{
    "name": "Eliminate",
    "texts": {
        "definition": "Eliminate is the goal to remove a game element from its location in the game space.",
        "description": [
            "Games may offer the removal of game elements for several reasons: the game elements may hinder actions, may pose a threat to the player goals, or their removal may simply be a goal in itself that is rewarded. The removal of game elements is not necessarily permanent; the board game \"Ludo\" lets players reinsert taken pieces, and many multiplayer first-person shooters let people spawn again after being killed, both as ways to allow the same number of [Avatars](avatars) or game elements in the game for as long as the game continues."
        ],
        "examples": [
            "In \"Backgammon\", a single opponent's piece is removed from play when taken, but the piece can be brought back to the game later.",
            "\"Counter-Strike\" differs from many first-person shooters in that players who are killed are eliminated for the remainder of the match.",
            "The single-player puzzle game \"Peg Solitaire\" consists of eliminating all game elements from the game board save one."
        ],
        "usage": [
            "The main consideration when employing [Eliminate](eliminate) is choosing what game element can be eliminated. The goal object is usually, but not necessarily, a game element that is controlled by another player or the game system, making [Eliminate](eliminate) become a subpattern of [Overcome](overcome). Common [Eliminate](eliminate) goals are to destroy [Resource Generators](resource-generators) or to defeat [Boss Monsters](boss-monsters) in order to advance to the next [Level](levels). The goal to [Eliminate](eliminate) can easily be made into a [Hierarchy of Goals](hierarchyof-goals) by using [Damage](damage) so that several successful actions must be performed before the goal is completed.",
            "[Eliminate](eliminate) typically uses another pattern to describe the exact method of elimination. [Combat](combat), through melee or [Aim & Shoot](aim-shoot) actions, is the most common means to achieving [Eliminate](eliminate) goals. Luring opponents into [Deadly Traps](deadly-traps) is another possibility but typically requires more indirect actions. \"Backgammon\" uses a [Contact](contact) pattern to define how to do the actual elimination, but there are many other possibilities. However, elimination can occur through the non-action of the players controlling the game element, e. g., folding in \"Poker\" or other games containing [Bidding](bidding). [Tournaments](tournaments) also typically contain the [Eliminate](eliminate) pattern as players strive to eliminate each other through [Player Elimination](player-elimination).",
            "The game elements removed by the fulfillment of the goal do not have to be removed permanently. However, even if elimination only is temporary, it usually involves some sort of [Penalty](penalties) for the player who controlled the eliminated game element. This typically takes the form of the game element being transferred back to a [Spawn Point](spawn-points) or having the game element out of play for a certain amount of time, possibly leading to [Limited Set of Actions](limited-setof-actions) or forcing players to perform [No-Ops](no-ops). The effect of [Eliminate](eliminate) can of course be expanded to remove players from game sessions as well through [Player Elimination](player-elimination).",
            "Strategy games that have cities or other types of [Resource Generators](resource-generators) use [Eliminate](eliminate) in order to get rid of the produced [Units](units). The gameplay in those games is usually about maintaining a steady growth of available [Units](units) to overwhelm the opponent."
        ],
        "consequences": [
            "[Eliminate](eliminate) requires the disappearance of some game element from gameplay, and the player fulfilling such a goal is therefore a form of [Consumer](consumers). If the game elements to be eliminated are controlled by another player, this player can be considered an [Enemy](enemies) and usually has the [Preventing Goals](preventing-goals) of [Survive](survive) or [Evade](evade). [Eliminate](eliminate) easily creates [Tension](tension) and may cause [Conflict](conflict) between players, especially if the [Eliminate](eliminate) concerns game elements that are the effect of other players' [Construction](construction) actions.",
            "[Eliminate](eliminate) can also be used to speed up and simplify gameplay in the end phase of a game by successively removing game elements during the early gameplay so that only a few remain at the end of the game. As the pieces that remain have increased values in this context, this use of [Eliminate](eliminate) supports [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses).",
            "[Eliminate](eliminate) does not necessarily have to be destructive towards players; the [Collection](collection) of [Resources](resources) and [Pick-Ups](pick-ups) in [Real-Time Games](real-time-games) that destroy and change game values are examples of how the [Eliminate](eliminate) goal is a part of the [Converter](converters) effect of completing [Gain Ownership](gain-ownership) goal."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "combat",
            "penalties",
            "last-man-standing",
            "enemies",
            "preventing-goals",
            "boss-monsters",
            "player-elimination"
        ],
        "modulates": [
            "resource-generators",
            "units",
            "capture"
        ],
        "instantiated_by": [
            "consumers"
        ],
        "modulated_by": [
            "damage",
            "deadly-traps",
            "bidding",
            "consumers",
            "contact",
            "survive",
            "evade"
        ],
        "conflicts": []
    }
}