{
    "name": "Empowerment",
    "texts": {
        "definition": "Players feel that they can affect the events and the final outcome of a game.",
        "description": [
            "Games let players make choices or perform actions that can affect the outcome of the game. This possibility to have an influence over what happens is a form of power and gives players a feeling of [Empowerment](empowerment) simply by playing games. Playing a game can thereby be seen as an agreement among all players to give each other clearly defined powers within a game session that are described by the rules of the game. However, this [Empowerment](empowerment) is bounded by the rules of the game and the wills and actions of other players, so the level of [Empowerment](empowerment) depends upon the specific game design of a game and upon who the other players are."
        ],
        "examples": [
            "Gaining new weapons in first-person shooters or gaining access to new units in real-time strategy games empowers players either by letting them perform actions they could not perform before or by making their actions have more powerful effects.",
            "roleplaying games allow players the highest levels of [Empowerment](empowerment), as players and game masters can construct entire worlds, invent and play out stories within them, and change the rules to fit the participants of the game."
        ],
        "usage": [
            "[Empowerment](empowerment) can be designed in games both as being present from the start of gameplay and as something that grows as players complete goals.",
            "[Self-Facilitated Games](self-facilitated-games) always have a high presence of [Empowerment](empowerment) on a meta level throughout the entire gameplay, since the enactment of rules is only enforced by the players, and the rules may be changed at the will of the players. This is also the case in games with [Game Masters](game-masters), but here the [Empowerment](empowerment) is more formalized and also affects gameplay directly through [Player Decided Results](player-decided-results), although the players may not be aware of the changes on either of the levels. Judgeshave a similar, but more restricted, form of [Empowerment](empowerment) as [Game Masters](game-masters) but these powers may only lie within certain areas of the game or be available until a certain [Time Limit](time-limits) has expired. Other ways of empowering players throughout gameplay but within the rules include [Player Constructed Worlds](player-constructed-worlds), [Creative Control](creative-control), and voting.",
            "Incremental [Empowerment](empowerment) can be used to enable [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses) and synchronize these with the development of [Narrative Structures](narrative-structures). Common ways to incrementally give players [Empowerment](empowerment) during gameplay are through [Improved Abilities](improved-abilities) and [New Abilities](new-abilities), especially if they are [Privileged Abilities](privileged-abilities), or the power to choose how to use [Producers](producers) or [Converters](converters). [New Abilities](new-abilities) can further empower players by giving them a larger [Freedom of Choice](freedomof-choice), and [Privileged Abilities](privileged-abilities) can empower individual players by giving them [Competence Areas](competence-areas) in games with [Team Play](team-play). [Red Queen Dilemmas](red-queen-dilemmas) can easily emerge from designs where players are competing against other players regarding [Empowerment](empowerment), commonly based on [Social Status](social-statuses) or [Gain Competence](gain-competence) goals."
        ],
        "consequences": [
            "Players that have [Empowerment](empowerment) in gamesoften have a larger [Freedom of Choice](freedomof-choice) than other players and easily have [Emotional Immersion](emotional-immersion), as they can help develop the course of the game in the direction they choose. [Empowerment](empowerment) is usually achieved through games providing the [Right Level of Difficulty](right-levelof-difficulty) and players achieving [Game Mastery](game-mastery), but levels of it can also be provided through [Stimulated Planning](stimulated-planning) or even by players [Memorizing](memorizing) the [Strategic Knowledge](strategic-knowledge) in the game.",
            "Unless [Empowerment](empowerment) is provided or given equally, it may disrupt [Player Balance](player-balance). This can partially be mitigated through [Time Limits](time-limits), [Role Reversals](role-reversal), and ganging up. In [Team Play](team-play), the effects of unequal [Player Balance](player-balance) between players in the same team may not be a problem as long as [Team Balance](team-balance) exists, but [Social Status](social-statuses) within the game may give another form of [Empowerment](empowerment)."
        ]
    },
    "relations": {
        "instantiates": [
            "competence-areas",
            "emotional-immersion"
        ],
        "modulates": [
            "gain-competence",
            "red-queen-dilemmas",
            "team-play",
            "narrative-structures"
        ],
        "instantiated_by": [
            "social-statuses",
            "strategic-knowledge",
            "stimulated-planning",
            "player-decided-results",
            "converters",
            "producers",
            "freedomof-choice",
            "player-constructed-worlds",
            "game-mastery",
            "memorizing",
            "privileged-abilities",
            "new-abilities",
            "improved-abilities",
            "creative-control",
            "right-levelof-difficulty",
            "game-masters"
        ],
        "modulated_by": [
            "time-limits",
            "role-reversal"
        ],
        "conflicts": [
            "player-balance",
            "team-balance"
        ]
    }
}