{
    "name": "Extra-Game Actions",
    "texts": {
        "definition": "Actions that are motivated by the game state or game design but do not affect the game state as such.",
        "description": [
            "Games can support actions that are based on the conditions in a game session but which does not affect the game state. These forms of actions are [Extra-Game Actions](extra-game-actions) since on one level they do not take place within the game. However, they are dependent on the current game state so their effects are dependent on when in a game session they are performed."
        ],
        "examples": [
            "Betting on the outcome of a game is a typical form of [Extra-Game Actions](extra-game-actions) that creates a meta game based upon a game. Note that games such as \"Poker\" do not have betting as an [Extra-Game Action](extra-game-actions) since folding in that game affects the game state.",
            "loading and saving in computer games are [Extra-Game Actions](extra-game-actions) which save or restores the entire game state of a game instance. As the whole game state is affected these actions are not considered parts of gameplay but rather ways of setting up play sessions."
        ],
        "usage": [
            "[Extra-Game Actions](extra-game-actions) are used for four different forms of effects: to plan or prepare for gameplay before play sessions have begun, to provide [Extra-Game Consequences](extra-game-consequences), to change the information players receive about the game state, or to change the entire game state. They are especially common in [Multiplayer Games](multiplayer-games) as players may need to do [Negotiation](negotiation) or perform [Collaborative Actions](collaborative-actions).",
            "Games promote players to perform [Extra-Game Actions](extra-game-actions) before play sessions begin by providing [Stimulated Planning](stimulated-planning) through [Strategic Knowledge](strategic-knowledge), for example by letting players know their [Privileged Abilities](privileged-abilities) well in advance, or by letting players have [Creative Control](creative-control) over [Character](characters) or game elements used. This use of [Creative Control](creative-control) is especially common in roleplaying games where players can either design their own characters or, in the case of live action roleplaying games, design the physical clothes and props used in the games. Thus, it is also common in games with [Planned Character Development](planned-character-development) but even more so in [Multiplayer Games](multiplayer-games) with [Team Development](team-development).",
            "[Extra-Game Consequences](extra-game-consequences) can create [Meta Games](meta-games) or give players [Trans-Game Information](trans-game-information) such as providing information about how to perform [Combos](combos). [Storytelling](storytelling) to give players [Emotional Immersion](emotional-immersion) within games can also be considered [Extra-Game Consequences](extra-game-consequences) as the game state could have been updated without the [Storytelling](storytelling).",
            "One special form of [Extra-Game Action](extra-game-actions) is to allow non-players to help players temporarily. This typically requires [Spectators](spectators) with [Public Information](public-information) if the helpers should provide information about the game state or other information relevant to succeed in goals.",
            "Manipulating [Book-Keeping Tokens](book-keeping-tokens) are [Extra-Game Actions](extra-game-actions) that likely change players' perception of the game state since the actions change the game state. Changing how players are informed about the game state can either be done directly through manipulating a [Camera](cameras) or by changing the set-up of an user interface, but in both cases modify the [Game State Overview](game-state-overview) players have. Saving and loading game states are [Extra-Game Actions](extra-game-actions) that allow [Save-Load Cycles](save-load-cycles) and [Reversability](reversability) to previous game states. Other player initiated [Game Pauses](game-pauses) are also simple cases of [Extra-Game Actions](extra-game-actions)."
        ],
        "consequences": [
            "[Extra-Game Actions](extra-game-actions) provide players with an additional level of [Freedom of Choice](freedomof-choice) in games which can be done without necessarily affecting the development of the game. Except for [Storytelling](storytelling), [Extra-Game Actions](extra-game-actions) typically causes players to lose [Immersion](immersion) since they force players to consider the mechanical or formal structure of the game. [Cognitive Immersion](cognitive-immersion) is the form of [Immersion](immersion) least affected, since both saving and restoring game states and manipulating information presentation may be motivated by players' interpretations of the game state. Performing [Extra-Game Actions](extra-game-actions) can be considered [Investments](investments) in games which are either not parts of specific game instances or not explicitly related to changes in the game state.",
            "[Self-Facilitated Games](self-facilitated-games) requires players to do [Extra-Game Actions](extra-game-actions) to run the game. In the case of games with [Persistent Game Worlds](persistent-game-worlds) these action are [Investments](investments) but typically give players large amounts of [Creative Control](creative-control)."
        ]
    },
    "relations": {
        "instantiates": [
            "meta-games",
            "stimulated-planning",
            "emotional-immersion",
            "investments",
            "creative-control",
            "freedomof-choice"
        ],
        "modulates": [
            "cognitive-immersion",
            "multiplayer-games",
            "planned-character-development",
            "team-development",
            "game-state-overview"
        ],
        "instantiated_by": [
            "strategic-knowledge",
            "collaborative-actions",
            "cameras",
            "persistent-game-worlds",
            "negotiation",
            "game-pauses",
            "combos",
            "storytelling"
        ],
        "modulated_by": [
            "spectators",
            "reversability",
            "public-information"
        ],
        "conflicts": [
            "immersion"
        ]
    }
}