{
    "name": "First-Person Views",
    "texts": {
        "definition": "Players are shown the game world as if they were inside it",
        "description": [
            "Games where players control individual game elements and move them in the game environment often present that environment to the players as the game element would \"see\" the environment. This \"First-Person View\" then lets players receive natural feedback to movement in the environment in a way that corresponds to the feedback one receives when doing the same movement in the real world."
        ],
        "examples": [
            "As the name indicates, all first-person shooters make use of \"First-Person Views\"."
        ],
        "usage": [
            "\"First-Person Views\" give players a view of the \"Game World\" from within it, and the primary design choices for game designers involve choosing how players can control what they are viewing and if the presentation players are given uses human-like vision capabilities or augmented capabilities, such as infrared, radar, or night vision.",
            "Since \"First-Person Views\" do not provide \"Game State Overviews\" in the way \"Third-Person Views\" or \"God Views\" do, they are sometimes augmented with different forms of indicators, primarily \"Status Indicators\", to compensate. Another way to provide more information for players is to have wider field of view than humans have by using fisheye views, up to the point of giving 360 degree view. In any case, \"First-Person Views\" provide \"Fog of War\".",
            "\"First-Person Views\" can also be used to provide \"Public Information\" which is focused upon a specific part of the \"Game World\" and can also by used to give \"Spectators\" a sense of \"Spatial Immersion\"."
        ],
        "consequences": [
            "Since \"First-Person Views\" provide players with feedback similar to that receive when performing movement in the real world, these views support \"Spatial Immersion\" and \"Dexterity-Based Actions\" such as \"Maneuvering\" and \"Aim &amp; Shoot\" in the \"Game World.\""
        ]
    },
    "relations": {
        "instantiates": [
            "spatial-immersion",
            "fog-of-war"
        ],
        "modulates": [
            "aim-shoot",
            "maneuvering",
            "game-state-overview",
            "dexterity-based-actions",
            "public-information",
            "game-world"
        ],
        "instantiated_by": [
            "avatars"
        ],
        "modulated_by": [
            "status-indicators"
        ],
        "conflicts": [
            "god-views",
            "game-state-overview"
        ]
    }
}