{
    "name": "Fog of War",
    "texts": {
        "definition": "The player has no information about game world areas that are not being observed or have not yet been explored",
        "description": [
            "Many strategy games hide information about areas at the beginning of the game, typically marking these areas as grayed out or otherwise covered. As all players are subject to this lack of information they may do actions which would otherwise be bad tactical moves, in one way simulating [Fog of Wars](fogof-war) of older battlefields. As having knowledge of the surroundings is a tactical advantage, the unexplored areas encourage exploration and to further support this, the edges of the unknown areas often reveal some information, for example having the areas \"fogging out\" around the edges.",
            "[Fog of War](fogof-war) is typically used in an additional way besides hiding the terrain. Even if the areas have been explored, the movement of enemy units through those areas is typically not shown unless under the observation of a player's own units."
        ],
        "examples": [
            "The \"Civilization\" series of computer games lets the players start with just the areas around his or her starting units explored. The choice between whether to put resources into improving ones cities or exploring the environment, make up a large portion of success or failure in the game.",
            "\"Metroid Fusion\" reveals most of the layout of each level and even explicitly indicates the places the player has already visited. The game further indicates the location of the power-ups on the overview map, but not the exact location on the play area. This leads to the player, sometimes frantically, trying to find the exact location of the power-up in the specified area."
        ],
        "usage": [
            "Two main design choices exist for [Fog of War](fogof-war): is the [Fog of War](fogof-war) shared by all players and does the [Fog of War](fogof-war) return after players have explored an area? The second design choice can be modulated further by differentiating between a [Fog of War](fogof-war) that hides the [Game World](game-world) and a [Fog of War](fogof-war) that does not hide the [Game World](game-world) but does hide game elements in it. Regardless, when the [Fog of War](fogof-war) returns to an explored area it promotes [Memorizing](memorizing) the contents of the areas.",
            "[Fog of War](fogof-war) relies on the movement and observation ranges of [Avatars](avatars) or [Units](units) to explore unknown areas. This provides the game designer with opportunities to provide different levels of proficiency for different [Units](units), giving them [Privileged Abilities](privileged-abilities) or [Asymmetric Abilities](asymmetric-abilities) and creating [Orthogonal Unit Differentiation](orthogonal-unit-differentiation). For example, in the real-time strategy game \"WarCraft II\" players can choose to build very strong attack units which have limited capabilities for gaining information about the enemy units they encounter. This is an example of applying the \"Trade-Offs\" pattern between making [Gain Information](gain-information) or [Eliminate](eliminate) goals easier, although the actual balance is not easy to judge. One way of creating [Fog of War](fogof-war) is to use [Tile-Laying](tile-laying) and having the [Tiles](tiles) upside down until they have been explored. However, this makes the [Fog of War](fogof-war) common to all players.",
            "Games with [Game State Overview](game-state-overview) typically apply the use of [Fog of War](fogof-war) at the same level as for the game world. The most common exception can be found in games using [Third-Person View](third-person-views). Such games may let players have full view of the area currently visited, in essence having no [Fog of War](fogof-war) in the [Game World](game-world) view but having one in the [Game State Overview](game-state-overview) which is updated as different parts of the [Game World](game-world) are explored."
        ],
        "consequences": [
            "[Fog of War](fogof-war) modulates players' perception of [Game Worlds](game-world) and may be a physical property of the worlds. [Fog of War](fogof-war) provides means of giving [Imperfect Information](imperfect-information) in games with [Third-Person Views](third-person-views) or [God Views](god-views) that come automatically in games with [First-Person Views](first-person-views), and may for [Third-Person Views](third-person-views) and [God Views](god-views) be modulated by how [Cameras](cameras) can be moved or adjusted. Some type of [Fog of War](fogof-war) is a requirement for a game if the game is to have [Secret Resources](secret-resources) or [Asymmetric Information](asymmetric-information). Since knowing the terrain of the [Game World](game-world) allows tactical knowledge, the presence of [Fog of War](fogof-war) naturally creates [Gain Information](gain-information) and, more specifically, [Exploration](exploration) goals.",
            "Since [Fog of War](fogof-war) typically does not update current activities in explored areas, the use of the pattern encourages already explored areas to be visited, either on [Guard](guard) missions for [Strategic Locations](strategic-locations) or on [Reconnaissance](reconnaissance) assignments to locate enemy [Units](units), which can be used as [Red Herrings](red-herrings) by the game system or by the players themselves."
        ]
    },
    "relations": {
        "instantiates": [
            "gain-information",
            "reconnaissance",
            "red-herrings",
            "memorizing"
        ],
        "modulates": [
            "god-views",
            "exploration",
            "imperfect-information",
            "guard",
            "game-state-overview",
            "game-world",
            "cameras"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "asymmetric-abilities",
            "privileged-abilities",
            "orthogonal-unit-differentiation"
        ],
        "conflicts": []
    }
}