{
    "name": "Gain Competence",
    "texts": {
        "definition": "Gaining the ability to perform a certain action within the game.",
        "description": [
            "This is the goal to gain the ability to perform a certain action, either by enabling a game element to perform that action or by gaining control of a game element that can perform that action. Typical examples of games using [Gain Competence](gain-competence) goals are roleplaying games where the players' characters gain skills and real-time strategy games with research.",
            "[Gain Competence](gain-competence) is not the ability for a player to perform an action skillfully, see the patterns regarding [Game Mastery](game-mastery) and fields of expertise for individual discussions of these player actions."
        ],
        "examples": [
            "\"Quake\" and \"Unreal Tournament\" have [Gain Competences](gain-competence) goals that are linked to acquiring weapons, since the different weapons have radically different abilities.",
            "Computer-based roleplaying games, such as \"Neverwinter Nights\" and \"Morrowind\", have many abilities, most commonly spells, that are not available to the players. Learning these abilities provides significant help in completing the games, and gaining them may become explicit goals that are the focus of player actions on the expense of the main goal."
        ],
        "usage": [
            "The [Gain Competence](gain-competence) goal can be achieved by completing other goals, typically [Gain Ownership](gain-ownership) or [Overcome](overcome), but can also be the result of [Investment](investments) or gaining [Resources](resources).",
            "The [Rewards](rewards) from [Gain Competence](gain-competence) are commonly to give players advantages by providing [Privileged Abilities](privileged-abilities) or [Improved Abilities](improved-abilities) (often through [Skills](skills)) that allow for alternative tactics or make the fulfillment of goals easier. If the [Gain Competence](gain-competence) goal is a [Symmetric Goal](symmetric-goals) so other players also can gain the same competence, this can provide a [Race](race) or a [Red Queen Dilemma](red-queen-dilemmas).",
            "The actions made possible by a [Gain Competence](gain-competence) goal can either be associated directly with the player or with a game element. In the latter case, this can either be modeled as skills of [Avatar](avatars) s or [Units](units) that usually cannot be lost except by elimination of the game element itself, or as actions made possible by [Tools](tools) or [Pick-Ups](pick-ups) that can be lost, traded, or disappear after a certain number of uses due to [Limited Resources](limited-resources). Similarly, [Power-Ups](power-ups) and [Chargers](chargers) can be used to give an [Avatar](avatars) or [Unit](units) a new form of action for a set [Time Limit](time-limits) or numbers of uses."
        ],
        "consequences": [
            "[Gain Competence](gain-competence) goals give players offers of [Empowerment](empowerment) and can be motivated by [Limited Set of Actions](limited-setof-actions) or [Asymmetric Abilities](asymmetric-abilities) where the players feel disadvantaged. They are thus common effects of [Planned Character Development](planned-character-development).",
            "[Gain Competence](gain-competence) goals can often be described as receiving a [New Ability](new-abilities) or [Improved Ability](improved-abilities) event as a [Reward](rewards). However, this may only be from the perspective of the current game state: regaining abilities to counter [Ability Losses](ability-losses) is also a [Gain Competence](gain-competence) goal and probably has stronger [Emotional Immersion](emotional-immersion).",
            "[Gain Competence](gain-competence) can be used to provide players with [Smooth Learning Curves](smooth-learning-curves), as players do not have to consider all possible actions in the game in early states of the game and allows for [Varied Gameplay](varied-gameplay) within a game since new possibilities open up later in the game. Further, it can be used to ensure the [Narrative Structure](narrative-structures) and open up new areas in the game. [Gain Competence](gain-competence) is also one way to provide [Character Development](character-development)."
        ]
    },
    "relations": {
        "instantiates": [
            "character-development",
            "race"
        ],
        "modulates": [],
        "instantiated_by": [
            "tools",
            "chargers",
            "new-abilities",
            "improved-abilities",
            "privileged-abilities",
            "ability-losses",
            "asymmetric-abilities",
            "skills",
            "planned-character-development",
            "gain-ownership"
        ],
        "modulated_by": [
            "empowerment",
            "limited-setof-actions"
        ],
        "conflicts": []
    }
}