{
    "name": "Gain Information",
    "texts": {
        "definition": "The goal of performing actions in the game in order to be able to receive information or make deductions.",
        "description": [
            "The \"Gain Information\" goal is simply the task of gaining more knowledge about something in the game. This can be discovering where a certain game element is in the game space, knowing what values game elements have, what abilities other players have access to, or what goals exist. The completion of the goal can either be verified by a game state change that does not require the player to actually understand the information or by requiring the player to perform some activity or complete a goal that indicates that the information has been interpreted by the player. In the first case, this can be by the player gaining an object, e. g., picking up a book, or choosing an action that presents the information to the player, e. g., looking at a sign. In the second case, this can be by observing that the player has done an action that was unlikely to have been performed otherwise, e. g., selecting the right five-digit combination to a safe."
        ],
        "examples": [
            "\"Gain Information\" is the typical goal used in mystery games to drive the unfolding of the story, e. g., the \"Gabriel Knight\" series.",
            "\"Hide &amp; Seek\", the traditional children's game, is the archetypical example of direct use of this pattern. In the game, one of the players is the seeker whose task is to find out the other players who have had a certain amount of time to hide themselves."
        ],
        "usage": [
            "The prerequisite for using \"Gain Information\" is that there is \"Imperfect Information\" in the game, or that there is \"Uncertainty of Information\" about the information that is known. \"Hide &amp; Seek\", for example, does not work properly in a small empty room with three people. Another example, creating \"Imperfect Information\" through the use of \"Asymmetric Information\" can be found in card games using \"Card Hands\". Games with \"Fog of War\" often have \"Exploration\" and \"Reconnaissance\" as dynamic \"Gain Information\" goals during the game.",
            "The \"Reward\" for completing a \"Gain Information\" goal can either be in the form of \"Direct Information\" or \"Indirect Information\", and both of these often counter \"Limited Foresight\" players have. The former can be encoded in the game state or be given to the players, but in either case, refer explicitly to the game state, but may ruin \"Emotional Immersion\" when given to players. Both forms of information can support \"Stimulated Planning\" when given to players, but \"Indirect Information\" can require more due to the translation required. Similarly, \"Indirect Information\" can more easily spawn new \"Gain Information\" goals to check the correctness of information when there is \"Uncertainty of Information\".",
            "The search for \"Secret Resources\" or other game elements related to \"Gain Information\" goals require that the player has at least a rudimentary idea of what is being sought and can include the knowledge in which part of the \"Game World\" the game element can be found. Limiting the search space can be done by limiting the actual space the player can explore, e. g., through the use of \"Level\", or by informing the player about the general whereabouts of the information but not limiting the players activities to that space, e. g., through a \"Helper\". In the latter case, gaining that information can be a \"Gain Information\" goal in itself.",
            "\"Gain Information\" goals occur naturally in games with \"Committed Goals\" that are also \"Unknown Goals\" to the other players. In this case, the other players gain an advantage by revealing the \"Committed Goal\", and typically game strategies involve figuring out the other players' goals.",
            "Many \"Gain Information\" goals are \"Supporting Goals\" to other goals; examples of these types of \"Gain Information\" goals include finding enemies \"Achilles' Heels\", locating \"Strategic Locations\", and finding \"Clues\". The completion of these goals thereby promotes players to do \"Memorizing\" of the information revealed by solving them."
        ],
        "consequences": [
            "\"Gain Information\" goals can easily be included as both \"Optional Goals\" and \"Supporting Goals\" to make other goals easier, especially \"Puzzle Solving\" but also for other types of goals, e. g., discovering the \"Achilles' Heel\" of a \"Boss Monster\" to more easily \"Eliminate\" him. \"Narrative Structures\" can in contrast have \"Gain Information\" goals that are \"Committed Goals\" in order to ensure that the player experiences the narrative in the intended way. The use of \"Gain Information\" creates a \"Preventing Goal\" when what is sought is something that another player has the goal to \"Conceal\".",
            "If the information that is sought is represented by physical game elements, i. e., \"Clues\", the completion of the goal can be followed by or combined with a \"Gain Ownership\" goal. If the amount of required gameplay between the completion of a \"Gain Information\" goal and a \"Gain Ownership\" goal of a game element is large, the \"Gain Information\" goal can be seen as a \"Supporting Goal\". When the player has all the physical game elements, the completion of the goal can be traditional \"Puzzle Solving\" or found by \"Experimenting\".",
            "If the player has information about what information is being sought, the \"Gain Information\" goal can promote \"Stimulated Planning\", especially if the goal is an \"Optional Goal\" or part of a \"Collection\", and can support a \"Narrative Structure\"."
        ]
    },
    "relations": {
        "instantiates": [
            "experimenting",
            "puzzle-solving",
            "supporting-goals",
            "memorizing",
            "uncertainty-of-information"
        ],
        "modulates": [],
        "instantiated_by": [
            "limited-foresight",
            "achilles-heels",
            "fog-of-war",
            "unknown-goals",
            "strategic-locations",
            "exploration",
            "card-hands",
            "reconnaissance",
            "committed-goals",
            "secret-resources",
            "imperfect-information",
            "asymmetric-information",
            "puzzle-solving",
            "gain-ownership"
        ],
        "modulated_by": [
            "indirect-information",
            "perfect-information"
        ],
        "conflicts": [
            "perfect-information"
        ]
    }
}