{
    "name": "Hierarchy of Goals",
    "texts": {
        "definition": "The goals and subgoals of the game form a hierarchy.",
        "description": [
            "The goals of many games are structured hierarchically, either explicitly using the components of the game or implicitly by having perceivable closures whose fulfillment can easily be seen to promote the main goal of the game. Single rounds of \"Heads and Tails\" or \"Paper-Rock-Scissor\" (without external \"Rewards\" or \"Penalties\") do not have a\"Hierarchy of Goals\" but otherwise this pattern is present in virtually every game.",
            "In games with \"Hierarchies of Goals\", players have to complete at least some of the low-level subgoals in order to proceed. This can be used to increase the value of closures in a game; the closure of a goal has a greater value if the fulfillment is seen as being part of completing a larger goal.",
            "The topology of the hierarchy of goals can vary from a simple linear sequence or a tree to a complex network. The player does not necessarily have full knowledge of the hierarchy at the beginning of the game, but it is usually revealed stage by stage as the gameplay progresses. This gradual revealing of the goal hierarchies is often used in adventure and roleplaying games where the player is given new tasks or quests after completion of the previous one, revealing the total goal hierarchy one goal at the time. One version of this is when the player first knows only the overarching goal (defeat the evil overlord for example) at the beginning and the subgoals are presented to the player one at a time as the player progresses in the \"Hierarchy of Goals\"."
        ],
        "examples": [
            "A good example of a \"Hierarchy of Goals\" can be found in \"Zelda: A Link to the Past\". At the start, Link is given the task of rescuing princess Zelda from the castle. After accomplishing this, Link is presented with a more elaborate quest of overcoming the evil wizard Agahnim. The subgoals of this task, such as freeing the seven maidens, are gradually revealed to the player during the gameplay and, near the end of the game, it is revealed that it is not Agahnim, but Ganon from the Dark World, that Link has to overcome.",
            "\"Chess\" can be seen as a loosely defined implicit \"Hierarchy of Goals\". No pieces need to be captured from the opponent, nor any strategic locations occupied, to be able to checkmate the opponent's king. However, it does make the goal of checkmating easier, and nearly all players focus on achieving these subgoals before attempting to achieve the main goal.",
            "The rough goal hierarchy in \"Pac-Man\" is as follows: eat the pills while avoiding the ghosts, get the power pill while avoiding the ghosts, chase the ghosts or eat the pills while under the influence of the power-pill, finish levels by taking all pills on each level, and finally get into the high score list."
        ],
        "usage": [
            "The hierarchy can be established in different ways. The simplest one is a hierarchy of \"Collection\" where each low-level goal needs to be achieved by \"Collecting\" actions before the high-level goal can be completed, e. g., in \"Pac-Man\" where all pills must to be eaten to progress to the next level, but the completion of as many levels as possible is still the main goal. Also, the simplest method of completing the \"Collection\" is to force a rigid linear sequence as is the case in almost all single-player modes of shoot-'em-ups.",
            "When constructing a \"Hierarchy of Goals\", the game designer has to choose which goals need and do not need to be completed. Requiring a complete \"Collection\" at each level of the hierarchy ensures longer playing time but can also limit players' \"Freedom of Choice\", especially if the collections are not \"Selectable Sets of Goals\". Making parts of the hierarchy consist of \"Optional Goals\" avoids this problem, and may allow \"Replayability\" if players have strived towards the quickest way towards completing the game.",
            "Providing a static \"Hierarchy of Goals\" lets the players build \"Strategic Knowledge\" about the game but if this is not desirable \"Ephemeral Goals\" can be used, which may also increase \"Replayability\". \"Hierarchies of Goals\" consisting of \"Excluding Goals\", \"Unknown Goals\", and \"Dynamic Goal Characteristics\" where the goals are revealed and when instantiated gradually can be used to combine static forms of the hierarchy with changing goals, and are especially common in adventure and roleplaying games. \"Renewable Resources\" can be used to modulate these hierarchies, either to constantly provide \"Resources\" to ease the completion of goals or to generate \"Enemies\" to create new challenges. Dynamic forms of goal hierarchies typically emerge in complex strategy games where the player has the possibility to spread out resources and focus on several different, but interdependent goals, including the progression in the technology tree, conquering new areas, building new units, and defending production points.",
            "Deep or wide \"Hierarchies of Goals\" are difficult to achieve in \"Quick Games\" as it can be difficult for players to have enough time to complete all the goals in the game."
        ],
        "consequences": [
            "Having \"Hierarchy of Goals\" in a game provides a structure for the game that can be used for several purposes: to ensure that certain activities in the game are done; to ensure that a \"Narrative Structure\" is maintained; or to provide players with a clear direction of the gameplay that can support \"Strategic Knowledge\". Further, \"Hierarchy of Goals\" enables \"Meta Games\" such as \"Tournament\" by expanding the goals beyond a game instance by using \"Extra-Game Consequences\".",
            "The use of a \"Hierarchy of Goals\" makes the presence of \"Higher-Level Closures as Gameplay Progresses\" automatic and can be used to pace the \"Tension\" in a \"Narrative Structure\". The clear separation of required gameplay in different goals provides natural \"Save Points\" after the completion of each goal in the hierarchy."
        ]
    },
    "relations": {
        "instantiates": [
            "narrative-structures",
            "higher-level-closures-as-gameplay-progresses",
            "strategic-knowledge"
        ],
        "modulates": [
            "save-points"
        ],
        "instantiated_by": [
            "continuous-goals",
            "predefined-goals",
            "optional-goals",
            "tournaments",
            "collecting",
            "renewable-resources"
        ],
        "modulated_by": [
            "dynamic-goal-characteristics",
            "unknown-goals",
            "supporting-goals",
            "selectable-sets-of-goals",
            "excluding-goals",
            "ephemeral-goals"
        ],
        "conflicts": [
            "quick-games"
        ]
    }
}