{
    "name": "Illusionary Rewards",
    "texts": {
        "definition": "The player receives something that is perceived as a reward but does not quantifiably help in completing a formalized goal in the game as expressed by the game state.",
        "description": [
            "Some [Rewards](rewards) gained in games do not actually provide players with any substantial gameplay advantages, but when they still are perceived by the players as a reward, these types of [Rewards](rewards) can be called [Illusionary Rewards](illusionary-rewards). Examples include becoming invincible to a type of monster that doesn't exist, getting mines in a racing game when one is last and no one will pass that part of the track again, and finding game objects that cannot be used for anything in the game except for carrying around."
        ],
        "examples": [
            "All effect of character actions in \"The Sims\" can be [Illusionary Rewards](illusionary-rewards), since there is no formalized goal in the game. However, these [Rewards](rewards) are the very essence of gameplay: players have either set their own goals based on the [Rewards](rewards) or the [Rewards](rewards) provide entertainment when they occur unplanned.",
            "Some games allow players to unlock new outfits for the [Avatars](avatars) they control. This does not change the gameplay itself but is still perceived as a [Reward](rewards) since it offers some novelty and can be shown to other people.",
            "Collecting all stars in \"Super Mario Sunshine\" is not required to complete the game but doing so, even after completing the goal of the game, can give players satisfaction and be used to compare one's skill and dedication to the game with other players."
        ],
        "usage": [
            "[Illusionary Rewards](illusionary-rewards) can either be intentionally created or be the effect of games where not all actions are tightly linked to the completion of a goal.",
            "Intentionally created [Illusionary Rewards](illusionary-rewards) can be misguiding, e. g., [Red Herring](red-herrings) to complicate a goal or [Narrative Structure](narrative-structures), or provide extra game [Rewards](rewards), for example visual effects such as gaining new outfits or being shown additional [Cut Scenes](cut-scenes) or other forms of [Extra-Game Information](extra-game-information). One form of [Illusionary Reward](illusionary-rewards) is to continue providing players with [Rewards](rewards) that normally affect an evaluation function but that evaluation has already been decided or cannot be affected enough to change the outcome.",
            "The most common form of [Illusionary Rewards](illusionary-rewards) is providing feedback to players that [Extended Actions](extended-actions), such as [Rhythm-Based Actions](rhythm-based-actions) or [Combos](combos), are being properly executed, and in this form, [Illusionary Rewards](illusionary-rewards) function as [Progress Indicators](progress-indicators) but within a [Consistent Reality Logic](consistent-reality-logic). Intentionally created [Illusionary Rewards](illusionary-rewards) can also be used to help players complete their goals without affecting the game state. Reaching [Helpers](helpers), [Traces](traces), and [Clues](clues) that do not affect the game state are forms of [Illusionary Rewards](illusionary-rewards), as they do not explicitly increase the chance of succeeding but can still be [Balancing Effects](balancing-effects). Rather, they work as a form of [Progress Indicator](progress-indicators) for players as they can be used to have one measure of how close players are to completing goals. Another way [Illusionary Rewards](illusionary-rewards) can support players is to provide feedback in [Real-Time Games](real-time-games) that the player has succeeded in an action, e. g., providing feedback that a [Combo](combos) has been performed correctly in a fighting game even though it missed the enemy. These forms of [Illusionary Rewards](illusionary-rewards) give players [Perceivable Margins](perceivable-margins) and allow players to learn [Predictable Consequences](predictable-consequences) of their actions by [Experimenting](experimenting), and thereby achieve [Game Mastery](game-mastery).",
            "Games that require a large number of actions to be performed before completing a goal and provide no explicit subgoals in between easily create [Illusionary Rewards](illusionary-rewards). In these cases, players often create [Player Defined Goals](player-defined-goals) in order to divide the main goal into smaller pieces, for example, finding a high place---an [Outstanding Feature](outstanding-features) in the [Game World](game-world) ---in order to gain an overview of one's surroundings so that one can position oneself in relation to where one wants to go. If players have [Unknown Goals](unknown-goals), the chances of players using [Player Defined Goals](player-defined-goals) to create [Illusionary Rewards](illusionary-rewards) increase, as they are likely to perform [Experimenting](experimenting) of how they can use actions or [Exploration](exploration) of the [Game World](game-world). Avoiding these forms of [Illusionary Rewards](illusionary-rewards), e. g., to couple the gameplay closely with the [Narrative Structure](narrative-structures), can be done by inserting explicit subgoals or by using [Helpers](helpers), [Traces](traces), and [Clues](clues) that affect the game state (and can be subgoals in themselves)."
        ],
        "consequences": [
            "The presence of [Illusionary Rewards](illusionary-rewards) increases the number of closures in the game. Further, [Illusionary Rewards](illusionary-rewards) can be extra game rewards as they may be shown to other people as indications of [Game Mastery](game-mastery) and thereby become social rewards.",
            "[Illusionary Rewards](illusionary-rewards) that the players are aware of, independently if they know that the [Reward](rewards) is an illusion or not, work as potential [Player Defined Goals](player-defined-goals). This allows for [Stimulated Planning](stimulated-planning) as well as provides goals in game that otherwise would not have any. When used by players as goals, [Illusionary Rewards](illusionary-rewards) give players a [Perceived Chance to Succeed](perceived-chanceto-succeed).",
            "[Illusionary Rewards](illusionary-rewards) can occur in [Tournaments](tournaments) where one meets several opponents in each round. When the outcome of other previous games make the outcome of the round given, the winning or losing of a game can become pointless from the perspective of winning the [Tournament](tournaments)."
        ]
    },
    "relations": {
        "instantiates": [
            "social-statuses",
            "predictable-consequences",
            "perceivable-margins",
            "exploration",
            "experimenting",
            "player-defined-goals",
            "progress-indicators",
            "narrative-structures",
            "balancing-effects",
            "perceived-chanceto-succeed"
        ],
        "modulates": [
            "extended-actions",
            "combos",
            "game-mastery"
        ],
        "instantiated_by": [
            "tournaments",
            "helpers",
            "traces",
            "clues",
            "outstanding-features"
        ],
        "modulated_by": [],
        "conflicts": []
    }
}