{
    "name": "Imperfect Information",
    "texts": {
        "definition": "One aspect of information about the total game situation is not fully known to a player, either the information known is totally wrong or the accuracy of the information is limited.",
        "description": [
            "There are several ways of withholding knowledge about the current or previous states of the game from a player . The player may have access only to a limited set of attributes of the game components or the player may not even know about the existence of certain components or their attributes. In multiplayer games, the players can very rarely be completely convinced that they have [Perfect Information](perfect-information) about the strategies and goals of the other players.",
            "Games of chance are not necessarily games using [Imperfect Information](imperfect-information), as players can, as in \"Yahtzee\", have [Perfect Information](perfect-information) about what has occurred previously in the game."
        ],
        "examples": [
            "Games of exploration and discovery, such as many adventure and role-playing games, use [Imperfect Information](imperfect-information) to gradually reveal the world and the story to the players.",
            "The removal of [Imperfect Information](imperfect-information) can be system controlled, such as when players reveal their cards at the end of a \"Poker\" round to settle who has the winning hand.",
            "\"Doom\" provides statistics of how many secrets exist on a level after the players have completed it. It does not, however, reveal their location, meaning the players can replay the level simply to try to find all the secrets.",
            "Both \"Zendo\", a matching game, and \"Eleusis\", a card game, have rules that are decided by an umpire before gameplay begins, and winning the game consists mainly of being able to guess the rules."
        ],
        "usage": [
            "Obviously, the designer has to choose what parts of the game state will not to be revealed to the players when using [Imperfect Information](imperfect-information). The dynamics of [Imperfect Information](imperfect-information) are another aspect to consider. How can the missing information be revealed to the player? What are the incentives for the player to gain the missing information? Is the information embedded in game elements under players' control (such as [Cards](cards)) or provided by, for example, [Book-Keeping Tokens](book-keeping-tokens) or [Dedicated Game Facilitators](dedicated-game-facilitators)? How much does the use of [Imperfect Information](imperfect-information) rely on players [Memorizing](memorizing)? If all players do not have the same level of information available to them, [Imperfect Information](imperfect-information) gives rise to [Asymmetric Information](asymmetric-information). This can also be achieved by not revealing the information to the players simultaneously, so that some players have more information available to them than others, at least for a certain time.",
            "There are two main ways in which players can have [Imperfect Information](imperfect-information): either they lack information or they have faulty information. Lack of information is typically combined with access to information on a higher level; players may not know what [Units](units) are used by the other players, but they know what kinds of [Units](units) exist in a strategy game , for example, they know what [Cards](cards) exist in a deck of cards, but they may not know the exact [Cards](cards) the other players have. These two examples are also typical uses of [Secret Resources](secret-resources). Faulty information means that a player has received information that is not correct, either due to intentional actions by the other players or [Indirect Information](indirect-information) that has caused misinterpretation. [Uncertainty of Information](uncertaintyof-information) can be used to modulate both instances, in the first case by providing partial information on the basic or the higher level, and in the second case by providing [Clues](clues) that the information may not be correct.",
            "The use of faulty information is primarily to set up [Red Herrings](red-herrings), provide system support for player [Bluffing](bluffing), or to allow the system to fake [Near Miss Indicators](near-miss-indicators). By contrast, lack of information is used primarily to set up [Gain Information](gain-information) goals. Games with a strong presence of [Exploration](exploration) are good examples of this kind of use of [Imperfect Information](imperfect-information), often using [Tile-Laying](tile-laying) or combining [Fog of War](fogof-war) with [Game State Overview](game-state-overview). The latter pattern is in itself an instance of [Imperfect Information](imperfect-information), since it is not a complete view of the game state but an overview, and in some cases, only updated information about the environment in which the players' [Focus Loci](focus-loci) can be found.",
            "The use of [Imperfect Information](imperfect-information) usually assumes that the missing information is revealed to the player at some point, but this does not necessarily have to be the case. Games with systemized information control---especially computer games---can leave parts of the information concealed for the duration of the game. There are two main reasons not to clarify the [Imperfect Information](imperfect-information) even after the game has been played. The first reason, typically linked with [Optional Goals](optional-goals), is that players can replay the game, or part of the game, to complete the goals overlooked in the earlier game sessions. This can lead to some amount of [Replayability](replayability), as players have an incentive to find out the missing information, but it can also end up in player frustration. This form of [Imperfect Information](imperfect-information) also allows for [Trans-Game Information](trans-game-information) to be shared between players and between game instances. The second reason may be to avoid revealing secret tacticsor building up [Strategic Knowledge](strategic-knowledge), for example in [Tournaments](tournaments) where the information from one game instance can be used in later game instances.",
            "[Imperfect Information](imperfect-information) is often applied to game elements, to support [Gain Information](gain-information) or [Gain Ownership](gain-ownership) goals, and to goals in general, to support [Unknown Goals](unknown-goals). A goal can easily be made into a [Hierarchy of Goals](hierarchyof-goals) by providing [Imperfect Information](imperfect-information) about it and using [Gain Information](gain-information) as a subgoal to the main goal, for example, having a [Configuration](configuration) as the main goal but not providing full information about what game elements are to be part of the [Configuration](configuration). A further use of the application of the pattern to goals in this sense is to hide parts of the [Narrative Structure](narrative-structures) of the game. Games with [Dedicated Game Facilitators](dedicated-game-facilitators) can have [Imperfect Information](imperfect-information) about rules and actions, which can later be revealed as [Rewards](rewards) or reached by [Experimenting](experimenting). Having rules with [Imperfect Information](imperfect-information) without [Dedicated Game Facilitators](dedicated-game-facilitators), as for example in some forms of roleplaying games and children's games, may allow [Creative Control](creative-control) but can easily ruin [Immersion](immersion) due to rule arguments.",
            "A simple case of a lower level of accuracy of information is the use of overview maps, a form of [Game State Overviews](game-state-overview), in games of spatial nature. The overview map is a diagram of the whole game area concealing the details of the spatial arrangement and illuminating certain higher level aspects of that area. It can, of course, be said that the map itself is a more accurate description of the significant features of the area, such as the room configuration in an adventure game, but the point is that these are on a different representation level, concerned with different aspects of the spatial configuration and thereby providing different levels of accuracy.",
            "In some games, players have control over how to create [Imperfect Information](imperfect-information). This is common in games where one player is trying to spread disinformation to the other players, typically by [Bluffing](bluffing). However, games that present large amounts of information to players, e. g., reconfigurable forms of [Game State Overview,](game-state-overview) can let the players modify these presentations with [Imperfect Information](imperfect-information) to avoid [Analysis Paralysis](analysis-paralysis) from information overload."
        ],
        "consequences": [
            "[Imperfect Information](imperfect-information) and [Uncertainty of Information](uncertaintyof-information) are tightly connected, and the presence of one usually indicates the presence of another. While [Uncertainty of Information](uncertaintyof-information) deals with transfer of information, [Imperfect Information](imperfect-information) deals with the information the players possess and how they can use that information. Depending on the discourse and what is considered information transfer, [Uncertainty of Information](uncertaintyof-information) can be achieved through [Imperfect Information](imperfect-information). An explicit example of this is when game elements are used to transfer information between a few players, and the other players have [Imperfect Information](imperfect-information) about which game elements are actually transferred.",
            "[Imperfect Information](imperfect-information) is often the basis for [Gain Information](gain-information) goals since these goals can be easily defined as finding or confirming information about specific game elements. The completion of these goals can then be used to help [Predictable Consequences](predictable-consequences) for the players in the game, to give players [Strategic Knowledge](strategic-knowledge), to describe how a [Configuration](configuration) should be achieved, or to unfold the [Narrative Structure](narrative-structures). In the last case, [Imperfect Information](imperfect-information) also offers the possibility for having [Surprises](surprises). However, for the [Gain Information](gain-information) goal to be present, players must at least have the knowledge that they have [Imperfect Information](imperfect-information) about something. For example, to have the goal of finding the princess, the players must first know that there is a princess and that players do not currently know where the princess is.",
            "The dynamics of [Imperfect Information](imperfect-information) are a natural part of creating different kinds of [Anticipation](anticipation). [Imperfect Information](imperfect-information) has an effect on the capability of the players to analyze the situation in order to determine their next actions. This kind of [Limited Foresight](limited-foresight) gives [Limited Planning Ability](limited-planning-ability) regarding either the level of detail or the length of the planning and may lead to Risk/Reward situations where the players can or have to resort to [Leaps of Faiths](leapsof-faith). In cases where [Imperfect Information](imperfect-information) is about the other players' game elements, it may be difficult for these players to succeed with [Interferable Goals](interferable-goals) or even to be in [Conflict](conflict) with each other. However, [Imperfect Information](imperfect-information) about neutral or other players' game elements can be necessary for certain actions---for example, [Betting](betting) ---and can prolong the players' opinion that they have a [Perceived Chance to Succeed](perceived-chanceto-succeed). [Imperfect Information](imperfect-information) about players' abilities and [Resources](resources) can also heavily influence how players perceive and act in [Combat](combat) or [Player-Decided Distribution of Rewards & Penalties.](player-decided-distributionof-rewards-penalties)",
            "Depending on the nature of the information, [Imperfect Information](imperfect-information) can have either negative or positive effects on [Analysis Paralysis](analysis-paralysis). An example where [Imperfect Information](imperfect-information) can cause [Analysis Paralysis](analysis-paralysis) can be found in \"Stratego\" and trick-taking card games. In these cases, the players can try to deduce the missing information from the available information while forcing other players to have [Downtime](downtime). An example where [Imperfect Information](imperfect-information) is used to avoid [Analysis Paralysis](analysis-paralysis) can be found in some real-time strategy games. The locations of the enemy bases are hidden from the players at the beginning of the game, letting the players focus upon building their own bases and exploring the nearby environment.",
            "Games relying on [Imperfect Information](imperfect-information) require that the information must change between game instances for the game to have [Replayability](replayability) (or that players can succeed in different ways that can be quantifiably compared to each other). By using [Dynamic Goal Characteristics](dynamic-goal-characteristics), the overall structure can be maintained between game instances, including having [Predefined Goals](predefined-goals), while the exact configuration can be [Imperfect Information](imperfect-information) to the players. This can be done using [Randomness](randomness), but in games with [Dedicated Game Facilitators](dedicated-game-facilitators), these can also modify the information. However, [Imperfect Information](imperfect-information) that does not change between game instances in [Single-Player Games](single-player-games) can be a source of [Social Interaction](social-interaction), as players can compare notes between their different gameplay experiences."
        ]
    },
    "relations": {
        "instantiates": [
            "surprises",
            "indirect-information",
            "limited-foresight",
            "leapsof-faith",
            "exploration",
            "red-herrings",
            "unknown-goals",
            "experimenting",
            "gain-information",
            "conceal",
            "risk-reward",
            "uncertaintyof-information",
            "secret-resources"
        ],
        "modulates": [
            "predictable-consequences",
            "near-miss-indicators",
            "anticipation",
            "configuration",
            "replayability",
            "perceived-chanceto-succeed",
            "narrative-structures",
            "memorizing",
            "betting",
            "predefined-goals",
            "limited-planning-ability"
        ],
        "instantiated_by": [
            "combat",
            "cards",
            "dedicated-game-facilitators",
            "randomness",
            "dynamic-goal-characteristics"
        ],
        "modulated_by": [
            "fogof-war",
            "clues"
        ],
        "conflicts": [
            "conflict",
            "direct-information",
            "interferable-goals"
        ]
    }
}