{
    "name": "Incompatible Goals",
    "texts": {
        "definition": "Two or more goals that cannot be fulfilled simultaneously due to having end conditions that are mutually exclusive",
        "description": [
            "Making goals for a game in such a way that they cannot simultaneously be fulfilled is an easy and common way to create competition or complexity in games. They also help synchronize the tempo of players' experiences, because if players are near completing a goal it is not only likely to excite them but also those players with [Incompatible Goals](incompatible-goals), albeit for other reasons. However, a set of [Incompatible Goals](incompatible-goals) do not have to be divided between different players, one player can have several goals that are incompatible with each other, and gameplay can focus upon selecting which of the goals to pursuit."
        ],
        "examples": [
            "In the board game \"Time Agent\", six different species try to manipulate the past so that events promoting their species occur and events bad for them disappear out of history. Most of these events have at least one species wanting them to exist and at least one species that wants to erase them.",
            "\"Tag\", where the goal of the chaser to catch the other players, the chaser's goal of tagging cannot be fulfilled at the same time as other players' goals of not being caught."
        ],
        "usage": [
            "[Incompatible Goals](incompatible-goals) are easy to create by basing them on Boolean expressions; one goal may require a game state condition to be true, while the other may require the same condition to be false, thereby making it impossible to complete both at the same time. Or, they may have one and only one state out of a number of states (a tile may be green, blue, red, or yellow, thus benefiting player A, B, C, or D). Another way to make [Incompatible Goals](incompatible-goals) is to use [Excluding Goals](excluding-goals) or [Preventing Goals](preventing-goals). Note that with [Excluding Goals](excluding-goals), the completion of one goal in a set of [Incompatible Goals](incompatible-goals) does not have to make the others impossible to complete later, just that both goals cannot be fulfilled at the same time. A simple example of this is having two [Traverse](traverse) goals with different [Goal Points](goal-points); both cannot be fulfilled at the same time if the player cannot be in two locations simultaneously, but one can be completed first and the other later. These goals can of course, as can many other [Incompatible Goals](incompatible-goals), be completed simultaneously by [Collaborative Actions](collaborative-actions) if they are not specific to individual players.",
            "The [Incompatible Goals](incompatible-goals) between which the player must choose can be constructed to serve several different purposes. First, they can force the player to make [Tradeoffs](tradeoffs) between the different rewards offered. Second, they can force the player to make decisions between the [Risk/Reward](risk-reward) of the different goals. And, they can be used for [Planned Character Development](planned-character-development) and limit the openness of a [Narrative Structure](narrative-structures)."
        ],
        "consequences": [
            "If different players have [Incompatible Goals](incompatible-goals), it can create [Conflict](conflict) or [Competition](competition), and thus [Tension](tension), and the goals can naturally not be [Mutual Goals](mutual-goals). If players have several [Incompatible Goals](incompatible-goals), the players are required to do [Tradeoffs](tradeoffs) from [Selectable Sets of Goals](selectable-setsof-goals), which can also be used to ensure [Varied Gameplay](varied-gameplay), given that the players can strive for different goals in different game instances. That players can only succeed with one of the [Incompatible Goals](incompatible-goals) at any given time lets them focus their attention on that goal, thereby limiting the need for [Attention Swapping](attention-swapping) between different goals and modulating the [Right Level of Difficulty](right-levelof-difficulty) in a game.",
            "If a game has a player switching between different roles, and these roles have [Incompatible Goals](incompatible-goals) in relation to each other, this can increase the [Right Level of Complexity](right-levelof-complexity) in gameplay as players have to switch between the goals they are striving for when they change role."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "collaborative-actions",
            "competition",
            "varied-gameplay"
        ],
        "modulates": [
            "attention-swapping",
            "planned-character-development",
            "selectable-setsof-goals",
            "narrative-structures"
        ],
        "instantiated_by": [
            "contact",
            "preventing-goals",
            "excluding-goals"
        ],
        "modulated_by": [],
        "conflicts": [
            "mutual-goals"
        ]
    }
}