{
    "name": "Indirect Information",
    "texts": {
        "definition": "Players obtain information about the game situation in an indirect way, usually from other players.",
        "description": [
            "Information transmitted to, or between, players in a game does not have to be in the same format as information stored in the game state. In this case, information can be said to be indirect in that the sender of the information has had to translate it from one format to another before being able to send it. This translation may be intentional by the sender to clarify or obfuscate the meaning to the receiver or other listeners, or may be a requirement of the medium used to communicate. The children's game of \"Telephone\" is the easiest example of a game using [Indirect Information](indirect-information), where the goal of the game is simply to notice the errors that occur when one person is whispering a sentence to another person."
        ],
        "examples": [
            "Bidding in \"Bridge\" can be used, when following certain conventions, to send [Indirect Information](indirect-information) to one's partner about what cards one has. Disregarding the aspects of bluffing, the bidding in \"Poker\" can be seen as a form for players to intentionally use [Indirect Information](indirect-information) to state how good a hand they hold.",
            "\"Poker\" players unintentionally send out signals through their body language when betting. Other players can use this [Indirect Information](indirect-information) to, for example, detect bluffing.",
            "Chats in multiplayer online games allow players to freely communicate about the game state with each other. As natural language is easily misunderstood and players may not know the format the game state is expressed in, the information spread is indirect.",
            "Pre-generated messages to other players in \"Return to Castle Wolfenstein\" are based on templates that are used to express intentions and situations in the game. As the templates are generic they fail to express the exact game state in all but the simplest situations."
        ],
        "usage": [
            "The difference between the format in which the information is stored and the possible ways of expressing the information in the available medium is the prime design choice when supporting [Indirect Information](indirect-information). The two mediums readily available to game designers are body language and natural language. In games with [Game Masters](game-masters), these are unavoidable mediums and especially body language may be used for [Bluffing](bluffing) but may also reveal what the [Game Masters](game-masters) have planned. In other games, natural language or formalized languages have to be supported by [Communication Channels](communication-channels) to ensure that the information is not directly expressed. Other common ways to give [Indirect Information](indirect-information) in games include \"Helpers, Clues\", and [Red Herrings.](red-herrings)",
            "Formalized languages for [Indirect Information](indirect-information) can be designed to either let players choose exactly what to say but due to limitations in choices make the comments generic and thereby indirect, or let the player choose what part of the game state to send information about, but automatically format the message and thereby making it indirect."
        ],
        "consequences": [
            "If there is not a perfect, unambiguous one-to-one mapping between the way the information is stored and how it is transmitted, and vice versa, [Indirect Information](indirect-information) always gives rise to [Uncertainty of Information](uncertaintyof-information) or [Imperfect Information](imperfect-information) and naturally provides at least a small level of [Puzzle Solving](puzzle-solving) to evaluate the contents. When players are the senders of information and do not have to be truthful, this allows for [Bluffing](bluffing) and [Betrayal](betrayal), making [Trading](trading) and other activities based on agreements less predictable.",
            "However, [Indirect Information](indirect-information) allows players to be given information within the [Consistent Reality Logic](consistent-reality-logic) of an [Alternative Reality](alternative-reality). By doing so, it can give information about the game state while supporting the [Narrative Structure](narrative-structures) and maintaining [Emotional Immersion](emotional-immersion).",
            "[Indirect Information](indirect-information) often supports [Social Interaction](social-interaction), especially when the communication is face to face. If the passing of information can be observed by other players but the message not understood, this allows [Secret Alliances](secret-alliances) to communicate."
        ]
    },
    "relations": {
        "instantiates": [
            "uncertaintyof-information",
            "puzzle-solving",
            "bluffing"
        ],
        "modulates": [
            "gain-information",
            "social-interaction",
            "emotional-immersion",
            "narrative-structures",
            "betrayal",
            "trading",
            "secret-alliances"
        ],
        "instantiated_by": [
            "clues",
            "helpers",
            "red-herrings",
            "communication-channels",
            "game-masters",
            "imperfect-information"
        ],
        "modulated_by": [
            "consistent-reality-logic",
            "alternative-reality"
        ],
        "conflicts": [
            "direct-information",
            "perfect-information"
        ]
    }
}