{
    "name": "Individual Penalties",
    "texts": {
        "definition": "The penalty for a failure to meet a requirement in the game is given only to one of the players.",
        "description": [
            "Most penalties in a game, even those with team play, are focused upon a single player. The \"Individual Penalties\" are most often closely related to the actions of the player that receives them. However, secondary effects of the \"Individual Penalties\" can have negative effect on whole teams, for example when players are allowed to participate in the game."
        ],
        "examples": [
            "the player performing badly in a first-person shooter usually loses personal health more rapidly than the other players.",
            "in \"Soccer\" the player committing too many mistakes or violating the rules might be taken out of the play for the rest of the game."
        ],
        "usage": [
            "The natural way to use \"Individual Penalties\" is to give the \"Penalty\" to the player who by his personal actions failed to meet the requirements of the game. For example, the player who fails to evade linked incoming fireball in a roleplaying game will lose hit points. Here the \"Penalty\" is tightly coupled to the individual performance of the players and is usually associated with individual goals for the players. \"Player Elimination\" and \"Downtime\" for specific players are always \"Individual Penalties\" as they are defined in relation to players rather than \"Resources\" or game elements such as \"Units\" or \"Avatars\".",
            "The situation, however, is slightly more complex in the case of \"Mutual Goals\", \"Team Play\", and \"Alliances\". Especially in \"Team Play\" the \"Individual Penalties\" for the players in the team can very easily have an effect on the performance of the whole team. For example, losing one member of the team in a team-based first-person shooter will result in a less efficient team, which can be perceived as a \"Shared Penalty\". A more interesting situation arises when the explicit \"Penalty\" for failing to reach a \"Mutual Goal\" or breaking the rules of the game is given only to the one of the participating players. This can especially happen in cases where there is \"Player-Decided Distribution of Rewards &amp; Penalties\". For example, after losing a match in Soccer the team, or the manager of the team, might decide to use the \"Individual Penalty\" of banning a player from further matches. Even in these cases the \"Individual Penalty\" is usually associated with the individual performance of the player.",
            "\"Single-Player Games\", in order to be games at all, obviously can only have \"Individual Penalties\"."
        ],
        "consequences": [
            "\"Individual Penalties\" directly affect the game state of a player and is therefore not a \"Shared Penalty\". If the \"Individual Penalties\" are tightly coupled with the individual performance, there are \"Predictable Consequences\" for failing, and the player usually feels more responsible for his own actions which might lead to an increased sense of achievement. Further, it makes \"Risk/Reward\" choices focused on the players themselves and \"Social Dilemmas\" can thereby be avoided.",
            "Using \"Individual Penalties\" in \"Team Play\" for individual failures can increase the effort from the players to increase their performance levels. \"Individual Penalties\" for mutual failures, such as failing to reach a \"Mutual Goal\", can create social conflict situations within the participating players. For example, explicitly punishing one of the players in a \"Soccer\" team without clear indication of the individual failures of that player is almost inevitably viewed as unfair."
        ]
    },
    "relations": {
        "instantiates": [
            "penalties"
        ],
        "modulates": [
            "team-play",
            "risk-reward",
            "mutual-goals",
            "alliances"
        ],
        "instantiated_by": [
            "single-player-games",
            "player-elimination",
            "downtime"
        ],
        "modulated_by": [
            "predictable-consequences",
            "shared-penalties",
            "player-decided-distribution-of-rewards-penalties"
        ],
        "conflicts": [
            "shared-penalties",
            "social-dilemmas"
        ]
    }
}