{
    "name": "Interferable Goals",
    "texts": {
        "definition": "The game system or other players can directly influence the player's progress towards the goal.",
        "description": [
            "Many goals of the player can be influenced by other players or the game system. Such goals, defined as [Interferable Goals](interferable-goals), have an end condition or an evaluation function depending on variables in the game state that can be directly affected by others. The pattern is commonly used together with a high-level goal that does not allow the players to have an effect on other players' game elements, in order to create more complex gameplay. Games of direct [Conflict](conflict), such as \"Chess\" and \"Tennis\", always have [Interferable Goals](interferable-goals)."
        ],
        "examples": [
            "\"Backgammon\" has the goal of moving your pieces to your own inner table (to be able to start the larger goal of \"bearing\" them off the board). However, the opponent can interfere with the low-level goals of moving each individual piece to the inner table by \"ousting\" the vulnerable pieces. \"Backgammon\" without ousting is not using [Interferable Goals](interferable-goals) even though the player can block opponent's progress as the player's actions do not have direct effect on the opponent's game state."
        ],
        "usage": [
            "Making a goal interferable consists of choosing in what way the system or other player's actions can affect the game state related to the evaluation function of the outcome. The simplest way is to give other players possible actions that have a direct effect on those attributes that govern the evaluation function of the outcome. The previous example of ousting in \"Backgammon\" is about having a direct effect on the attribute of how near to the completion the pieces are. It is also an example of using [Capture](capture) to make the higher level [Race](race) goal interferable. When using [Interferable Goals](interferable-goals), the players have to know something about the other players' game situation, making excessive use of [Uncertainty of Information](uncertaintyof-information) and [Imperfect Information](imperfect-information) unsuitable and [Symmetric Information](symmetric-information) suitable.",
            "If one wants to promote [Conflict](conflict) by using [Interferable Goals](interferable-goals), the possibility to interfere can be encouraged in the form of a [Preventing Goal](preventing-goals). Common examples of [Interferable Goals](interferable-goals) are [Guard](guard), [Overcome](overcome),[Last Man Standing](last-man-standing),[King of the Hill](kingofthe-hill), and maintaining [Area Control](area-control). Choosing to view the completion of [Interruptible Action](interruptible-actions) as goals allows players to create their own [Interferable Goals](interferable-goals) of interrupting those actions."
        ],
        "consequences": [
            "[Interferable Goals](interferable-goals) allow players to be aggressive towards one another, in essence, letting them decide if they want to have a [Conflict](conflict) or not. This makes the gameplay more complex and varied as the players have to also take into account other players' intentions and possible actions. These characteristics also make [Interferable Goals](interferable-goals) suitable for games with the possibility of [Alliances](alliances) between players.[Symmetric Goals](symmetric-goals) are often also [Interferable Goals](interferable-goals) to offer players a wide range of tactics."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict"
        ],
        "modulates": [
            "alliances",
            "race",
            "symmetric-goals",
            "area-control",
            "symmetric-information"
        ],
        "instantiated_by": [
            "last-man-standing",
            "interruptible-actions",
            "kingofthe-hill",
            "preventing-goals"
        ],
        "modulated_by": [],
        "conflicts": [
            "uncertaintyof-information",
            "imperfect-information"
        ]
    }
}