{
    "name": "Interruptible Actions",
    "texts": {
        "definition": "Actions that can be interrupted before they affect the game state.",
        "description": [
            "Just because players have performed, or started to perform, actions does not mean that they will affect the game state. Games that allow actions to be interrupted before they affect the game state, either partially or fully, have [Interruptible Actions](interruptible-actions)."
        ],
        "examples": [
            "Most fighting games allow players to block opponent's attacks, effectively making the attacks interruptible.",
            "In \"RoboRally\", players choose how their robots should move by deciding a sequence of programming cards. These are the actions the robot will perform, but since other robots' movement may push the robot around, the intended actions are interruptible."
        ],
        "usage": [
            "In [Real-Time Games](real-time-games), [Interruptible Actions](interruptible-actions) are either [Extended Actions](extended-actions) with [Delayed Effects](delayed-effects), so that other actions can be performed before the effect of the [Interruptible Actions](interruptible-actions) takes place, or that the interrupting actions can be started before the [Interruptible Actions](interruptible-actions). In [Turn-Based Games](turn-based-games), special [Turn Taking](turn-taking) sequences may be necessary to describe in rules for how actions can be interrupted, even though these sequences are skipped in many turns.",
            "[Interruptible Actions](interruptible-actions) can be used to modulate [Irreversible Actions](irreversible-actions) so that permanent effects on the game state cannot be initiated by one player without other players having a chance to affect this, thus providing [Balancing Effects](balancing-effects) in games. This is common in fighting games where players can block attacks or interrupt [Combos](combos).",
            "In games with [Negotiation](negotiation), for example [Trading](trading), having the [Negotiation](negotiation) be an [Interruptible Action](interruptible-actions) allows several parts to simultaneously engage in [Negotiation](negotiation) and lets them immediately respond to the proposals of other players.",
            "Being able to interrupt an action can be a [Privileged Ability](privileged-abilities). This is most common in card games but can also be found in situations where judges are used to modulate [Negotiation](negotiation). Depending on the game, it may be allowed to interrupt [Storytelling](storytelling) and this can be used to make the story into a collaborative action."
        ],
        "consequences": [
            "As completing an [Interruptible Action](interruptible-actions) can be a goal in itself, all [Interruptible Actions](interruptible-actions) spawn [Interferable Goals](interferable-goals). In a case where players have multiple [Focus Loci](focus-loci), [Interruptible Actions](interruptible-actions) that are also [Extended Actions](extended-actions) may require players to perform [Risk/Reward](risk-reward) choices on how much [Attention Swapping](attention-swapping) is necessary to ensure completion of the actions."
        ]
    },
    "relations": {
        "instantiates": [
            "attention-swapping",
            "interferable-goals",
            "risk-reward",
            "balancing-effects"
        ],
        "modulates": [
            "extended-actions",
            "trading",
            "storytelling",
            "combos",
            "negotiation",
            "irreversible-actions"
        ],
        "instantiated_by": [
            "turn-taking",
            "privileged-abilities"
        ],
        "modulated_by": [
            "delayed-effects"
        ],
        "conflicts": []
    }
}