{
    "name": "King of the Hill",
    "texts": {
        "definition": "Reaching and keeping a sought for game state that other players are trying to reach and keep.",
        "description": [
            "Some games not only have all players competing against each other towards a goal, but let the other players continue to try and achieve that goal after the first player has reached it, and making the completion of the goal by another player make the first player lose an advantage associated with reaching the goal. [King of the Hill](kingofthe-hill) is the goal where players strive towards goals consisting of reaching and maintaining an achieved position in relation to the other players. The goal can either be to keep the game state for a certain amount of time or to simply keep it as long as possible."
        ],
        "examples": [
            "Some game variants of \"Battlefield 1942\" have positions on the maps that when held for a certain period of time depletes \"ticks\" from the other team.",
            "The board game \"Junta\" lets the president control how foreign aid money is distributed to the players. This position, although dangerous, is often sought for by all players since the ownership of money is the prerequisite for winning the game."
        ],
        "usage": [
            "Defining a [King of the Hill](kingofthe-hill) goal consist of choosing an [Interferable Goal](interferable-goals) that is also a [Continuous Goal](continuous-goals), and how to [Reward](rewards) the player that maintains the goal. The [Interferable Goal](interferable-goals) in the archetypical [King of the Hill](kingofthe-hill) is [Guard](guard) but one can also make use of [Gain Ownership](gain-ownership), [Alignment](alignment), [Enclosure](enclosure), or [Connection](connection). The players who do not have achieved the goal state should have [Preventing Goals](preventing-goals). The start of the competition between players with [King of the Hill](kingofthe-hill) goals usual have no player holding the game state, but one way of giving [Handicap](handicaps) is to let one player start with the desired state. The typical winning condition of [King of the Hill](kingofthe-hill) goals is determined by comparing [Scores](score) but [Lives](lives) can also be used, especially if all players except one runs out of them.",
            "For choosing the [Reward](rewards), two main alternatives exist: either continuously rewarding the player, usually through raising the player's [Score](score) or [Damage](damage) to the other players, or by giving the other players a [Time Limit](time-limits) before changing a value in a game state. The latter case typically takes longer time to fulfill and represents a large closure but also a larger [Investment](investments). The choice between the two typically modulates the [Risk/Reward](risk-reward) of the [King of the Hill](kingofthe-hill) goal."
        ],
        "consequences": [
            "[King of the Hill](kingofthe-hill) gives players [Symmetric Goal](symmetric-goals) and [Incompatible Goals](incompatible-goals), and as gameplay is built around the changes between defending a position and challenging it, the goal is a [Continuous Goal](continuous-goals) that naturally supports [Role Reversal](role-reversal). When the goal is defined in such a way that a minority of the players, typically one, can have the position while a majority cannot, [King of the Hill](kingofthe-hill) has a [Balancing Effect](balancing-effects) and typically promotes [Dynamic Alliances](dynamic-alliances). [King of the Hill](kingofthe-hill) can be used for [Team Play](team-play) by allowing several players to have the sought after goal and by making the completion of the goal depend on game state states that refer to a team rather than an individual player, e. g. marking flags in \"Battlefield 1942\" with the team's color and letting the color remain until a member of the enemy team has been near the flag for a certain amount of time.",
            "As [King of the Hill](kingofthe-hill) puts one player in a position where other players either are disadvantaged or seek to replace the player to gain the advantage of the position themselves, having [King of the Hill](kingofthe-hill) creates [Competition](competition) and [Conflict](conflict) between the players. Further, as the [King of the Hill](kingofthe-hill) benefits as long as the state is maintained, it puts the other players under [Tension](tension) to change the state as quickly as possible."
        ]
    },
    "relations": {
        "instantiates": [
            "continuous-goals",
            "conflict",
            "competition",
            "interferable-goals",
            "dynamic-alliances",
            "balancing-effects",
            "role-reversal",
            "symmetric-goals",
            "tension"
        ],
        "modulates": [],
        "instantiated_by": [],
        "modulated_by": [
            "damage",
            "time-limits",
            "alignment",
            "team-play",
            "lives",
            "gain-ownership",
            "guard",
            "score"
        ],
        "conflicts": []
    }
}