{
    "name": "Limited Foresight",
    "texts": {
        "definition": "Players have little knowledge of the next events in a game, or that they do not know what consequences they will have.",
        "description": [
            "Games have undetermined outcomes when players start to play them, and often parts of gameplay likewise have outcomes that are not known beforehand by players. This [Limited Foresight](limited-foresight) makes players have to perform actions without completely knowing the full consequences of them and lets them experience [Surprises](surprises) due to actions and events done by the game system or other players."
        ],
        "examples": [
            "in \"Tetris\" players only know which the next piece will be and all future pieces are unknown, one piece being revealed at a time as players place the ones they have.",
            "in \"Diplomacy\" concrete planning beyond the next move is difficult to do as the actions of all the other players are uncertain."
        ],
        "usage": [
            "The two main ways of creating [Limited Foresight](limited-foresight) for players is by limiting the game elements and information available through [Imperfect Information](imperfect-information) or by making the game have less [Predictable Consequences](predictable-consequences) of future actions or events. Both of these can be achieve through [Game Masters](game-masters) but several other ways exist to achieve one or the other.",
            "Giving [Imperfect Information](imperfect-information) about game elements can either be done through [Closure Points](closure-points) or through lack of [Game State Overview](game-state-overview). In the first case, players cannot gain access to the additional information until the gameplay as progressed beyond a certain threshold, for example by partitioning the game into [Levels](levels). As players do not have to understand or use all information and possible actions in games constructed in this way, these games can have [Smooth Learning Curves](smooth-learning-curves) where the complexity of the game is increased in a structured fashion. In the second case, players may have potential access to all information at once, but have to do actions such as [Exploration](exploration) or [Attention Swapping](attention-swapping) to get that information.",
            "Ways of decreasing the [Predictable Consequences](predictable-consequences) in a game design include adding [Randomness](randomness) or setting the [Right Level of Complexity](right-levelof-complexity) high enough that not all future game states can be regarded, the latter creating the need for [Puzzle Solving](puzzle-solving). Another way is to make players have direct influence over the evaluation functions, for example by [Player Decided Results](player-decided-results) or \"Player-Defined Distribution of Rewards &amp; Penalties.\""
        ],
        "consequences": [
            "[Limited Foresight](limited-foresight) is required for [Illusion of Influences](illusionof-influence) to exist as players have no influence in a game where there exists one optimal strategy or set of actions. Not being able to foresee events and effects gives players [Limited Planning Ability](limited-planning-ability) but does not necessarily undermine [Stimulated Planning](stimulated-planning) as it may be possible to plan strategically or a few moves ahead. [Analysis Paralysis](analysis-paralysis) is incompatible with [Limited Foresight](limited-foresight) as the latter can bound [Stimulated Planning](stimulated-planning) so that the former cannot arise.",
            "If players have [Limited Foresight](limited-foresight) but can get more extensive foresight through getting information, the pattern guarantees the presence of [Gain Information](gain-information) goals. These goals are especially valuable if the [Limited Foresight](limited-foresight) regards information that has to do with [Risk/Reward](risk-reward) choices.",
            "For [Narrative Structures](narrative-structures) to contain [Surprises](surprises) they need players to have [Limited Foresight](limited-foresight) regarding the story."
        ]
    },
    "relations": {
        "instantiates": [
            "surprises",
            "limited-planning-ability",
            "smooth-learning-curves",
            "gain-information",
            "exploration"
        ],
        "modulates": [
            "predictable-consequences",
            "stimulated-planning",
            "puzzle-solving",
            "narrative-structures",
            "illusionof-influence"
        ],
        "instantiated_by": [
            "randomness",
            "imperfect-information",
            "closure-points",
            "levels",
            "game-masters"
        ],
        "modulated_by": [
            "attention-swapping",
            "right-levelof-complexity"
        ],
        "conflicts": [
            "analysis-paralysis",
            "game-state-overview"
        ]
    }
}