{
    "name": "Limited Set of Actions",
    "texts": {
        "definition": "Players can only have a few actions to choose from.",
        "description": [
            "The actions that players can perform in a game are usually restricted, either because the focus of the game is centered on a limited topic or to make the game easy to play (although not necessarily to master)."
        ],
        "examples": [
            "Bidding in \"Poker\" only lets players choose from folding, matching, or raising a bet.",
            "\"Russian Roulette\" has only one possible action for a player, to pull the trigger.",
            "Players in real-time strategy games typically have very \"Limited Sets of Actions\" for each [Unit](units), and if the number of [Units](units) decreases, they have few actions overall to choose from."
        ],
        "usage": [
            "Limiting the possible actions available to players can be done either on an overall level or on a [Focus Loci](focus-loci) level. When done on a [Focus Loci](focus-loci) level by having limited amount of actions available to [Avatars](avatars) or [Units](units), the player may have many actions available in total but only have a few available at a time, which can create different play modes. Connecting actions to [Units](units) make it easy to further restrict the [Limited Set of Actions](limited-setof-actions) as a [Penalty](penalties) for losing the [Unit](units), not only because the total number of possible actions shrinks but potentially because the loss of [Privileged Abilities](privileged-abilities) of the [Unit](units) leads to [Ability Losses](ability-losses) for the player. An example of this can be seen in \"Chess\", where the loss of each piece reduces the total amount of actions players can choose from but may also cause the loss of specific types of actions such as diagonal moves or the knight's move.",
            "Although [Limited Set of Actions](limited-setof-actions) promotes [Stimulated Planning](stimulated-planning), this can be restricted in different ways. If the actions do not have [Predictable Consequences](predictable-consequences), this promotes [Limited Planning Ability](limited-planning-ability). If the actions do have [Predictable Consequences](predictable-consequences) but few [Closure Points](closure-points), this may also cause [Limited Planning Ability](limited-planning-ability) due to the size of possible game states but can maintain the risk of [Analysis Paralysis](analysis-paralysis) as players try to overview all possible game states.",
            "[Limited Set of Actions](limited-setof-actions) can be used to restrict the possible game states so that [Narrative Structures](narrative-structures) can be maintained and [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses) are guaranteed, although this often clearly limits players' [Freedom of Choice](freedomof-choice)."
        ],
        "consequences": [
            "Not having many choices can negatively affect [Freedom of Choice](freedomof-choice) at any given time in the game. However, this may only be on a local level as if the game has few [Closure Points](closure-points), such as in \"Chess\" or death matches in first-person shooters, the [Freedom of Choice](freedomof-choice) to what long term goals or where to move are considerably freer.",
            "[Limited Set of Actions](limited-setof-actions) typically promotes [Stimulated Planning](stimulated-planning) as the possible series of future actions is bounded, but this can in turn cause [Analysis Paralysis](analysis-paralysis). If the possible actions are very limited and the outcome is associated with high [Penalties](penalties) or [Investments](investments), the choice of action can cause anxiety and thereby heighten the [Tension](tension).",
            "Games where the [Limited Set of Actions](limited-setof-actions) can be expanded by gaining [New Abilities](new-abilities) offer [Gain Competence](gain-competence) goals, which can among other things enhance players' [Freedom of Choice](freedomof-choice), make previously [Inaccessible Areas](inaccessible-areas) accessible through [Privileged Movement](privileged-movement), or progress the [Narrative Structure](narrative-structures) as they indicate a form of [Character Development](character-development). Conversely, reduction to an already [Limited Set of Actions](limited-setof-actions) during gameplay is nearly always a [Penalty](penalties).",
            "Games using a [Game Master](game-masters) let game designers have little influence on when players have \"Limited Sets of Actions\" to choose from, as the [Game Master](game-masters) can in most cases decide what actions are possible on the spur of the moment. However, [Game Masters](game-masters) and other [Dedicated Game Facilitators](dedicated-game-facilitators) make it unnecessary for players [Memorizing](memorizing) all rules and effects of a game."
        ]
    },
    "relations": {
        "instantiates": [
            "stimulated-planning",
            "penalties",
            "analysis-paralysis",
            "tension"
        ],
        "modulates": [
            "limited-planning-ability",
            "gain-competence",
            "units"
        ],
        "instantiated_by": [
            "narrative-structures",
            "ability-losses"
        ],
        "modulated_by": [],
        "conflicts": [
            "freedomof-choice",
            "memorizing",
            "game-masters"
        ]
    }
}