{
    "name": "Maneuvering",
    "texts": {
        "definition": "Controlling the movement of game elements in real-time games.",
        "description": [
            "Games in which players control vehicles or characters that move in real time often have [Obstacles](obstacles) or [Enemies](enemies) that have to be avoided. Doing this in real time requires [Maneuvering](maneuvering) of the game elements under the players' control."
        ],
        "examples": [
            "Much of the skill in playing first-person shooters consists in being able to maneuver one's [Avatar](avatars) so one avoids enemy gunfire and has good opportunities to attack enemies.",
            "The racing game \"F-Zero GX\" requires player to maneuver to avoid obstacles and other vehicles while traveling at high speeds on a 3D racing track."
        ],
        "usage": [
            "[Maneuvering](maneuvering) can be necessary either due to the [Movement](movement) of a game element controlled by a player or by the movement of other game elements. In the first case, [Obstacles](obstacles) and [Deadly Traps](deadly-traps) in the environment may cause emergent [Evade](evade) goals, or [Chargers](chargers) and [Pick-Ups](pick-ups) may require [Collecting](collecting) actions, both of which can be completed by [Maneuvering](maneuvering). [Movement](movement) of other game elements can be [Enemies](enemies), or shots from them, that aim directly for the players' game elements or can be [Ultra-Powerful Events](ultra-powerful-events), e. g., raising bridges or rock falls, that have to be avoided. [Maneuvering](maneuvering) due to the [Movement](movement) of other game elements does not only have to aid in \"Evading\" them but can also include [Aim & Shoot](aim-shoot) actions with the intention of fulfilling [Capture](capture) or [Eliminate](eliminate) goals.",
            "[Maneuvering](maneuvering) requires that players at least have a weak [Spatial Immersion](spatial-immersion) in the game and thereby requires either a [First-Person View](first-person-views) or a [Third-Person View](third-person-views). Setting the[Right Level of Difficulty](right-levelof-difficulty) for [Maneuvering](maneuvering) actions can be done either by controlling the speed game elements move in or controlling the [Right Level of Complexity](right-levelof-complexity) by the number of game elements that have to be taken into consideration at any given point. The first raises the requirements on skills in [Dexterity-Based Actions](dexterity-based-actions) while the second requires [Attention Swapping](attention-swapping)."
        ],
        "consequences": [
            "The need for [Maneuvering](maneuvering) comes either from a lack of [Game State Overview](game-state-overview) that causes the current situation to be suboptimal or because the [Game World](game-world) is sufficiently complex to make corrections necessary regardless of chosen path. Both these causes may be due to the [Movement](movement) of other game elements, which can either be intentional movement by [Enemies](enemies) or instantiations of [The Show Must Go On](the-show-must-go-on).",
            "[Maneuvering](maneuvering), like other forms of [Movement](movement) in [Real-Time Games](real-time-games), can give [Spatial Immersion](spatial-immersion) and cannot be done in [Turn-Based Games](turn-based-games)."
        ]
    },
    "relations": {
        "instantiates": [
            "attention-swapping",
            "spatial-immersion",
            "movement"
        ],
        "modulates": [
            "capture",
            "race"
        ],
        "instantiated_by": [
            "collecting",
            "the-show-must-go-on"
        ],
        "modulated_by": [
            "deadly-traps",
            "chargers",
            "enemies",
            "obstacles",
            "right-levelof-difficulty"
        ],
        "conflicts": []
    }
}