{
    "name": "Meta Games",
    "texts": {
        "definition": "A game based on the effects and outcomes of other games.",
        "description": [
            "Some games are constructed around what happens in other games. These \"indirect\" games are [Meta Games](meta-games), and as such, they usually put totally different demands on the participants than do the underlying games. In some cases, for example in betting on horse or dogs races, the underlying game may not be a proper game (and the participants may not be aware that they are participating in a game), but the participants of the [Meta Game](meta-games) treat the activity as a game."
        ],
        "examples": [
            "[Tournaments](tournaments) are a common form of [Meta Game](meta-games) where individual results of games are used as input to the [Tournament](tournaments). For some sports, for example \"Soccer\", \"Hockey\", and \"Basketball\", playing the game in [Tournament](tournaments) form is the normal way of organized games.",
            "Betting on the outcome of games is a classic form of [Meta Game](meta-games). In these [Meta Games](meta-games), the skill required by players ranges from having the actual actions used in the games to having knowledge about the current condition and tactics of the participants in the game being bet upon."
        ],
        "usage": [
            "[Meta Games](meta-games) can either be designed to be part of the underlying game or be designed independently of the underlying game.",
            "Design elements in games that support [Meta Games](meta-games) are usually based around [Score](score) or [Handicap](handicaps) systems. The actual [Meta Games](meta-games) are, in these cases, created by passing these as [Trans-Game Information](trans-game-information) to other games, for example by [High Score Lists,](high-score-lists) explicitly supporting [Tournaments](tournaments), or letting the inner games of [Games within Games](gameswithin-games) affect the outer games. Games that have [Optional Goals](optional-goals), for example [Easter Eggs](easter-eggs), can be completed in several different ways. In these games, players can have a [Meta Game](meta-games) that consists of trying to complete as many [Optional Goals](optional-goals) as possible, and the number of [Optional Goals](optional-goals) completed may, in turn, form a kind of [Score](score).",
            "One of the main reasons for independent [Meta Games](meta-games) is based around guessing the outcome of the underlying games before the game session has ended or, in some cases, even begun. This makes the skill of playing the [Meta Game](meta-games) into a kind of [Strategic Knowledge](strategic-knowledge), whatever the skill of playing the underlying game is. A common way to create an independent [Meta Game](meta-games) is to have [Betting](betting) on the outcome of a game affect [Ownership](ownership) of real-world objects, creating [Extra-Game Actions](extra-game-actions) and [Player Defined Goals](player-defined-goals) if done by the participants themselves.",
            "The other main reasons for independent [Meta Games](meta-games) is to create [Perceivable Margins](perceivable-margins) or minimize the effect of [Luck](luck). This is usually done by creating [Tournaments](tournaments) where the goal is to win a certain number of individual games. One of the simplest forms of [Meta Game](meta-games) based upon this format is a [Tournament](tournaments) of [Quick Games,](quick-games) such as a best-of-three game of [Paper-Rock-Scissors](paper-rock-scissors). [Meta Games](meta-games) are also a way to change [Single-Player Games](single-player-games) to [Multiplayer Games](multiplayer-games) by allowing players to compare results of separate game instances or in other ways have an effect on other players' game instances."
        ],
        "consequences": [
            "[Meta Games](meta-games) make the underlying games have [Extra-Game Consequences](extra-game-consequences) that affect the [Meta Games](meta-games) through [Trans-Game Information](trans-game-information). It can modify players' [Risk/Reward](risk-reward) choices in the underlying game and allow [Spectators](spectators) of one game to be players in another game.",
            "As people can create [Meta Games](meta-games) based on any game design, outside the game designer's influence, these forms of games are examples of how players can create [Player Defined Goals](player-defined-goals). Game that allow for [Team Development](team-development) can for example easily create [Meta Games](meta-games) around planning and trying to develop the team's skills."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "perceivable-margins"
        ],
        "modulates": [
            "multiplayer-games",
            "risk-reward",
            "spectators"
        ],
        "instantiated_by": [
            "high-score-lists",
            "optional-goals",
            "tournaments",
            "score",
            "betting",
            "handicaps",
            "gameswithin-games",
            "team-development"
        ],
        "modulated_by": [
            "quick-games",
            "ownership",
            "multiplayer-games"
        ],
        "conflicts": [
            "luck"
        ]
    }
}