{
    "name": "Mutual Goals",
    "texts": {
        "definition": "The players, or some of the players, try to reach a goal within the game together.",
        "description": [
            "Some goals players have in a game are not only expressed in the same way but are the same goal. This means that the completion of the goal is not determined solely on one player's actions and that penalties and rewards associated with the goal is shared between the players. Thus, this pattern occurs whenever more than one player has exactly the same goal, e. g. \"we both try to get the red car to come first\" but not \"we both try to get our respective cars, which happen to all be red, to come first\". This means that the end conditions of \"Mutual Goals\" are the same for all of the players committed to that goal. The questions of whether to define several players to have one \"Mutual Goal\" or the same players all having identical \"Mutual Goals\" depends mainly if individual players can stop having the goal while other players continue to have it."
        ],
        "examples": [
            "In the \"Lord of the Rings\" board game by Reiner Knizia the players have a strong high-level goal of destroying the Ring and surviving Sauron's corrupting powers. All the players lose if the ring bearer falls to Sauron's corruption and the players win if the ring bearer manages to destroy the Ring in Mount Doom.",
            "Hunting in teams in Massively Multiplayer Online Roleplaying Games consists of a series of \"Mutual Goals\" of killing monsters. The hunting teams usually contain players with different skill and attribute sets: the strong fighters engage the monsters in direct combat to keep the healers and wizards safe from the attacking monsters. The healers, obviously, heal the injured characters during the fight and the wizards cast long range attack spells on the monsters. The \"Mutual Goal\" in this case is clear: kill the attacking monster or monsters together."
        ],
        "usage": [
            "One of the main design choices regarding the shared nature of \"Mutual Goals\" is whether they should be \"Predefined Goals\" or \"Player Defined Goals\" in regard to which players share the goal. Hybrids between the two are possible; for example the number of players may be predefined but the composition of players may be up to the players to decide.",
            "For \"Mutual Goals\" that exist from the beginning of gameplay, the ones that are predefined lets the game design set aspects of \"Team Play\" and \"Collaboration\" in the game and can promote \"Team Balance\", especially if the game system has access to \"Extra-Game Information\" about players skills or ranking in the game. Letting players define the composition of who share the \"Mutual Goal\" can be used to let the players control \"Handicap\" in the game.",
            "\"Mutual Goals\" can be constructed as \"Ephemeral Goals\" in order to affect game balance. If the players can negotiate with other players in order to participate in a \"Mutual Goal\" through \"Player Defined Goals,\" this can lead to a \"Balancing Effect\" since players lagging behind are more likely to form \"Temporary Alliances\" against the current leaders. This, however, is heavily influenced by how the \"Shared Rewards\" are distributed. An example of this is \"Diplomacy\" where players can negotiate and define their own temporal \"Mutual Goals\" ranging from simple `support this unit' to far ranging `defend Italy' and the rewards are typically not sharable in a quantifiable way.",
            "\"Mutual Goals\" can be unknown in an additional way compared to ordinary goals: the player composition of the group having a \"Mutual Goal\" may be unknown, either to the players not having the goal or to the players sharing the goal. In the first case this leads to \"Secret Alliances\" in which the other players try to figure out the composition of the group, while in the second case the players have \"Unknown Alliances,\" and one part of the game is to determine who is on your side without revealing your intentions to the other players. One example of this is \"Royal Turf\" (Reiner Knizia, Alea 2001) where money is won by betting on the outcome of a horse race. Once a secret betting is done, players take turns moving the horses around the track. If the player moves the horse he has bet on gives away his strategy but at the same time it would be beneficial for him to identify other players that have bet on the same horse in order to cooperate.",
            "The division of \"Rewards\" or sharing of risks and \"Penalties\", if any, from \"Mutual Goals\" is vital for the level of cooperation between the players and can be affected in several ways. A \"Mutual Goal\" with both \"Individual Rewards\" and \"Individual Penalties\" do the least to promote \"Team Play\" and mainly helps to drive the \"Narrative Structure\" or to achieve \"Delayed Reciprocity\" situations. In contrast, \"Shared Rewards\" and \"Shared Penalties\" strongly support \"Cooperation\" in \"Team Play\" as is evident in games using \"Team Elimination\". \"Individual Rewards\" together with \"Shared Penalties\" can create \"Tension\" as players compete to be the first to achieve the end condition of the goal, while \"Shared Rewards\" promote cooperation depending on the exact sharing procedure especially if the goal has \"Individual Penalties\". More complex or unpredictable distribution schemes can be achieved through \"Asymmetric Resource Distribution\" and \"Player-Decided Distribution of Rewards &amp; Penalties\".",
            "Rewards and penalties of \"Mutual Goals\" can further be complicated by having them as either \"Predefined Goals\" regarding the exact procedure of implementing the rewards and penalties, or let them be \"Player Decided Results\" after the goal has be completed or failed. In the case where the reward is vaguely defined, for example in \"Diplomacy\", the \"Mutual Goal\" can lead to \"Tension\" between the players as the value of the goal for the other players, and thereby the effort they will put into fulfilling the goal, is difficult to judge.",
            "An example of the complexity of these divisions and sharing in \"Mutual Goals\" can be found in the resolution of combat situations in fantasy roleplaying games. Although the distribution of certain rewards such as gold and experience points can be automated, the division of the special items is typically up to the players and in many cases lead to heated \"Negotiations\" and the penalties of failing is closely linked to the risks involved in a fight which is typically not even between the players. Further, the players may not know either the exact risks or rewards that are posed by the situation until after the goal is achieved."
        ],
        "consequences": [
            "Defining the same end condition for several players by giving them a \"Mutual Goal\" almost always creates some kind of \"Team Play\" and lessens the \"Conflict\" between those players, especially if they have a possibility to communicate between each other before or during the gameplay. The players of a \"Soccer\" team in \"Competition\" against another team have a simple \"Mutual Goal\" to beat the other team by scoring more goals and they, usually, try to achieve this together as a team. \"Mutual Goals\", however, do not have to depend on having predefined teams in competition against other teams. Many games, such as the classic board game \"Diplomacy\", have dynamic \"Mutual Goals\". In this case both the characteristics of the goals, the end condition, and the composition of the players trying to reach the goals can change over time and are usually dependent on the different strategies of the players and there is an inherent possibility for \"Betrayal\" for the players.",
            "\"Mutual Goals\" that are subgoals in a game can either be used to strengthen the advantages of cooperating within a team, or be used to create \"Temporary Alliances\" between players. In all the cases where reaching the goal requires collaborative efforts from the players, the \"Mutual Goals\" promote \"Social Interaction\".",
            "The same set of goals cannot at the same time be \"Mutual Goals\" and \"Incompatible Goals\"."
        ]
    },
    "relations": {
        "instantiates": [
            "betrayal",
            "team-play",
            "symmetric-goals",
            "cooperation",
            "alliances",
            "delayed-reciprocity",
            "shared-rewards"
        ],
        "modulates": [
            "shared-resources",
            "penalties",
            "competition",
            "rewards",
            "player-decided-distribution-of-rewards-penalties",
            "team-elimination"
        ],
        "instantiated_by": [
            "shared-penalties",
            "shared-rewards",
            "ownership"
        ],
        "modulated_by": [
            "individual-penalties",
            "player-defined-goals",
            "secret-alliances",
            "individual-rewards",
            "asymmetric-resource-distribution",
            "negotiation",
            "shared-penalties"
        ],
        "conflicts": [
            "conflict",
            "incompatible-goals"
        ]
    }
}