{
    "name": "Negotiation",
    "texts": {
        "definition": "A situation where the players confer with each other in order to reach an agreement or settlement.",
        "description": [
            "[Negotiations](negotiation) in most games are specific modes of play where the players have to agree upon something, for example, bargaining over the exact contents of a trade. The actual [Negotiation](negotiation) can be totally uncontrolled by the game system or can be formalized with rules on what kinds of offers can be made, when the offers can be made, and how breaches agreements should be handled."
        ],
        "examples": [
            "\"Diplomacy\", the board game, has a specific diplomacy phase during which the players are able to negotiate alliances and coordinate their actions.",
            "The [Trading](trading) phase of \"Settlers of Catan\" allows the player whose turn it is to start [Negotiations](negotiation) with other players about the trade. This [Negotiation](negotiation) phase can contain offers and counter offers from all the other players as well, but only with the player initiating the trade. Each [Negotiation](negotiation) ends when the players have resolved the trade, and the [Negotiation](negotiation) phase itself ends when the initiating player declares that it has ended."
        ],
        "usage": [
            "[Negotiation](negotiation) can either be motivated by players wanting [Resources](resources) from other players, wanting players to do or not do specific actions due to [Asymmetric Abilities](asymmetric-abilities) between players, or having to make common decisions regarding [Player Decided Results](player-decided-results) or [Shared Resources](shared-resources).",
            "It is usual that [Trading](trading) and [Bidding](bidding) or other actions that concern voluntary [Transfer of Control](transferof-control) events have specific bargaining, i. e., [Negotiation](negotiation), phases where the players try to reach an agreement. More complex [Collaborative Actions](collaborative-actions) almost require that players are able to negotiate in order to coordinate their actions properly, for example, before agreeing on pursuing [Committed Goals](committed-goals). For [Player Balance](player-balance) and [Game State Overview](game-state-overview), some [Negotiation](negotiation) is done strictly according to a [Turn Taking](turn-taking) scheme, which however can cause [Downtime](downtime).",
            "[Negotiation](negotiation) situations also appear when there are [Player Defined Goals](player-defined-goals) that are also [Mutual Goals](mutual-goals), as the players have to reach an agreement about the goal they are trying to reach. Usually, reaching these goals requires agreeing upon and coordinating more complex strategies, which also involves [Negotiation](negotiation). Establishing and maintaining the power structures in [Social Organizations](social-organizations), unless they are predefined and immutable, requires that players negotiate. One way of solving [Social Dilemmas](social-dilemmas) is to allow players to negotiate their strategies.",
            "[Negotiations](negotiation) in games can either be formalized by rules or be handled through [Extra-Game Actions](extra-game-actions). Formalized [Negotiations](negotiation) are usually specific modes of play in the game with three distinct phases: initiation, bargaining, and agreement. The rules for the initiation phase have to take three choices into account: first, which of the players can start the negotiation; second, how the participants of the negotiation are determined; and finally, what kinds of negotiations are possible. In games where players can perform hostile actions against each other, [Negotiation](negotiation) may be encouraged by having [Safe Havens](safe-havens) especially for these types of actions, and initiation may start by players entering a certain space in the game. \"Settlers of Catan\" illustrates quite well these phases: only the player whose turn it is can initiate the negotiation, all players can participate in it, and only trades of basic [Resources](resources) are allowed. The nature of the bargaining phase itself depends on the kind of [Negotiation](negotiation), but usually it consists basically of the participants making offers and counter offers, sometimes even threats, and trying to persuade other participants to a certain agreement. It is possible that the player composition of the negotiation changes during this phase. The last phase, how to determine the agreement, has at least the following options: the initiating player decides on the agreement based on the discussion during the negotiation phase; the players agreeing on something end the negotiation by excluding the other players from the negotiation; or a specific [Bidding](bidding), usually some kind of a voting, phase is used to determine the outcome. The effects of the agreement, of course, depend on the nature of the game itself.",
            "The patterns dealing with information can be used to govern how and what kind of information both the participating and non-participating players get about the different phases of the negotiation. For example, it is possible that the player composition of negotiations are known to all players, using [Symmetric Information](symmetric-information), but that the terms and agreements are only known to the participating players, using [Asymmetric Information.](asymmetric-information)",
            "[Player Decided Results](player-decided-results), especially \"Player Decided Distribution of Rewards &amp; Penalties\" for [Shared Rewards,](shared-rewards) usually require some possibility for [Negotiation](negotiation) and can represent a kind of [Overcome](overcome) goal. The presence of [Tiebreakers](tiebreakers) can make [Shared Rewards](shared-rewards) impossible and thereby close this possibility for [Negotiation](negotiation) in games.",
            "[Negotiation](negotiation) is by its nature an example of [Interruptible Actions](interruptible-actions) as players can end their bargaining. However, [Negotiations](negotiation) can also be designed to be [Interruptible Actions](interruptible-actions) so that third parties can affect the actions, typically by presenting an alternative bid or a motivation why the bargain is not fair to one part."
        ],
        "consequences": [
            "Having [Negotiation](negotiation) in a game increases [Social Interaction](social-interaction) unless the form of [Negotiation](negotiation) is highly formalized or mediated. [Dynamic Alliances](dynamic-alliances), and especially \"Uncommitted\" [Alliances](alliances), usually require [Negotiation](negotiation) first to create the [Alliance](alliances) and later on to maintain the [Alliance](alliances) and may require [Leaps of Faith](leapsof-faith). [Bluffing](bluffing) to be efficient requires that there are at least some levels of [Negotiation](negotiation) in the game while the possibility of [Betrayal](betrayal) significantly modulates how [Negotiation](negotiation) is conducted and the willingness of players to negotiate.",
            "The skill of [Negotiation](negotiation) is one route to [Game Mastery](game-mastery) in games where [Negotiations](negotiation) can have concrete effects on the game state or affect players' choices of goals and tactics (for example by completing [Preventing Goals](preventing-goals) simply by convincing other players not to pursue specific goals they have), and as such [Negotiation](negotiation) can be used in [Polyathlons](polyathlons) to spread the types of skills required.",
            "In games with [Game Masters](game-masters), [Negotiation](negotiation) may occur on a meta level to ensure [Player Balance](player-balance), for examplethrough [Ability Losses](ability-losses). In [Self-Facilitated Games](self-facilitated-games), [Negotiation](negotiation) may in a similar fashion be used to decide upon [Handicaps](handicaps)."
        ]
    },
    "relations": {
        "instantiates": [
            "leapsof-faith",
            "player-balance",
            "transferof-control",
            "game-mastery",
            "bluffing"
        ],
        "modulates": [
            "bidding",
            "collaborative-actions",
            "committed-goals",
            "trading",
            "overcome",
            "handicaps",
            "dynamic-alliances",
            "polyathlons",
            "ability-losses",
            "mutual-goals",
            "social-organizations",
            "player-decided-results",
            "uncommitted-alliances",
            "shared-rewards",
            "player-defined-goals"
        ],
        "instantiated_by": [
            "shared-resources",
            "asymmetric-abilities",
            "game-masters"
        ],
        "modulated_by": [
            "safe-havens",
            "interruptible-actions",
            "betrayal",
            "asymmetric-information",
            "turn-taking",
            "game-state-overview",
            "preventing-goals",
            "symmetric-information"
        ],
        "conflicts": [
            "downtime",
            "tiebreakers"
        ]
    }
}