{
    "name": "No-Ops",
    "texts": {
        "definition": "The action of doing nothing.",
        "description": [
            "Sometimes the best action in a game is to do nothing and wait for the environment to change. These actions are called No-Ops from the instructions from programming with the same name. No-Ops can also be forced on players as punishments for other players or as effects of the player's own actions."
        ],
        "examples": [
            "trying to avoid guards in the \"Thief\" series of games requires that one combines silent and careful movement with periods of inactivity to not be noticed.",
            "powering down in the board game \"RoboRally\" to repair damage requires that a player is prepared to spend one turn doing a [No-Op](no-ops)."
        ],
        "usage": [
            "The prime design choice for [No-Ops](no-ops) is if they are voluntary or not. [Turn-Based Games](turn-based-games) can enforce players to do actions every turn in order for the game to continue and may have [No-Ops](no-ops) as [Privileged Abilities](privileged-abilities). [No-Ops](no-ops) are also used in these games as a form of [Penalty](penalties) for performing [Privileged Abilities](privileged-abilities). [Tick-Based Games](tick-based-games) and [Real-Time Games](real-time-games) cannot require players to do actions all the time so they support voluntary [No-Ops](no-ops). But this is a matter of perspective, in [Real-Time Games](real-time-games) where the player's [Avatar](avatars) or [Units](units) move continuously, which can be described as applying [The Show Must Go On](the-show-must-go-on) on players' game elements, this can be seen as an action and players only have the choice between doing the pre-chosen action or another from a set of possible actions.",
            "The possibility of doing [No-Ops](no-ops), or actions with little consequence to the overall game state, is a requirement for [Camping](camping). Similarly it is often used to allow [Stealth](stealth) goals."
        ],
        "consequences": [
            "Having the possibility of [No-Ops](no-ops) widens players' [Freedom of Choice](freedomof-choice) and allows [Timing](timing) of actions, for example to wait for other players to do actions before acting themselves. As [No-Ops](no-ops) can be perceived as being force to wait, having too many of them consecutively may hinder reasonable waiting times. [Extended Actions](extended-actions) that do not have an effect on the game state before they are completed can be seen as consisting of an initiating action, several [No-Ops](no-ops), and a finishing action where the game state is updated.",
            "Forcing players to do [No-Ops](no-ops) while noticing the action of [Enemies](enemies) can increase [Tension](tension) but so can doing voluntary [No-Ops](no-ops) to wait for [Enemies](enemies) to appear. Extensive amount of [No-Ops](no-ops) in games of course negatively affects [Varied Gameplay](varied-gameplay)."
        ]
    },
    "relations": {
        "instantiates": [
            "penalties",
            "tension",
            "freedomof-choice",
            "extended-actions",
            "privileged-abilities"
        ],
        "modulates": [
            "stealth",
            "camping",
            "timing"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "the-show-must-go-on"
        ],
        "conflicts": [
            "varied-gameplay"
        ]
    }
}