{
    "name": "Orthogonal Unit Differentiation",
    "texts": {
        "definition": "When Units in a game can be described by actions, abilities, and characteristics that are orthogonal to each other regarding functionality.",
        "description": [
            "One of the uses of many game pieces or units in a game is to provide players with different types of abilities. When the abilities and functionality of these are not only quantitative but qualitative the game has [Orthogonal Unit Differentiation](orthogonal-unit-differentiation). This give the different game pieces additional value since they represent the only ways for players to perform certain actions. Not all or many aspects of a units needs to be unique, often it is sufficient that a single ability of a unit is radically different from other units for it to have special gameplay value. In team games, the differentiation may actually be between players so that each player has unique abilities."
        ],
        "examples": [
            "Real-time games such as the \"Age of Empires\" series and the \"Command &amp; Conquer\" series are based around producing and making best use of a wide variety of units. Although few units have unique abilities, such as the converting ability of priests, many do have abilities that are only shared by a few other types of units and define one dimensional in the range of unit abilities in the game.",
            "the pieces in \"Chess\" have different types of movement rules, giving them different gameplay value and giving the game [Orthogonal Unit Differentiation](orthogonal-unit-differentiation)."
        ],
        "usage": [
            "[Orthogonal Unit Differentiation](orthogonal-unit-differentiation) is achieved through [Asymmetric Abilities](asymmetric-abilities), typically by designed [New Abilities](new-abilities) for [Units](units) or [Characters](characters). Not all abilities have to be [Privileged Abilities](privileged-abilities) and a differentiation can also be achieved by [Improved Abilities](improved-abilities) and [Decreased Abilities](decreased-abilities) as long as not all [Units](units) and [Characters](characters) have the abilities. Typical areas where [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) is used is the way they can cause [Damage](damage), what [Skills](skills) they can have, what [Combos](combos) they can perform, how they affect [Fog of War](fogof-war), and what types of [Privileged Movement](privileged-movement) they have (and if not all [Units](units) can move, [Movement](movement) in itself may be a way to have differentiation). [Inaccessible Areas](inaccessible-areas) provide two different levels of abilities that can be used to create differentiation: the ability to enter them and the ability to be inside them without taking [Damage](damage).",
            "The difference in functional abilities either exists between different [Units](units) under the same player's control or between the [Characters](characters) or groups of [Units](units) under different players' control. The requirement of using [Privileged Abilities](privileged-abilities) make it difficult to provide symmetric abilities on the same level as the [Orthogonal Unit Differentiation](orthogonal-unit-differentiation), but one can combine the two through [Symmetry](symmetry), for example have all [Units](units) belong to a player have the same abilities while having the abilities of [Units](units) differ between players. In games with [Team Play](team-play), having [Symmetry](symmetry) between teams that within them have [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) allows [Team Balance](team-balance) while providing [Varied Gameplay](varied-gameplay) and letting players have [Competence Areas](competence-areas)."
        ],
        "consequences": [
            "[Orthogonal Unit Differentiation](orthogonal-unit-differentiation) provides [Varied Gameplay](varied-gameplay) within a play session on the [Unit](units) level. Making full use of the different abilities of [Units](units) promotes [Stimulated Planning](stimulated-planning) in games where all [Units](units) are usable at the same time while games where players have to select which [Units](units) (or [Characters](characters)) are used in the game promotes [Replayability](replayability). [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) among [Enemies](enemies) provides [Varied Gameplay](varied-gameplay) for [Overcome](overcome) goals and the first use of unknown abilities may come as [Surprises](surprises) to players. In games with [Team Play](team-play), players can take the places of [Units](units) in [Orthogonal Unit Differentiation](orthogonal-unit-differentiation). This allows players to make use of their individual [Competence Areas](competence-areas) as well as provide a basis for [Social Organizations](social-organizations).",
            "The unique abilities required by [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) makes it difficult to combine with [Symmetry](symmetry) on the same level of game design. However, they can be combined by treating the differentiated units as a set and have the same sets for all players or all teams."
        ]
    },
    "relations": {
        "instantiates": [
            "competence-areas",
            "surprises",
            "stimulated-planning",
            "varied-gameplay"
        ],
        "modulates": [
            "fogof-war",
            "overcome",
            "enemies",
            "team-play",
            "social-organizations",
            "team-balance",
            "symmetry",
            "inaccessible-areas"
        ],
        "instantiated_by": [
            "damage",
            "asymmetric-abilities",
            "units",
            "privileged-movement",
            "movement",
            "characters",
            "new-abilities",
            "privileged-abilities",
            "combos"
        ],
        "modulated_by": [
            "decreased-abilities",
            "improved-abilities",
            "skills"
        ],
        "conflicts": [
            "symmetry"
        ]
    }
}