{
    "name": "Overcome",
    "texts": {
        "definition": "This is the goal of the player to defeat an opposing force in a test, or a series of tests, involving attributes or performance of low-level actions.",
        "description": [
            "The opposing force in [Overcome](overcome) can be other players or other kinds of enemies provided by the game system."
        ],
        "examples": [
            "Fighting games, such as \"Soul Calibur\" and \"Tekken\", are almost purely about overcoming the opponent by performing a series of successful attacks the opponent is unable to dodge or block.",
            "\"Chess\" uses the [Overcome](overcome) pattern through a combination of eliminating the other player's pieces and skillful positioning of one's own pieces."
        ],
        "usage": [
            "The main design choice of [Overcome](overcome) is to select the [Enemies](enemies) a player has to compete against; these [Enemies](enemies) can either be computer controlled or player controlled, and by providing several different types through the use of [Orthogonal Unit Differentiation](orthogonal-unit-differentiation), the [Replayability](replayability) of the goal increases. If the [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) is also applied to allow the player to choose different [Avatars](avatars) or [Units](units), this creates [Freedom of Choice](freedomof-choice). By increasing the difficulty of [Overcome](overcome) goals, a game design can guarantee [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses). For example, games using [Levels](levels) often have a [Boss Monster](boss-monsters) as the final [Enemy](enemies) for each [Level](levels), which players have to [Overcome](overcome) in order to complete the [Level](levels).",
            "The test of attributes used to see if the [Overcome](overcome) pattern is fulfilled can range from simple comparisons (which party has stronger attributes) to a long sequence of tests involving different actions or [Tournaments](tournaments). The simplest case can be exemplified by combat resolution in some strategy games: [Units](units) with more troops automatically defeat the opponent [Units](units) with fewer troops. The combat resolution tables used in conjunction with [Randomness](randomness), normally [Dice](dice), are another, slightly more complex, method of evaluating the outcome. The same kind of method is used to determine the fights between the [Units](units) in current real-time strategy games. The exact nature of the tests involved can represent a number of different fields of expertise, including the use of the following patterns: [Combat](combat), [Timing](timing), [Rhythm-Based Actions](rhythm-based-actions), [Dexterity-Based Actions](dexterity-based-actions), [Memorizing](memorizing), [Negotiation](negotiation), [Puzzle Solving](puzzle-solving), and [Luck](luck). The [Overcome](overcome) goal can be one of these, a combination of these, or a player-decided choice. [Tiebreakers](tiebreakers) are often used with [Overcome](overcome) goals to make it impossible for both players to win or lose simultaneously. Many [Overcome](overcome) goals use a [Tournament](tournaments) format with the same test performed several times to lessen the influence of [Luck](luck) and allow for [Perceivable Margins](perceivable-margins). [Achilles' Heels](achilles-heels) can be used to give opponents weakness that can be exploited to more easily beat the opponent.",
            "Computer-based games usually automate the evaluations of who won the [Overcome](overcome) goal, but others games, especially sports and roleplaying games, make use of [Game Masters](game-masters) or judges.",
            "The effect of fulfilling [Overcome](overcome) goals is commonly to remove a game element or player, resulting in an [Eliminate](eliminate) goal and [Player Elimination](player-elimination). An example of this is [Last Man Standing](last-man-standing) where the goal is to defeat all other players (or at least to defeat the other remaining player when only two remain). However, other options available to game designers include [Capture](capture) (e. g., \"Paradroid\"), the fulfillment of a [Gain Ownership](gain-ownership) goal through redistribution of resources, or the gain of points used to determine a [Score](score). Other common effects of completing [Overcome](overcome) goals are the [Transfer of Control](transferof-control) of [Resources](resources) or [Tools](tools) or handing over [Area Control](area-control)."
        ],
        "consequences": [
            "[Overcome](overcome) promotes [Conflict](conflict), or at least [Competition](competition), as the player is trying to be better than another player (or oneself). In the process, it also promotes [Tension](tension), especially if players have [Immersion](immersion) in the game or if the actual determination of the outcome of the goal is preceded by a period of preparation or building up resources and skills. This allows [Overcome](overcome) goals to be used as subgoals to inject moments of [Tension](tension) into goals that are not necessarily fast-paced, e. g., [Delivery](delivery), [Stealth](stealth), or [Rescue](rescue) goals.",
            "The [Overcome](overcome) and [Capture](capture) goals are very often related in a [Hierarchy of Goals](hierarchyof-goals) but what goal is subgoal to the other depends primarily on how their [Rewards](rewards) are structures and how the players' tactics are constructed.",
            "As [Overcome](overcome) has two or more players trying to beat each other, it is often an example of a [Symmetric Goal](symmetric-goals). Although individual tests may allow [Tied Results](tied-results), the overall goal of [Overcome](overcome) goals are [Excluding Goals](excluding-goals) so that [Tied Results](tied-results) are avoided. The exception that allows for a form of [Tied Results](tied-results), usually associated with [Shared Penalties](shared-penalties), is when all players fail to [Overcome](overcome) each other. Both \"Chess\" and \"Go\" have [Overcome](overcome) goalsthat also are [Excluding Goals](excluding-goals). However, \"Chess\" games can end without any player being able to checkmate the opponent, while \"Go\" games cannot be drawn if handicap points with using half stone values are given for the advantage of starting.",
            "As [Overcome](overcome) goals usually center on one test, they provide focused areas for players to develop [Game Mastery](game-mastery) in. This provided the usual possibilities for social rewards, with the additional facet that the player may have [Overcome](overcome) some of the people in the social group."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "competition",
            "gain-ownership",
            "capture",
            "tension",
            "game-mastery",
            "excluding-goals",
            "symmetric-goals",
            "tournaments",
            "transferof-control"
        ],
        "modulates": [
            "delivery",
            "rescue",
            "player-elimination"
        ],
        "instantiated_by": [
            "last-man-standing",
            "tournaments",
            "enemies",
            "boss-monsters",
            "area-control"
        ],
        "modulated_by": [
            "timing",
            "negotiation",
            "puzzle-solving",
            "luck",
            "orthogonal-unit-differentiation",
            "tiebreakers",
            "memorizing",
            "immersion"
        ],
        "conflicts": []
    }
}