{
    "name": "Parallel Lives",
    "texts": {
        "definition": "Parallel Lives are used in games where the player controls or protects several game elements which each can be considered to have a life of its own.",
        "description": [
            "The loss of one of these elements may limit the players' possible actions or opportunities but does not have as severe consequences as the loss of a life of a player character, which typically signifies the end of a game session or forces the players to restart at an earlier point in the game."
        ],
        "examples": [
            "\"Missile Command\" is an archetypical example of \"Parallel Lives\": the player has six cities that all can be destroyed and the player can continue playing as long as at least one city is intact."
        ],
        "usage": [
            "The design choices associated with \"Parallel Lives\" are similar to those of \"Lives\" but the \"Penalties\" of losing a parallel life is usually small, typically only the loss of the actions the \"Units\" provided. However, not all \"Units\" need to be valued the same in order to create a hierarchy of importance; the lose of some may allow continued gameplay while others must be kept alive, at least until certain events have taken place,. The consequences of losing all \"Parallel Lives\" are typically the same as losing all \"Lives\" in an \"Avatar\" -based game of \"Player Elimination\"."
        ],
        "consequences": [
            "\"Parallel Lives\" require players to make Risk/Reward calculations on which game elements to protect and which to risk. The pattern often requires the players to perform \"Attention Swapping\", especially in games where players do not have a complete overview of the \"Game World\". The use of \"Parallel Lives\" is problematic to combine with that of \"Avatars\"."
        ]
    },
    "relations": {
        "instantiates": [
            "attention-swapping",
            "lives"
        ],
        "modulates": [
            "units",
            "player-elimination"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "penalties"
        ],
        "conflicts": [
            "avatars"
        ]
    }
}