{
    "name": "Penalties",
    "texts": {
        "definition": "Players are inflicted with something perceived as negative or stripped of an advantage, due to failure to meet a requirement in the game.",
        "description": [
            "Very few games allow all players to reach all the goals they have when playing a game. While failing to meet a goal that one has strived for is often experienced as unpleasant, games may make the failure of completing goals even more unpleasant by punishing those who fail them. These [Penalties](penalties) increase the importance of the goals they are connected to in comparison with other goals and can thereby influence player actions and tactics. In games, especially sports, where it can be difficult to judge if the actions performed by player follow the rules, there are often meta rules for how to penalize rule-breaking.",
            "Players can receive [Penalties](penalties) as consequences of actions and events they have not initiated, for example being hit by an opponent. Although this can be described as failing to avoid the goal of being hit, it is more common to describe such [Penalties](penalties) as consequences of events; in many cases, what one player perceives as a [Penalty](penalties) is perceived as a good outcomefor another player."
        ],
        "examples": [
            "\"Soccer\" and \"Ice Hockey\" have several types of [Penalties](penalties), including giving control of the ball or puck to the other team or banning players from the game, for failing to follow the rules of the game.",
            "The loss of the money bet in a deal is the [Penalty](penalties) in \"Poker\" for folding or not having the best hand.",
            "The [Penalty](penalties) for losing a piece to an opponent in \"Chess\" is the loss of that game piece for the remainder of the game."
        ],
        "usage": [
            "Compared to [Rewards](rewards), [Penalties](penalties) are less common in games. This is because playing a game is a voluntary activity; if players did not over time perceive it as having more advantages than disadvantages, playing a particular game would cease in preference to other games that people overall perceived as more rewarding. Further, [Penalties](penalties) tend to be defined so that they are more often [Predictable Consequence](predictable-consequences) than [Rewards](rewards); players perceive it as being more important to know what the most negative consequences can be compared to what the positive outcomes are when making [Risk/Reward](risk-reward) judgments. Due to this, [Penalties](penalties) are more bound by the [Consistent Reality Logic](consistent-reality-logic) of the game and do not introduce new aspect of an [Alternative Reality](alternative-reality) in the same way [Rewards](rewards) do. For this reason, few games advance the [Narrative Structure](narrative-structures) through [Penalties](penalties). [Penalties](penalties) to [Characters](characters) with players can further modulate [Risk/Reward](risk-reward) choices due to [Emotional Immersion](emotional-immersion).",
            "These restrictions on the use of [Penalties](penalties) are especially true in games supporting \"Saving\", as [Save-Load Cycles](save-load-cycles) can return the player to a game state before the [Penalty](penalties) is given. However, [Penalties](penalties) can be used to lessen players' wishes for [Reversability](reversability) of the game state to occur by exposing additional explicit [Penalties](penalties) for allowing [Continuous Goals](continuous-goals) to be interrupted, for example, losing [Area Control](area-control) after gaining it.",
            "That [Penalties](penalties) tend to have [Predictable Consequences](predictable-consequences) does not mean that their effect has to be fixed. This can either be due to the definition of the [Penalty](penalties) depending on the game state or that the consequences create chain reactions; in both cases, this may require players to perform [Attention Swapping](attention-swapping) between different activities while playing to judge the effect of [Penalties](penalties) given the current game state.",
            "The choices available when designing [Penalties](penalties) are affected by the nature of the goals that the [Penalties](penalties) are linked to. For [Mutual Goals](mutual-goals), the difference between [Individual Penalties](individual-penalties) and [Shared Penalties](shared-penalties) greatly affects how players cooperate. For [Continuous Goals](continuous-goals), the [Penalties](penalties) are continuous threats while the [Rewards](rewards) may be distant. [Penalties](penalties) are required components of [Committed Goals](committed-goals); without them, any commitment would be purely symbolic or based on [Extra-Game Consequences](extra-game-consequences). This does not mean that players have to fulfill them, e. g., [Ephemeral Goals](ephemeral-goals) can appear during gameplay, and players have to decide whether to try and complete them to avoid their [Penalties](penalties) or accept the [Penalties](penalties) and focus upon the main goals of the game. In contrast, [Player Defined Goals](player-defined-goals) that are not modeled within the game state of a game are always without in-game [Penalties](penalties).",
            "Common forms of [Penalties](penalties) include loss of [Resources](resources), [Skills](skills), [Combos](combos), [Lives](lives) (which may be modulated by [Spawning](spawning))\", Parallel Lives,\" or [Units](units) but other forms are also common: limiting players' [Freedom of Choice](freedomof-choice) by giving them a [Limited Set of Actions](limited-setof-actions) through [Ability Loss](ability-losses); forcing players to have [Downtime](downtime) by doing [No-Op](no-ops) actions for a certain amount of time or turns, often but not always as [Spectators](spectators); imposing [Movement Limitations](movement-limitations); or performing a [Role Reversal](role-reversal) so that the player receiving the [Penalty](penalties) gets an unfavorable role. Less common is the [Penalty](penalties) of giving other players [Privileged Abilities](privileged-abilities). [Player Killing](player-killing) is a [Penalty](penalties) that gives the killed player [Downtime](downtime) but may also affect the player that did the killing, especially if they were in the same team in a game with [Team Play](team-play).",
            "In some cases, the [Reward](rewards) for one player is to select [Penalties](penalties) for other players, for example in [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties) where one player decides with absolute power. However, in [Multiplayer Games](multiplayer-games) the value of such [Rewards](rewards) lessens compared to positive [Rewards](rewards), with the number of players. This is because, unless the [Penalty](penalties) is given to all other players, the relative change in position for the player receiving the [Reward](rewards) is nothing to all but one player while a positive [Reward](rewards) gives a relative change in position toward all other players. The forms of [Penalties](penalties) encourage [Negotiation](negotiation), as does [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties) in general.",
            "[Penalties](penalties) can be used to negatively create [Social Statuses](social-statuses); for example, by showing the amount of [Player Killing](player-killing) each player has done. When they exist, the ability to assign [Penalties](penalties) within a social group without prompting from the game system is a form of [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties) that is usually assigned to those with higher [Social Status](social-statuses).",
            "[Penalties](penalties) can be used to encourage [Team Play](team-play) by using [Shared Penalties](shared-penalties), for example by losses of [Shared Resources](shared-resources). These can also be used to force players into [Alliances](alliances) where no [Rewards](rewards) exist. Random [Individual Penalties](individual-penalties) can have the same effect; for example, the practice of decimating a Roman unit , i. e. killing one randomly chosen soldier out of every ten, after soldiers deserted made soldiers watch each other to ensure that nobody deserted the unit. [Penalties](penalties) can also be to ensure continued cooperation by penalizing [Betrayal](betrayal). When [Penalties](penalties) do not exist, most [Alliances](alliances) are actually [Uncommitted Alliances](uncommitted-alliances), and one of the major considerations for the cooperation is the risk of [Betrayal](betrayal)."
        ],
        "consequences": [
            "[Penalties](penalties) are the effects of [Damage](damage),[Deadly Traps](deadly-traps), or failing to complete goals and usually give [Emotional Immersion](emotional-immersion) in games.[Penalties](penalties) indicate to players what actions and strategies should be avoided in a game but do not make the action or strategies impossible. Indeed, knowing what short-term [Penalties](penalties) to take in order to gain long-term [Rewards](rewards) is often [Strategic Knowledge](strategic-knowledge) and a sign of [Game Mastery](game-mastery). The presence of [Penalties](penalties) increases [Tension](tension) in a game and can be forced upon players in a way that the [Tension](tension) of trying to reach a [Reward](rewards) cannot.",
            "Imbalances in [Freedom of Choices](freedomof-choice) between players or, more generally, imbalances in [Player Balance](player-balance) can be perceived as [Penalties](penalties). For example, not having a [Privileged Ability](privileged-abilities) (including one that protects from a [Penalty](penalties)) can be seen as a [Penalty](penalties). [Penalties](penalties) can be used to correct these imbalances; giving [Penalties](penalties) to players leading a game has a [Balancing Effect](balancing-effects), something that can be used by the other players in games where players can hand out [Penalties](penalties) and there exists a sufficient [Game State Overview](game-state-overview).",
            "A [Penalty](penalties) can be modulated by a [Reward](rewards) and vice versa. This can mitigate the effects of a [Penalty](penalties) or make a [Reward](rewards) less attractive. Another way of modulating [Rewards](rewards) with [Penalties](penalties) is to define the [Reward](rewards) of a goal as the [Penalty](penalties) for another player, as for example, the [Reward](rewards) of [Eliminate](eliminate) goals often can be seen."
        ]
    },
    "relations": {
        "instantiates": [
            "social-statuses",
            "predictable-consequences",
            "strategic-knowledge",
            "tension",
            "dynamic-alliances",
            "spawning",
            "emotional-immersion"
        ],
        "modulates": [
            "attention-swapping",
            "damage",
            "deadly-traps",
            "game-mastery",
            "rewards",
            "lives",
            "parallel-lives",
            "units",
            "ephemeral-goals",
            "team-play",
            "area-control",
            "skills",
            "risk-reward",
            "combos",
            "characters",
            "betrayal",
            "player-killing",
            "uncommitted-alliances",
            "player-defined-goals"
        ],
        "instantiated_by": [
            "spectators",
            "individual-penalties",
            "limited-setof-actions",
            "ability-losses",
            "decreased-abilities",
            "privileged-abilities",
            "committed-goals",
            "eliminate",
            "role-reversal",
            "movement-limitations",
            "shared-penalties",
            "resources",
            "downtime"
        ],
        "modulated_by": [
            "continuous-goals",
            "shared-resources",
            "consistent-reality-logic",
            "rewards",
            "privileged-abilities",
            "identification",
            "balancing-effects",
            "mutual-goals"
        ],
        "conflicts": [
            "narrative-structures",
            "freedomof-choice"
        ]
    }
}