{
    "name": "Perceived Chance to Succeed",
    "texts": {
        "definition": "Players believe, whether correctly or not, that they have a chance to succeed with actions in a game.",
        "description": [
            "For games to be interesting to play, players must feel that they can influence the outcome of the game. Being able to affect the outcome means that players can also choose what sort of outcome they wish the game to have, and that they have a [Perceived Chance to Succeed](perceived-chanceto-succeed) with their intentions. Players do not actually have to have a chance to succeed for a game to be interesting; the important part is that they believe that they have."
        ],
        "examples": [
            "Simple betting games such as \"Roulette\" or various dice games always give players a chance to win, and players usually can know the exact percentage that they will win. In contrast, players can have hands in most forms of \"Poker\" that appear to be able to win when they in fact may not be, due to the cards that have already been dealt.",
            "Most computer games can either not be won at all or guarantee that there are ways to win. In the latter case, players know that there exists a chance to succeed in completing the game, but the perception of that possibility for them is mainly due to their perception of their own skills compared to the difficulty of the game."
        ],
        "usage": [
            "Players' basic perception of their chance to succeed is usually based on [Strategic Knowledge](strategic-knowledge), the [Skills](skills) of their [Characters](characters), and if they feel games have [Player Balance](player-balance) and the [Right Level of Difficulty](right-levelof-difficulty). [Player Balance](player-balance) can be made more likely through ensuring [Team Balance](team-balance) and introducing [Balancing Effects](balancing-effects) such as [Handicap](handicaps). [Smooth Learning Curves](smooth-learning-curves) can make players continuously feel that they have a [Perceived Chance to Succeed](perceived-chanceto-succeed) throughout a game. One simple way of modifying the [Right Level of Difficulty](right-levelof-difficulty) without redesigning the core of challenges in games is to modify the number or abilities of [Enemies](enemies).",
            "Player perceptions of the chances to succeed with specific abilities can easily be modulated negatively during gameplay with [Ability Losses](ability-losses) and [Decreased Abilities](decreased-abilities), and positively by [New Abilities](new-abilities) and [Improved Abilities](improved-abilities). This is most easily done while maintaining a [Consistent Reality Logic](consistent-reality-logic) by using [Tools](tools) but may also be due to [Character Development](character-development). [Player Decided Results](player-decided-results) always guarantee that at least some players have an influence on the results and thereby a [Perceived Chance to Succeed](perceived-chanceto-succeed) in gaining the results they wish, although the results typically become compromises.",
            "If players have several ways of succeeding, which can be modulated through [Ability Losses](ability-losses) and [New Abilities](new-abilities), the [Perceived Chance to Succeed](perceived-chanceto-succeed) may be under the players' control. This increases players' [Freedom of Choice](freedomof-choice) but may require players to make [Tradeoffs](tradeoffs), [Risk/Reward](risk-reward) choices, or experience [Social Dilemmas](social-dilemmas). [Cut Scenes](cut-scenes) can give players information on how they should act and thereby increase their perceived chance. The actual performance of actions in the game can provide players with the [Perceived Chance to Succeed](perceived-chanceto-succeed) with the following actions through [Illusionary Rewards](illusionary-rewards), [Near Miss Indicators](near-miss-indicators), and [Progress Indicators](progress-indicators).",
            "Although [Perfect Information](perfect-information) naturally gives players a [Perceived Chance to Succeed](perceived-chanceto-succeed) that is equal to the actual chance to succeed, this may dissuade players from trying if the chance is small or nonexistent. In these cases, [Imperfect Information](imperfect-information) can instead be used to show, or give the illusion, that players have a chance to succeed and thereby encourage players to try.",
            "[Surprises](surprises) and [Ultra-Powerful Events](ultra-powerful-events) are examples of events that may ruin players [Perceived Chance to Succeed](perceived-chanceto-succeed) while [Leaps of Faith](leapsof-faith) are actions that players have to perform without having a strong [Perceived Chance to Succeed](perceived-chanceto-succeed)."
        ],
        "consequences": [
            "Having a [Perceived Chance to Succeed](perceived-chanceto-succeed) gives players influence, or at least the [Illusion of Influence](illusionof-influence), in games and may be required for players to have [Emotional Immersion](emotional-immersion) or experience [Tension](tension) while playing. Giving players a [Perceived Chance to Succeed](perceived-chanceto-succeed) requires that games offer them [Freedom of Choice](freedomof-choice) between actions or goals and that their actions in the game have [Predictable Consequences](predictable-consequences). However, having the [Perceived Chance to Succeed](perceived-chanceto-succeed) with several different actions gives a [Freedom of Choice](freedomof-choice), so the patterns affect each other on different levels, for example, regarding choices between the ways actions can be tried and why actions should be performed. [Player Decided Results](player-decided-results) are an example of how players can be guaranteed to influence the game, although not necessarily all players get to do so.",
            "[Game Masters](game-masters) have a strong impact on players [Perceived Chance to Succeed](perceived-chanceto-succeed): they can either make attempted actions automatic successes, automatic failures, or let the success depend on [Randomness](randomness) with the possible influence of [Skill](skills). Automatic successes instantiate [Player Decided Results](player-decided-results) and possibly [Creative Control](creative-control), although players may not be aware of this to maintain [Tension](tension) and maintain other players' [Illusion of Influence](illusionof-influence) or [Perceived Chance to Succeed](perceived-chanceto-succeed). Automatic failures may be necessary to maintain [Narrative Structures](narrative-structures) but can be done without breaking players' [Illusion of Influence](illusionof-influence) if the way of determining the evaluation function is hidden from the players, for example, by rolling [Dice](dice) behind a \"Game Master's\" screen."
        ]
    },
    "relations": {
        "instantiates": [
            "emotional-immersion",
            "illusionof-influence",
            "tension"
        ],
        "modulates": [],
        "instantiated_by": [
            "predictable-consequences",
            "character-development",
            "player-balance",
            "team-balance",
            "handicaps",
            "improved-abilities",
            "freedomof-choice",
            "game-masters",
            "new-abilities",
            "player-decided-results",
            "balancing-effects",
            "right-levelof-difficulty",
            "tools",
            "progress-indicators",
            "illusionary-rewards"
        ],
        "modulated_by": [
            "near-miss-indicators",
            "smooth-learning-curves",
            "social-dilemmas",
            "decreased-abilities",
            "enemies",
            "tradeoffs",
            "risk-reward",
            "skills",
            "randomness",
            "imperfect-information",
            "cut-scenes",
            "asymmetric-resource-distribution"
        ],
        "conflicts": [
            "leapsof-faith",
            "decreased-abilities",
            "perfect-information",
            "ability-losses",
            "game-masters",
            "surprises",
            "narrative-structures"
        ]
    }
}