{
    "name": "Perfect Information",
    "texts": {
        "definition": "The player has full and reliable access to current or past information about a game component, or that total current or past game state is known to the player",
        "description": [
            "\"Perfect Information\" can either be applied to a subset of the game state, typically to the attributes of some game elements, or the game state as a whole. Well-known examples of games where the whole game state is known are traditional board games such as \"Chess\" and \"Go\". Examples of how \"Perfect Information\" can be applied to several different subsets of the game state can be found in \"Poker\". In \"Poker\", players have \"Perfect Information\" about the number of cards in the deck, the number of cards the other players have, how many they have changed during the round, and what cards are in their hands. Further, the amount of the bet is normally fully known to the players as well. The only exception to the \"Perfect Information\" in the game is the knowledge about the other players' hands, but depending on the outcome of the betting, some of the other players' hands may be revealed as they have to show their cards to determine the winner, thus applying \"Perfect Information\" on those cards as part of the evaluation function for the end condition of the round."
        ],
        "examples": [
            "A player in the dice game \"Yahtzee\" has \"Perfect Information\" about all game elements since the results of all dice rolls are public and recorded on a common score track.",
            "Programming games such as \"JRobots\", \"CRobots\", and \"PRobots\" (where J, C, and P stand for the Java, C, and Pascal programming languages, respectively) let the players code their own robots that then fight the other robots in a simulation, which the players cannot affect. Unless specified, the code controlling the other robots is available to the players after the game instances, letting them have \"Perfect Information\" about the other players' strategies for future games if the player can interpret the strategies from the code."
        ],
        "usage": [
            "Supporting \"Perfect Information\" naturally depends on presenting information in such way that the risk of misunderstanding is minimal. For this reason, \"Direct Information\" is easier to use with \"Perfect Information\" than \"Indirect Information\" since there is no risk of information loss due to the translation. Classical board games, such as \"Chess\" and \"Go,\" do this by having the game state stored as physical game elements that are visible to all players. \"Perfect Information\" is also difficult to use with \"Red Herrings\".",
            "Providing \"Perfect Information\" in a game is tied to the \"Right Level of Complexity\" of the game. Games with a large possible game state and few \"Closure Points\", e. g., \"Chess\" and \"Go\", can provide \"Perfect Information\" without having too much predictability. This is not the case for games with smaller possible game states such as \"Poker\", which may become too predictable when using the pattern.",
            "Games of complete \"Perfect Information\" and \"Symmetric Information\" automatically create a perfect \"Game State Overview\" and typically support \"Public Information\" easily, if not automatically.",
            "\"Perfect Information\" may be applied during the determination of evaluation functions. This can allow players to gain information about the strategies and tactics of the other players, offering an opportunity to gain \"Strategic Knowledge\" about the game. However, this may limit otherwise potential \"Tension\", e. g., not knowing the card hand of \"Poker\" players who folded or successfully completed \"Bluffing.\"",
            "Games can be constructed so that \"Perfect Information\" about game elements is temporarily presented explicitly to players then hidden again. These games, where the archetypical example is \"Memory\", make use of \"Memorizing\" and may allow players to have \"Perfect Information\" about the whole game state without showing any information after the game has been played for some time. Trick-based games and games using \"Discard Piles\" can allow the same possibilities by making players show information for a while and then remove it. This can further be strengthened by imposing limitations on actions, e. g., requiring players to follow suit or take if they can in card games.",
            "Games of \"Cooperation\" and \"Negotiation\" can have \"Perfect Information\" among the players but have the information distributed among the players, i. e., all players start with \"Imperfect Information\" but can gain \"Perfect Information\" through actions or negotiation. \"Bridge\" and \"Cluedo\" are examples."
        ],
        "consequences": [
            "\"Perfect Information\" about game elements, rules, evaluation functions, and other components makes it easier to have \"Predictable Consequences\" for the players. If players have \"Perfect Information\" about the entire game state---especially about \"Predefined Goals\" ---this can promote \"Stimulated Planning\" but may also result in \"Analysis Paralysis\", especially if the game does not include \"Randomness\", \"Negotiation\", or the possibility of \"Dynamic Alliances\". \"Perfect Information\" about the game state may also make it obvious to the players what the possible outcomes are, making an illusion of a \"Perceived Chance to Succeed\" impossible.",
            "When \"Perfect Information\" is used to give the players a good overview of the game state, it is easier to deduce or guess the other players' goals and tactics. \"Outcome Indicators\" are sometimes used to give the players \"Perfect Information\" about changes in the game state. If players in this situation have \"Interferable Goals\", it is easier for the other players to try to ruin the chances of succeeding with the goal by completing \"Preventing Goals\", thereby increasing the possibility of \"Conflict\" in the game."
        ]
    },
    "relations": {
        "instantiates": [
            "direct-information",
            "predictable-consequences",
            "stimulated-planning",
            "symmetric-information",
            "preventing-goals"
        ],
        "modulates": [
            "strategic-knowledge",
            "gain-information",
            "memorizing",
            "symmetric-information",
            "asymmetric-information",
            "analysis-paralysis",
            "public-information",
            "game-state-overview",
            "right-level-of-complexity",
            "outcome-indicators",
            "predefined-goals"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": [
            "indirect-information",
            "red-herrings",
            "uncertainty-of-information",
            "asymmetric-information",
            "gain-information",
            "randomness",
            "tension",
            "perceived-chance-to-succeed"
        ]
    }
}