{
    "name": "Persistent Game Worlds",
    "texts": {
        "definition": "The storage of the game state of a single game instance in Persistent Game Worlds is independent from the players' game and play sessions.",
        "description": [
            "[Persistent Game Worlds](persistent-game-worlds) have game elements that stay in the world even though players start and finish their game sessions. The life time of a game instance is usually counted in months or even decades."
        ],
        "examples": [
            "all MMORPGs have complex and dynamic [Persistent Game Worlds](persistent-game-worlds) where the players' game sessions with a single character can last for years and the life time of a game instance is determined by how popular the game is. These [Persistent Game Worlds](persistent-game-worlds) can even survive different software generations.",
            "the game worlds in tabletop roleplaying games can survive changes in the player composition, even when the game master has been changed."
        ],
        "usage": [
            "[Persistent Game Worlds](persistent-game-worlds) almost always rely on [Dedicated Game Facilitators](dedicated-game-facilitators) to maintain the game state independently of the players, although in some cases, especially in tabletop and live-action roleplaying games, this task might be shared between the [Game Master](game-masters) and the players.",
            "The game elements of [Persistent Game Worlds](persistent-game-worlds) can have a long life time enhancing the sense of [Ownership](ownership). Many current MMORPGs have recognized this fact and afford players the opportunity to own and modify even buildings and areas in the game. The sense of [Ownership](ownership) is heightened even more by allowing the players to personalize their own items, [Avatars](avatars), and locations in the game thus giving them [Creative Control](creative-control) over their personal game elements. Even permitting players choose their own [Handles](handles) in the game increases the player commitment. More complex [Construction](construction) activities can lead to [Player Constructed Worlds](player-constructed-worlds), which is one of the strongest features of text-based MUDs.",
            "One way to achieve [Identification](identification) and the sense of [Ownership](ownership) is to provide the players with [Characters](characters) represented by [Avatars](avatars) and base the gameplay on [Character Development](character-development). The effort the players put into developing their [Characters](characters) deepens the [Identification](identification) and the sense of [Ownership](ownership). The [Characters](characters) can, in the end, feel more like a part of the players' personality than just game elements.",
            "The persistent nature of game elements that are shared by many players makes it almost impossible to have [Reversability](reversability) within players' game and play sessions, which usually do not even overlap, making the game an [Asynchronous Game](asynchronous-games)."
        ],
        "consequences": [
            "[Persistent Game Worlds](persistent-game-worlds) by their definition give rise to [Multiplayer Games](multiplayer-games) where several, sometimes even thousands, of players share the same [Game World](game-world), which itself has an existence  independent of the players themselves. The high level of [Social Interaction](social-interaction) that occurs in these games can over time give rise to both [Social Statuses](social-statuses) among the players and [Social Organizations](social-organizations) given some support through the game design.",
            "These games offer players the possibility to enter another world, and when these shared fantasies are constructed with care the [Emotional Immersion](emotional-immersion) and commitment from the players can be significant. Tabletop roleplaying games create these shared fantasies through [Storytelling](storytelling) by the players and the [Game Masters](game-masters). The games usually have loose [Narrative Structures](narrative-structures) with no definite ends, making the tales told by the players and to the players [Never Ending Stories.](never-ending-stories) This kind of [Storytelling](storytelling) is usually based on the players doing [Roleplaying](roleplaying) with their [Characters](characters). As much of the [Storytelling](storytelling) does not have an immediate effect on the state of the [Game Worlds](game-world), these worlds typically generate significant [Extra-Game Actions](extra-game-actions) and [Extra-Game Consequences](extra-game-consequences)."
        ]
    },
    "relations": {
        "instantiates": [
            "emotional-immersion",
            "multiplayer-games",
            "social-interaction"
        ],
        "modulates": [
            "social-statuses",
            "identification",
            "characters",
            "player-constructed-worlds",
            "social-organizations"
        ],
        "instantiated_by": [
            "dedicated-game-facilitators",
            "game-masters"
        ],
        "modulated_by": [
            "avatars",
            "character-development",
            "construction",
            "never-ending-stories",
            "narrative-structures",
            "creative-control",
            "storytelling",
            "asynchronous-games",
            "handles",
            "ownership",
            "roleplaying"
        ],
        "conflicts": [
            "reversability"
        ]
    }
}