{
    "name": "Player Killing",
    "texts": {
        "definition": "Allows players to intentionally or unintentionally remove players from the game for at least some time.",
        "description": [
            "Games in which the players control only one [Avatar](avatars) each make the death of these very influential for players' experiences and success in the game. As players easily identify with their [Avatars](avatars), killing them is usually referred to as [Player Killing](player-killing) even though it is actually [Avatar](avatars) killing."
        ],
        "examples": [
            "Early \"Ultima Online\" was notorious for more experienced players killing other players' characters for looting their items or just for fun. The players who were killed lost the items they were carrying unless they were able to come back to the spot before the player killers looted them.",
            "Deathmatch first-person shooters, such as \"Quake III\", have [Player Killing](player-killing) as one of the main goals for the game. The more other players the player manages to take out, the more points or frags he is rewarded. The players who are killed usually lose their gained special items and abilities and are transferred back to a spawn point."
        ],
        "usage": [
            "Having or not having [Player Killing](player-killing) is always an explicit design choice. [Player Killing](player-killing) is, in effect, [Player Elimination](player-elimination) with the [Spawning](spawning) of the players' [Avatars](avatars) allowed. Designing [Player Killing](player-killing) in the game obviously involves deciding the details of [Spawning](spawning) and [Penalties](penalties) involved for being killed. Usually they are mainly [Individual Penalties](individual-penalties) even in games with [Team Play](team-play), and players receive [Decreased Abilities](decreased-abilities), [Ability Losses](ability-losses), and they might lose [Ownership](ownership) of [Tools](tools) and other items they possess at the time of killing. Other possibilities include forced [Downtime](downtime) or limitations to the number of times a player can respawn due to the use of [Lives](lives).",
            "[Player Killing](player-killing) can be used as a method of keeping [Score](score) in both games with [Team Play](team-play), as in games with [Team Elimination](team-elimination), and without [Team Play](team-play). Games with [Team Play](team-play) sometimes allow the players to [Eliminate](eliminate) their team members, and this can be called unintentional [Player Killing](player-killing). On the other hand, some team-oriented games break [Consistent Reality Logic](consistent-reality-logic) by not having the possibility of [Player Killing](player-killing) within the same team in order to avoid internal fighting and possibilities for saboteurs."
        ],
        "consequences": [
            "[Player Killing](player-killing) naturally has an effect on [Tension](tension) involved, depending on the actual [Penalties](penalties) and [Rewards](rewards) for [Player Killing](player-killing). The [Tension](tension) involved is usually not as drastic as in games with [Player Elimination](player-elimination) without [Spawning](spawning) but is modulated in both cases by how much [Identification](identification) the player has with the controlled [Avatar](avatars). As the early versions of \"Ultima Online\" demonstrated, if the players are rewarded for [Player Killing](player-killing), that is what is going to happen no matter what the social rules of conduct are within the game itself. More recent MMORPGs have solved the [Player Killing](player-killing) problem either by removing the possibility of [Player Killing](player-killing), having special places in the [Game World](game-world) where [Player Killing](player-killing) is allowed, or designing [Penalties](penalties) also for player killers, for example, by changing their explicit [Social Status](social-statuses) to outlaws and not allowing them to enter cities. Depending on the solution, [Player Killing](player-killing) can significantly modify [Risk/Reward](risk-reward) choices for both attackers and potential victims."
        ]
    },
    "relations": {
        "instantiates": [
            "downtime",
            "team-elimination"
        ],
        "modulates": [
            "team-play",
            "player-elimination",
            "tension",
            "team-balance",
            "ownership"
        ],
        "instantiated_by": [
            "lives"
        ],
        "modulated_by": [
            "social-statuses",
            "avatars",
            "penalties",
            "decreased-abilities",
            "identification",
            "rewards",
            "ability-losses",
            "risk-reward",
            "spawning"
        ],
        "conflicts": []
    }
}