{
    "name": "Predefined Goals",
    "texts": {
        "definition": "Predefined Goals are preset by the game designer, usually arranged in a rigid hierarchy, which can only be adaptable by players' choices or interpretations if the design allows it.",
        "description": [
            "To make goals unambiguous, [Predefined Goals](predefined-goals) are described using the components of the game and have [Rewards](rewards) described and implemented through the game system. All winnable games, i. e., games where there exists a game state that defines one or several winners, have the predefined primary goal that can be stated as: win the game. This is so common that the existence of such a goal is sometimes used to define what a game is, but examples such as the \"Sims\", \"Tetris\", and \"Pac-Man\" show the existence of games that at least question if these definitions are inclusive of all games."
        ],
        "examples": [
            "\"Chess\" has the [Predefined Goals](predefined-goals) for each player to checkmate the other player's king.",
            "\"Monopoly\" has the [Predefined Goal](predefined-goals) of eliminating all other players by driving them into bankruptcy."
        ],
        "usage": [
            "[Predefined Goals](predefined-goals) require that explicit boundaries be set by the game design to what game states are considered successes and how players can reach those game states. However, within these boundaries the player can have some freedom, which can be instantiated by a \"Selectable Set of Goals\" or by not specifically defining what actions need to be performed to achieve the main goals, nor in which order the actions need to be performed. This is the case in [Planned Character Development](planned-character-development) where players must be able to have some [Predefined Goals](predefined-goals) to be able to plan but at the same time need some freedom for the plans to be theirs and not the game designers.",
            "Although goals may be predefined, the information about what goals exist (the first time a game is played) or what goals players (which might include oneself) are trying to achieve may be unknown. The combination of [Predefined Goals](predefined-goals) with [Perfect Information](perfect-information) and [Symmetric Information](symmetric-information) allows players to form more complex strategies allowing [Strategic Knowledge](strategic-knowledge) to be developed, especially in the situation where subgoals are also known to the players. However, this may lead to the [Analysis Paralysis](analysis-paralysis) situation if the game allows too complex strategies to emerge.",
            "The use of [Asymmetric Information](asymmetric-information) with [Predefined Goals](predefined-goals) leads to situations where players try to guess or otherwise get information about the other players' goals in order to formulate their own strategies. The way the goal information is obtained can, of course, vary from game to game, especially if the game allows [Social Interaction](social-interaction) between players."
        ],
        "consequences": [
            "[Predefined Goals](predefined-goals) are a powerful way for game designers to direct players' intentions, both for promoting certain forms of activities of the players and for setting up basic relationships between the players. As such, [Predefined Goals](predefined-goals) are common in all games to ensure that all players have a common understanding of the motivations for actions in the game. The simplest case, using \"Perfect\" \"Information\" and [Symmetric Information](symmetric-information), can be found in almost all traditional board games. As players can learn the strategies for completing [Predefined Goals](predefined-goals) by playing the game repeatedly, the forms of goals support the development of [Game Mastery](game-mastery). [Predefined Goals](predefined-goals) are by their nature incompatible with [Ephemeral Goals](ephemeral-goals).",
            "Although [Predefined Goals](predefined-goals) may be [Unknown Goals](unknown-goals) the first time a game is played, they will not be so in following game instances, making the patterns difficult to combine in games that aim to have [Replayability](replayability).",
            "The direction of action that [Predefined Goals](predefined-goals) support can, however, limit players' [Freedom of Choice](freedomof-choice), especially if applied to lower level goals or goals that are easy to complete. Imagine a point-based variant of \"Chess\" where checkmate gives 20 points; capturing a rook, knight, or other second row piece gives 5 points; and capturing a pawn gives 1 point but only before any second row pieces have been taken. Although game sessions of this variant would be contained within what is possible in a normal \"Chess\" game, these games would probably more often contain captures exchanged and would discourage crowded checkmate situations, which would limit the strategies and tactics normally used in \"Chess\". Therefore, \"Chess\" and other games without many [Closure Points](closure-points) usually do not have many [Predefined Goals](predefined-goals) either. Typically, only the main goals are predefined, while players can choose the low-level goals themselves from a \"Selectable Set of Goals\" whose rewards are not explicitly linked to the main goal."
        ]
    },
    "relations": {
        "instantiates": [
            "hierarchyof-goals",
            "strategic-knowledge",
            "selectable-setsof-goals",
            "game-mastery",
            "analysis-paralysis"
        ],
        "modulates": [
            "planned-character-development"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "perfect-information",
            "imperfect-information",
            "asymmetric-information",
            "symmetric-information"
        ],
        "conflicts": [
            "ephemeral-goals",
            "unknown-goals"
        ]
    }
}