{
    "name": "Producers",
    "texts": {
        "definition": "A game element, usually some kind of a resource, is produced as a consequence of a player action, certain game element configuration, or other type of game event.",
        "description": [
            "The productions of game elements can be tied to many types of changes in the game state but are usually linked to a producing game element, the \"Producer\". The most common ways to trigger production are when players perform specific actions, players achieve closures, or simply because a certain amount of game time has passed. The \"Producer\" is mainly concerned about the production of the game elements during the gameplay, but it can be argued, for example, that the pieces in \"Chess\" are produced in their starting positions, and sometimes this level of analysis can be fruitful."
        ],
        "examples": [
            "the pills in a \"Pac-Man\" level are produced when the game starts and when the Pac-Man has finished the previous level by eating all of the pills.",
            "the blocks in \"Tetris\" are produced at the top of the screen when the previous block has been placed.",
            "the cities in \"Civilization\" can produce different kinds of units according to the player's choices. The production rate, that is, how much game time it takes to produce a unit, and the units available, depend on several factors such as the location and size of the city and how far the player has progressed in the game.",
            "in fantasy roleplaying games hit points are regained, i. e. produced, by resting, taking health potions, and using healing spells."
        ],
        "usage": [
            "\"Producers\" can be thought of as the mechanisms that bring game elements to the game, usually to a \"Game World\". Even the case of setting up the game elements in their starting positions follows the same basic principles than govern \"Producers\" which are active during gameplay. The design questions that have to be answered when designing \"Producers\" are: What game elements or resources are produced? What are the requirements for producing the game elements or triggering the production? Where are the game elements produced? What kind of indication is given to the players about the produced elements?",
            "There are two basic types of \"Producers\": those that produce \"Resources\", which are at least potentially available to the players, and those that produce game elements, usually some kind of \"Enemies\" or \"Obstacles\", that are not immediately valuable to the players as \"Resources\". The production of \"Units\" is a variant of produced \"Resources\" and usually directly available to the players controlling the \"Producer\" while \"Power-Ups\" are available to whoever first locates them. The production of the players' \"Avatars\" at \"Spawn Points\", as part of \"Spawning\" events are examples of when the players' main \"Focus Loci\" are produced.",
            "Changing the basic \"Resource\" production is one of the most direct ways to affect the flow of the gameplay as basic \"Resources\" often dictate what actions and possibilities are available to the players. The production of other types of game elements than \"Resources\" is very often tied to providing different levels of challenges to the player and this, of course, is another level of changing the flow of the game. For example, the amount of monsters produced in generators in \"Gauntlet\" has quite an impact on the overall game play and the same applies to the amount of health \"Power-Ups\" available.",
            "The ability to produce can be given to \"Character\" as \"Privileged Abilities\" or can, in games with \"Game Worlds\", be tied to specific locations such as \"Resource Generators\" and \"Resource Locations\". Tying \"Producers\" to locations make these into \"Strategic Locations\" and give rise to \"Area Control\" goals. One special case is a \"Producer\" that produces other \"Producers\". For example, the cities in \"Civilization\" can produce settler \"Units\", which can then be used to create new cities to produce new units.",
            "The \"Producer\" can, in essence, also be a \"Resource\" to the player. For example, the cities in \"Civilization\" are \"Producers\", and they are also the main \"Resources\" to the player, as they can be under player \"Ownership\" and they dictate the choices available to the players. This kind of \"Producers\" is not necessarily directly under the players' immediate control, meaning that the players cannot change aspects of the production, such as the production rate or what is produced in the \"Producer\", even though they can own the \"Producer\". The most complex case of a \"Producer\" from the players' point of view is one where players can control both the aspect of selecting which \"Resources\" are to be produced and modulating the production rate.",
            "The \"Producer\", however, does not require a \"Game World\" to be instantiated. The \"Drawing Stack\" familiar from many card games, is an example of a \"Producer\" that functions without a \"Game World\". Even in games with a \"Game World\" there are usually \"Resources\" that are not elements in the \"Game World\" and can be governed by a \"Producer\" outside the \"Game World\".",
            "The \"Producer\" always has some requirements before it can produce game elements. The most concrete requirement is a simple player action. For example, in \"Go\" the player gets a stone when the other player has finished his turn. The production, however, does not need to be immediate to the action. This delayed production is perhaps one of the most characteristic features of the \"Producers\" found in \"Resource Management\" games. In these games the \"Producer\" is often also a \"Converter\" requiring other \"Resources\" to function properly. This makes the act of producing into \"Extended Actions\". The \"Producer\" can, of course, still be delayed without requiring player actions, as is the case in the monster generators in \"Gauntlet\". The amount of delay in all these cases determines the production rate of the \"Producer\" and this is one of the main variables to govern the flow of the game."
        ],
        "consequences": [
            "\"Producers\" are integral parts of the \"Producer-Consumer\" pattern governing the resource flows of the game by providing \"Renewable Resources\", and are usually tightly related to the \"Consumer\" s. When put under the control of players, \"Producers\" give \"Empowerment\" through the \"Construction\" actions they allow, and they may cause \"Stimulated Planning\" regarding \"Tradeoffs\" between different possibilities of production.",
            "\"Producers\" are very common and, although abstract as a pattern, have concrete effects on the flow of the game play. It can even be argued that in some level of analysis every game element has a \"Producer\". For example, in \"Go\" a \"Producer\" governs how the players can get control of the stones from the stockpile. The official rules state that one stone is \"produced\" for the player during the turn. When analyzing the \"Producer\" in \"Go\" in this level it becomes obvious what the game play effect would be if, for example, two stones were produced every turn, if the player could store stones in a \"Container\" between the turns and so forth. Another example of changing the flow of the game can be found in \"Chess\" variants where there is a possibility to bring captured pieces back to the board. Thus, tweaking existing, and especially adding new types of \"Producers\", can change the game radically."
        ]
    },
    "relations": {
        "instantiates": [
            "stimulated-planning",
            "tradeoffs",
            "construction",
            "producer-consumer",
            "privileged-abilities",
            "empowerment",
            "renewable-resources"
        ],
        "modulates": [
            "avatars",
            "resource-management",
            "units",
            "tradeoffs",
            "construction",
            "area-control",
            "resources",
            "game-world",
            "power-ups",
            "ownership",
            "characters"
        ],
        "instantiated_by": [
            "spawn-points",
            "spawning"
        ],
        "modulated_by": [
            "extended-actions"
        ],
        "conflicts": []
    }
}