{
    "name": "Red Herrings",
    "texts": {
        "definition": "Information or potential goals that are designed to either mislead or distract the player",
        "description": [
            "[Red Herrings](red-herrings) can be deliberately designed into the game to provide alternative gameplay paths as distractions to the players. Some games, especially strategy games, also give players themselves the possibility to create [Red Herrings](red-herrings) as decoys in order to distract or deceive other players. In these cases [Red Herrings](red-herrings) are used as parts of players' tactics and strategies."
        ],
        "examples": [
            "the player in \"Medieval: Total War\" can set up some of the units as decoys in order to lure other players' units into positions where they are vulnerable to surprise attacks. One common tactic is to hide the archers and cavalry on hills covered by trees and use peasant units to lure the opposing cavalry to charge into a position where archers can volley them down while the player's own cavalry charges downhill to outflank the enemy units.",
            "adventure and roleplaying, especially those with mystery elements, use [Red Herrings](red-herrings) to give players false clues to make progress more difficult and at the same time more interesting.",
            "random wandering monsters in many roleplaying games can distract and in some cases also mislead players."
        ],
        "usage": [
            "Games with [Narrative Structures](narrative-structures) often use [Red Herrings](red-herrings) to raise the uncertainty of the progression of the narrative and also to create [Surprises](surprises). [Clues](clues), [Traces](traces), and especially [Helpers](helpers) can be used as [Red Herrings](red-herrings) in a game to mislead players. The use of [Helpers](helpers) is one way to provide misleading [Indirect Information](indirect-information) to players. The other way, naturally, is to let the other players provide [Red Herrings](red-herrings) in the game. These can be in the form of decoys to help [Conceal](conceal) goals, but can also be [Indirect Information](indirect-information) provided during [Social Interaction](social-interaction). For [Red Herrings](red-herrings) to work properly almost always require [Imperfect Information](imperfect-information) or [Fog of War](fogof-war). It is possible, however, to use decoys as [Red Herrings](red-herrings) in games of total [Perfect Information](perfect-information) to give false impressions to other players about a player's true intentions in the game. The same applies to the use of [Direct Information](direct-information): perhaps the only possible way to use it with [Red Herrings](red-herrings) is to have decoys."
        ],
        "consequences": [
            "The use of [Red Herrings](red-herrings) gives the players more potential outcomes and more things to consider while playing the game. This modulation of [Anticipation](anticipation) can lead to increased [Tension](tension) as players are more uncertain about the possible outcomes and, in some cases, can be used to promote [Varied Gameplay](varied-gameplay) even at the cost of [Disruption of Focused Attention](disruptionof-focused-attention). Careless use of [Red Herrings](red-herrings), however, can cause problems with the [Right Level of Complexity](right-levelof-complexity) and might lead to player frustration and to the feeling of loss of control. [Red Herrings](red-herrings) in some cases can also be used to provide [Right Level of Complexity](right-levelof-complexity) if the gameplay would otherwise be too straightforward.",
            "[Red Herrings](red-herrings) are potentially conflicting with [Supporting Goals](supporting-goals) in the sense that what to players may seem to be a [Supporting Goal](supporting-goals) can turn out to be a [Red Herring](red-herrings)."
        ]
    },
    "relations": {
        "instantiates": [
            "indirect-information",
            "disruptionof-focused-attention"
        ],
        "modulates": [
            "surprises",
            "anticipation",
            "right-levelof-complexity",
            "narrative-structures",
            "varied-gameplay",
            "tension",
            "conceal"
        ],
        "instantiated_by": [
            "fogof-war",
            "imperfect-information"
        ],
        "modulated_by": [
            "traces",
            "clues",
            "helpers"
        ],
        "conflicts": [
            "direct-information",
            "perfect-information",
            "clues",
            "traces",
            "helpers",
            "supporting-goals"
        ]
    }
}