{
    "name": "Rescue",
    "texts": {
        "definition": "Rescue is the goal of freeing someone or something that is guarded.",
        "description": [
            "A common plot in games is that an opponent has captured or imprisoned a character that players' characters know or care about. This gives the players a [Rescue](rescue) goal, which may consist of finding the location of the kidnapped character as well as \"Overcoming\" or avoiding the obstacles and enemies on the way there. Games using [Rescue](rescue) as the main goal often have the opponent as the final enemy that has to be defeated before completing the goal."
        ],
        "examples": [
            "\"Donkey Kong\" has as an over-arching goal for Marioto [Rescue](rescue) the girl that has been kidnapped by the gorilla with the same name as the game.",
            "Some missions in \"Counter-Strike\" involve scientists that the terrorists have to [Guard](guard) and the counter-terrorist \"Team\" tries to free and lead to a safe zone."
        ],
        "usage": [
            "A [Rescue](rescue) goal can be designed as either explicit goals to [Overcome](overcome) some [Guards](guard) or to use [Stealth](stealth) to avoid being detected, or a combination of both, possibly allowing players the [Freedom of Choice](freedomof-choice) between the two. In the latter case, [Rescue](rescue) goals provide the possibility of several subgoals: [Stealth](stealth) goals to enter areas without detection and [Gain Information](gain-information) goals to learn the layout and positions of [Guards](guard), [Alarms](alarms), and [Deadly Traps](deadly-traps). Games using [Rescue](rescue) as the main goal often have the character responsible for the kidnapping as a [Boss Monster](boss-monsters) that has to be defeated before completing the goal.",
            "[Rescue](rescue) s can be constructed so that they are completed as soon as the [Guards](guard) and [Obstacles](obstacles) are [Overcome](overcome) but may also be constructed so that the rescued people have to be moved into a safe area, i. e., places in the [Game World](game-world) that are both [Goal Points](goal-points) and [Safe Havens](safe-havens). The latter ones allow for opposing [Capture](capture) goals and provides gameplay where the goals may change several times before reaching a final conclusion."
        ],
        "consequences": [
            "As a [Rescue](rescue) goal is defined by overcoming a [Guard](guard) goal, it is a [Preventing Goal](preventing-goals) and automatically creates [Conflict](conflict). Although the goal object of a [Rescue](rescue) may be a [Character](characters) or [Unit](units), possibly controlled by another player, the structure of [Rescue](rescue) goals are often struggles over [Ownership](ownership). [Rescue](rescue) goals are often used to provide a [Narrative Structure](narrative-structures) in a game; the person to be rescued can have vital information or be someone that is loved by the player's character."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "preventing-goals"
        ],
        "modulates": [
            "guard",
            "narrative-structures"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "goal-points",
            "safe-havens",
            "overcome",
            "alarms",
            "deadly-traps",
            "obstacles",
            "boss-monsters",
            "stealth",
            "ownership"
        ],
        "conflicts": []
    }
}