{
    "name": "Resource Locations",
    "texts": {
        "definition": "Resource Locations are the locations where resources are found in the game world.",
        "description": [
            "Nearly all games with a game world use \"Resource Locations\" in one form or another. These are locations that are known to have resources, although this may vary over gameplay as resources are used or new resources appear."
        ],
        "examples": [
            "all the places where the pills are located in \"Pac-Man\" levels. The more special \"Resource Locations\" are where the power pills are placed and also the location where the bonus items appear.",
            "the places where trees, bushes, and mines are located in \"Age of Empires\" are \"Resource Locations\" for the basic resources of the game."
        ],
        "usage": [
            "\"Resource Locations\" are required for all \"Resources\" that are not purely abstract. The nature of the \"Resources\", together with the \"Consistent Reality Logic\" of the game, usually limits the possible \"Resource Locations\" for a given \"Resource\". For example, normal burning torches are not found under water nor do ammunition boxes usually lie around in public places.",
            "\"Resources\" that are not represented by game elements can still be collected from \"Resource Locations\", typically represented by \"Chargers\".",
            "\"Resource Locations\" are usually marked by \"Traces\" and \"Outstanding Features\" to help the players identify the exact spot where the \"Resources\" can be found or will appear. The location of the \"Resources\" can be used to guide the players towards certain areas in the game, functioning as \"Traces\", or lure players into \"Deadly Traps\". Similarly, letting players identify \"Resource Locations\" within \"Inaccessible Areas\" provides them with \"Gain Ownership\" goals.",
            "For \"Resources\" that are introduced during the gameplay, i. e. \"Renewable Resources\", the \"Resource Location\" can either be determined by \"Randomness\" (or \"Randomness\" can be used to select one of several \"Resource Locations\"), or by placing them in such way that they have a \"Balancing Effect\". \"Controllers\" define more permanent \"Resource Locations\", since they very seldom can be moved, although they may be destroyed."
        ],
        "consequences": [
            "\"Resource Locations\" typically are \"Strategic Locations\", their value depending on the value of the resource and the ease with which the location can be reached. By placing some \"Resource Locations\" at places difficult to get to and some at places easy to get to, it is possible to steer the unfolding of the gameplay."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-locations"
        ],
        "modulates": [
            "inaccessible-areas",
            "gain-ownership"
        ],
        "instantiated_by": [
            "pick-ups",
            "chargers",
            "controllers"
        ],
        "modulated_by": [
            "outstanding-features",
            "traces"
        ],
        "conflicts": []
    }
}