{
    "name": "Role Reversal",
    "texts": {
        "definition": "The shift between two different roles which are each others opposite.",
        "description": [
            "Many games force players to change game play radically after completing certain goals or after certain events have taken place in the game world. When the change makes the players' roles, at some level, change with their opponents this is called \"Role Reversal\"."
        ],
        "examples": [
            "\"Hide &amp; Seek\" can be seen as having two distinct modes of play for each of the activities of hiding and seeking. In this case, one is only allowed to hide oneself once, before the seek phase begins, but games can allow hiding continuously or when certain events take place, e. g. re-hiding a game element after it has been found.",
            "when \"Pac-Man\" eats a power-pill he can start chasing the ghosts without risk, in effect causing a role reversal between the hunter and the hunted."
        ],
        "usage": [
            "Designing the potential for \"Role Reversal\" events consists of defining a goal with \"Dynamic Goal Characteristics\" that uses a game event to switch between two or more \"Asymmetric Goals\" sets. The main goal can be constructed so that it can be achieved in all roles, e. g. by being able to gain \"Score\" points at all times but through different means, or that only one of the role can complete the goal and that the other roles are a form of \"Penalty\".",
            "The switch event is usually another goal which is beneficial, or perceived as being beneficial, to the player who has it. If players have the knowledge that the fulfillment of the goal causes the \"Role Reversal\", they may be able to make \"Risk/Reward\" choices that set them in a disadvantageous situation before the reversal but at an advantageous situation after. An example of this would be to let as many ghosts as possible get close to \"Pac-Man\" before eating a power-pill.",
            "The \"Asymmetric Goals\" sets can be constructed by choosing a goal for one of the sets and then creating a \"Preventing Goal\" from that goal and adding the new goal to another set. For example, \"Capture\" can be a goal for one set and \"Evade\" be the \"Preventing Goal\" that is added to the other set. Constructing the sets without \"Preventing Goals\" is possible but risks not making the change between the roles perceived as a reversal. If possible, having both goals as subgoals or \"Supporting Goals\" of the main goal links the roles tighter to the main goal.",
            "The \"King of the Hill\" goal is example of a goal built around \"Role Reversal\". The main goal in this case is usually achieved by increase in a player's \"Score\" as long as that player is fulfilling a \"Continuous Goal\", typically \"Gain Ownership\" of a location. However, this goal is an \"Interferable Goal\" and the interruption by another player is the switching event that creates the \"Role Reversal\".",
            "Games with \"Dynamic Alliances\", especially when \"Betrayal\" is possible, automatically give rise to \"Role Reversal\" events each time a player joins or leaves the alliances as the goals of the alliance is typically the reverse of those not part of the alliance. \"Turn-Based Games\" where players can interfere through certain actions in other players' turns can be seen as having \"Role Reversal\" from being the acting player to being the interfering player."
        ],
        "consequences": [
            "\"Role Reversal\" events are significant changes in gameplay where players usually receive \"New Abilities\" and have \"Ability Losses\". When this gives players powers beyond those of other players, the \"Role Reversal\" provides \"Empowerment\" and can affect \"Player Balance\". The reversals give \"Varied Gameplay\" since players get to perform different actions and have different goals for each role. If the \"Role Reversals\" can occur several times or automatically change back the pattern supports \"Reversability\" in the game, and can be the source of \"Conflict\" if several players can initiate the change of roles.",
            "When used as parts of \"Narrative Structures\", \"Role Reversal\" gives the narrative the \"Right Level of Complexity\" and can provide \"Surprises\", especially when combined with \"Betrayal\"."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "surprises",
            "penalties",
            "dynamic-goal-characteristics",
            "asymmetric-goals",
            "reversability",
            "risk-reward",
            "new-abilities",
            "ability-losses"
        ],
        "modulates": [
            "player-balance",
            "empowerment",
            "narrative-structures",
            "right-level-of-complexity"
        ],
        "instantiated_by": [
            "turn-based-games",
            "dynamic-alliances",
            "king-of-the-hill",
            "betrayal"
        ],
        "modulated_by": [
            "score"
        ],
        "conflicts": []
    }
}