{
    "name": "Save Points",
    "texts": {
        "definition": "Save Points are the points in gameplay where the players can choose to save the game state so that they can return to it later.",
        "description": [
            "\"Save Points\" do not need to be physical places as a game may only provide players with the option to save game position between levels, i. e. in pauses in gameplay. \"Save Points\" have typically been most common in games for consoles as the storage capacity for the consoles has been more limited than in personal computers."
        ],
        "examples": [
            "\"Final Fantasy VII\" has specific locations where the player can save the current game state."
        ],
        "usage": [
            "\"Save Points\" are the locations in games where players can save the game, and they thereby control how players can perform \"Save-Load Cycles\". The \"Save Points\" can be used to achieve the \"Right Level of Difficulty\". For example, if a more difficult game is required, place \"Save Points\" in such way that it demands the players to complete a \"Hierarchy of goals\" or a long sequence of actions before saving. This spreading out of the available \"Save Points\" can increase the \"Tension\" as the players have larger investments in time and effort before reaching a \"Save Point\" and, in some cases, can also frustrate the player if the difficulty level for reaching a \"Save Point\" is too high. Locating the \"Save Points\" in the \"Game World\" automatically creates \"Traverse\" goals.",
            "Older computer games used a form of \"Save Points\" where level codes were given to the player after completing a \"Level\" so that one did not have to replay those \"Levels\" in later game sessions. However, this did not allow the players to maintain any other information about the previous game sessions, thereby making the use of \"Score\" more difficult."
        ],
        "consequences": [
            "\"Save Points\" are nearly always \"Safe Havens\", i. e. once the \"Save Points\" have been reached the player does not have to face any immediate threats and can relax. Even if they are not explicitly created as \"Safe Havens\", they at least allow players to save the current game state and let them have infinitely many tries to continue playing from that location. Depending on how savingis done, \"Save Points\" can be \"Closure Points\"."
        ]
    },
    "relations": {
        "instantiates": [
            "traverse",
            "closure-points"
        ],
        "modulates": [
            "collection",
            "levels",
            "save-load-cycles"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "hierarchy-of-goals",
            "safe-havens"
        ],
        "conflicts": [
            "score"
        ]
    }
}