{
    "name": "Secret Resources",
    "texts": {
        "definition": "Secret Resources are resources that are unknown to at least some of the players.",
        "description": [
            "There are two basic types of \"Secret Resources\" in games. The first type governs what kind of information about the resources is available to one of the players and the second type governs situations where different players have different information available about the resources."
        ],
        "examples": [
            "in many strategy games the resource locations, such as cities, mines and factories, are initially unknown to the player. The player is required to do exploration or scouting to get more information about the possible resources in the game. The player may also first have vague indications of the available resources.",
            "almost all card games have \"Secret Resources\", the card hand, which is known to the player owning the cards but unknown to the other players. \"Poker\" is perhaps the most famous card game where the game play is based on the asymmetries of information available about the resources of the other player."
        ],
        "usage": [
            "\"Secret Resources\" is essentially the outcome of the use of \"Imperfect Information\",\"Uncertainty of Information\", or \"Asymmetric Information\" patterns on \"Resources\". \"Imperfect Information\" used on \"Resources\" governs the information available to one of the players in such way, that some of the \"Resources\" available in the game are initially or currently unknown to the player. \"Uncertainty of Information\" means that the player may have unreliable information about the available \"Resources\". For example, the exact position and strength of the players \"Units\" in strategy games may be unknown. \"Asymmetric Information\" states that players have different information available about the available \"Resources\". A concrete example of this is \"Card Hand\" s, where the player owning a hand knows the cards, but they are unknown to the other players."
        ],
        "consequences": [
            "Dealing with secrets, the more general consequences of \"Imperfect Information\" and \"Asymmetric Information\" patterns also apply to \"Secret Resources\". As \"Resources\" determine the actions and strategies available to the player, \"Secret Resources\" have a direct impact on the players' ability to plan ahead, thus giving rise to \"Limited Planning Ability\". The wish to know what resources exist in games, and how they are distributed, give rise to \"Gain Information\" goals such as \"Reconnaissance\" or \"Exploration\" when \"Secret Resources\" are placed in a \"Game World\" (but \"Secret Resources\" can also be used to modulate already existing \"Reconnaissance\" goals)\".\" When one player has knowledge about \"Secret\" \"Resources\", for example by controlling them, and the other players do not, this gives that player opportunities to have secret tactics."
        ]
    },
    "relations": {
        "instantiates": [
            "exploration",
            "gain-information",
            "limited-planning-ability"
        ],
        "modulates": [
            "resources",
            "game-world",
            "reconnaissance"
        ],
        "instantiated_by": [
            "card-hands",
            "imperfect-information",
            "asymmetric-information",
            "uncertainty-of-information"
        ],
        "modulated_by": [
            "reconnaissance"
        ],
        "conflicts": []
    }
}