{
    "name": "Secret Alliances",
    "texts": {
        "definition": "Alliances, or the special characteristics of alliances, which by definition are unknown to at least some of the players.",
        "description": [
            "The existence and exact characteristics of different Alliances in a game are very clear to all participants in team based sports, of course, but there are games where the game play is more or less based on the uncovering of Secret Alliances between the players. These games are usually characterized by having social intrigue, backstabbing, sinister plots, and, at least in some cases, the whole game play seems to consist of players just talking to other players in order to gain more information about the exact social and power relationships in the game."
        ],
        "examples": [
            "in \"Diplomacy\" the alliances are not necessarily, or even usually, declared to player outside the alliance. This leads to the situation that the information about the different \"Alliances\" within the game is a valuable resource in itself.",
            "one of the most entertaining examples of use of \"Secret Alliances\" in games is \"Paranoia\", a roleplaying game set in a distant Orwellian future controlled by a gigantic computer. The players in \"Paranoia\" are troubleshooters, whose task is to help the computer to uncover the sinister plans of mutants and different secret societies. Each of the players, of course, is also a mutant and belongs to at least one secret society."
        ],
        "usage": [
            "Basically, \"Secret Alliances\" means that information patterns are applied to the information about the characteristics of the \"Alliances\" in the game. The main points to consider are how the information about the existence of the \"Alliance\" is indicated, what information is available about the rules of conduct and agenda of the \"Alliance\" and finally, what players make up the \"Alliance\". In the case of \"Dynamic Alliances\" decisions have to be made about how the information about the changes in the \"Alliance\" is available or indicated to the players. Typically \"Secret Alliances\" are based upon agreements such as: how to divide \"Player Decided Results\"; how to act in \"Player-Decided Distribution of Rewards &amp; Penalties\"; how to use \"Secret Resources\"; or how to work towards common goals which are \"Unknown Goals\" to players outside the \"Alliance\".",
            "The most common version of \"Secret Alliances\" is when only the members of the \"Alliance\" have exact information about it. This means that the player composition of the \"Alliance\" is not likely to change, unless in the case of betrayal or player elimination. In some cases it is also possible that even the members of the \"Alliance\" do not know the exact player composition of the \"Alliance\" as, for example, in different cells (small groups) of terrorist organizations are not (or should not be) aware of the existence of other cells. Anyway, the principles described in especially \"Asymmetric Information\", \"Uncertainty of Information\" and \"Indirect Information\" are valid when dealing with \"Alliances\"."
        ],
        "consequences": [
            "One of the main consequences of having \"Secret Alliances\" in the game is to have another layer of uncertainty and suspicion amongst the players as no-one knows who belongs to which \"Alliance\" or even what \"Alliances\" there are. The most paranoid case is when even the members of the same \"Alliance\" are not aware that they actually are members of the same \"Alliance\". \"Secret Alliances\" with the possibility of \"Indirect Information\", \"Asymmetric Information\" and proper communication channels between the player can lead to very active \"Social Interaction\" in the game as the players try to get information about the alliances in the game from the other players."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "alliances",
            "mutual-goals",
            "social-interaction"
        ],
        "instantiated_by": [
            "player-decided-results",
            "asymmetric-information",
            "uncertainty-of-information",
            "player-decided-distribution-of-rewards-penalties"
        ],
        "modulated_by": [
            "indirect-information"
        ],
        "conflicts": []
    }
}