{
    "name": "Sensory-Motoric Immersion",
    "texts": {
        "definition": "The flow experience of performing repetitious actions, which provide sensory feedback.",
        "description": [
            "The repetition can be of basic actions, such as pressing a button to the rhythm of background music, or more elaborate action sequences as is the case with many fighting games. The actions do not have to require skill from the players even though the immersion is stronger if the required skill level is adequate for the players.",
            "<B>Example:</B> fast paced shoot-em-ups can sometimes cause [Sensory-Motoric Immersion](sensory-motoric-immersion) as the players perform similar actions and action sequences all over again with clear audio-visual feedback.",
            "<B>Example:</B> dance games, such as \"Dance Dance Revolution\", have strong basis for [Sensory-Motoric Immersion](sensory-motoric-immersion) as the basic actions are simple, repetitive, and especially because the action sequences are tied to the rhythm of the background music."
        ],
        "examples": [],
        "usage": [
            "[Sensory-Motoric Immersion](sensory-motoric-immersion) is closely tied to [Rhythm-Based Actions](rhythm-based-actions) as rhythm by nature implies repetition. This is especially the case when the actions are tied to some rhythm-based stimuli and sensory feedback such as the background music or the visual presentation of game elements. In fact, it is difficult or even impossible to achieve [Sensory-Motoric Immersion](sensory-motoric-immersion) without having some rhythmic elements, which are tied to the real time as can be the case in [Real-Time Games](real-time-games). [Dexterity-Based Actions](dexterity-based-actions), if they are to be performed repetitively, can also be the source of [Sensory-Motoric Immersion](sensory-motoric-immersion). Often these actions require considerable sensory-motoric skills from the players and the immersion can be achieved when there is [Right Level of Difficulty](right-levelof-difficulty) for the players. For example, the downhill skier can achieve a sort of a flow experience when the slope is difficult enough, but not too difficult, for skier's skills. As the actions involved need to be performed almost automatically there should not be a possibility for [Disruption of Focused Attention](disruptionof-focused-attention) during gameplay, unless there is a reason to break the immersion. This in almost all cases also imply that there is only a single or just few [Focus Loci](focus-loci) for the player."
        ],
        "consequences": [
            "The repetitive actions with accompanying sensory stimuli can create a kind of an endless loop for the player: the actions change the game state, the player has to react to the change in the game state immediately, which lead to further state changes requiring immediate player actions and so on. This tight coupling of actions, outcomes, and action demands in real time can create [Sensory-Motoric Immersion](sensory-motoric-immersion) situations similar to the \"immersion\" in playing musical instruments or dancing to music.",
            "The repetition implies that the possible actions are usually limited and occur in certain sequences, which can have a negative effect on [Varied Gameplay](varied-gameplay). Games which have characteristics of [Constructive Play](constructive-play), such as allowing the player to freely manipulate and combine game elements, avoid this negative effect by keeping the basic actions limited and simple but making the outcomes of the combinations of the actions to be almost limitless in number."
        ]
    },
    "relations": {
        "instantiates": [
            "immersion"
        ],
        "modulates": [],
        "instantiated_by": [
            "focus-loci",
            "right-levelof-difficulty"
        ],
        "modulated_by": [
            "constructive-play"
        ],
        "conflicts": [
            "disruptionof-focused-attention",
            "varied-gameplay"
        ]
    }
}