{
    "name": "Shared Resources",
    "texts": {
        "definition": "The players, or some of the players, have at least potential access to the same resources.",
        "description": [
            "Some games have resources that are not divided explicitly to individual players but are instead [Shared Resources](shared-resources). There are two basic types of [Shared Resources](shared-resources): initially (or potentially) shared and continuously shared. Initially [Shared Resources](shared-resources) is a weak form of this pattern where the ownership of the resources are not determined to begin with and players can in later phases of the game claim the ownership of these resources. Continuously [Shared Resources](shared-resources) are those where all players, or a designated group of players, can all make use of the resources throughout the whole game without being able to directly hinder each other from using the resources. It is, of course, possible to have hybrids of these two basic types."
        ],
        "examples": [
            "the ammunition, health, and armor pick-ups in multiplayer first-person shooters are initially [Shared Resources](shared-resources) as all players have equal access to them before they are picked up.",
            "the railroad tracks in \"TransAmerica\" are continuously [Shared Resources](shared-resources). Once laid down on the game board they are beneficial for all players who have a connection to the tracks."
        ],
        "usage": [
            "The two different types of [Shared Resources](shared-resources) depend on whether is possible to claim [Ownership](ownership) of the [Resources](resources) or not: it is possible to claim [Ownership](ownership) of initially [Shared Resources](shared-resources), but not of continuously [Shared Resources](shared-resources). Initially [Shared Resources](shared-resources) can be used with almost any kind of [Resource](resources) from simple [Pick-Ups](pick-ups) to [Area Control](area-control) but in order to have [Cooperation](cooperation) between the players they need other incentives also. In these cases [Shared Resources](shared-resources) only heighten the level of [Cooperation](cooperation). The continuously [Shared Resources](shared-resources), however, are slightly trickier to introduce to the game and are usually a basic or a background [Resource](resources) used to create [Individual Rewards](individual-rewards) for the players.",
            "For all [Shared Resources](shared-resources) an important design choice is to determine who of the players have access to them and also what the ways and methods to access them are. The ammunition [Pick-Ups](pick-ups) scattered among the battlefield in first-person shooters are simple to access: the players just have to pick them up. The initially [Shared Resources](shared-resources) are often used this way as subgoals within the game and may give rise to [Race](race) or [Exploration](exploration) goals. These access control mechanisms are built into the normal game but it is also possible to include more elaborate mechanisms. For example, only the members of a specific guild in a MMORPG can have access to the [Pick-Ups](pick-ups) in guild houses and only the members of the same team can use the team specific health and ammunition [Chargers](chargers) in Battlefield 1942. The same principles of control mechanisms apply to continuously [Shared Resources](shared-resources). Information, for example [Strategic Knowledge](strategic-knowledge), form a special category of [Shared Resources](shared-resources) since it can be shared infinitely without being lost to the original owner.",
            "One way to help the formation of [Social Organizations](social-organizations) within a game environment is to use [Shared Resources](shared-resources) to threaten players with [Shared Penalties](shared-penalties) or to create [Social Dilemma](social-dilemmas) situations. One example of [Social Dilemmas](social-dilemmas) is the case called the tragedy of the Commons. In these there are continuously [Shared Resources](shared-resources), which are at the same time [Limited Resources](limited-resources), but they are used to yield [Individual Rewards](individual-rewards) for players. Unless there are [Resources](resources) and [Rewards](rewards) to create situations where [Cooperation](cooperation) would be beneficial for all involved players there is incentive to overuse the [Limited Resources](limited-resources) to reap even greater [Individual Rewards](individual-rewards) even though the long-term rewards may be smaller. These situations promote the creation of [Social Organizations](social-organizations) to govern the use of the [Resources](resources).",
            "Completely [Shared Resources](shared-resources) between players is a trivial way of achieving [Symmetric Resource Distribution](symmetric-resource-distribution) between them."
        ],
        "consequences": [
            "[Shared Resources](shared-resources), especially continuously [Shared Resources](shared-resources), promote [Cooperation](cooperation) and [Negotiation](negotiation) within games where the players have [Team Play](team-play) or [Mutual Goals](mutual-goals), and thereby promote [Social Interaction](social-interaction). They also make all [Penalties](penalties) concerning them into [Shared Penalties](shared-penalties). Where the [Shared Resources](shared-resources) are only initially shared, or where players have [Individual Rewards](individual-rewards), the acquirement of the [Resources](resources) instead promote [Competition](competition) and [Tension](tension), and players can perceive they have a [Time Limit](time-limits) to gain or claim [Ownership](ownership) of the [Resources](resources) and that they are in a [Race](race) with other players."
        ]
    },
    "relations": {
        "instantiates": [
            "social-dilemmas",
            "social-interaction",
            "exploration",
            "negotiation",
            "tension",
            "competition",
            "race",
            "time-limits",
            "symmetric-resource-distribution"
        ],
        "modulates": [
            "ownership",
            "resources",
            "penalties",
            "cooperation",
            "social-interaction",
            "social-organizations",
            "alliances",
            "shared-penalties",
            "shared-rewards"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "mutual-goals",
            "team-play",
            "strategic-knowledge"
        ],
        "conflicts": []
    }
}