{
    "name": "Shared Rewards",
    "texts": {
        "definition": "The players who were involved in some way in reaching a goal in the game share the reward.",
        "description": [],
        "examples": [
            "in most of the MMORPGs, such as \"Anarchy Online\", players can team up to go hunting or perform more elaborate quests together. When the players have been able to reach their goal the rewards associated with the goal are shared between the players. In \"Anarchy Online\" killing a monster is rewarded with experience points and sometimes with special items. The experience points are shared by the players in such a way that there is only a small decrease in the amount of personal experience points gained when there are many players sharing the reward. The distribution of items is up to the players themselves and usually involves negotiation before the actual distribution.",
            "in \"Carcassonne\" one possible way to gain points is to finish building town by laying out tiles of town walls and town interiors. The player placing a tile to a town can also claim the ownership of the town by placing a knight. It is possible that when the town is finished that two or more players have claims on the same town. If several players have the same number of town in the town, all players receive the same amount of points as if there would have been only one player claiming the town."
        ],
        "usage": [
            "The three main things to consider when designing \"Shared Rewards\" are: what is the goal and its characteristics, how is the player composition of sharing the reward determined in relation to the player composition used in the goal, and how is the reward distributed to these players.",
            "\"Shared Rewards\" is usually used in conjunction with a \"Mutual Goal\" or \"Collaborative Actions\" in order to give players an incentive for working together towards the goal. This, however, is not the only option for the designer. It is possible to use any other kinds of goal structures with \"Shared Rewards\", but some are less suitable than others. For example, \"Races\" often allow players to have \"Tied Results\" while in most cases it does not make much sense to have \"Excluding Goals\" with \"Shared Rewards\" as only one of the players can reach the goal. However, \"Tournaments\" consisting of a series of \"Races\" with \"Excluding Goals\" where the players can help each other out even though that only one of them can win each of the \"Races\". If the player winning the \"Race\" can distribute parts of the reward to the players who helped him out during the that race and that the winner of the whole tournament is the player with most rewards gathered after ten races, this can lead to interesting player to player relation dynamics covered in more detail in the \"Delayed Reciprocity\" pattern. Also it is possible to use forced\"Shared Rewards\", where the player reaching a goal has to share the reward with at least one other players.",
            "The player composition for distribution of the reward might be different from the player composition used in reaching the goal. In player initiated change new members want to join, or lessen common, old members want to leave, the group sharing the reward. There is, of course, a possibility to include mechanisms for the group to reject these possible changes through the game system. \"Dark Age of Camelot\" is an example where the group initially sharing the reward does not have direct methods for blocking other players for sharing the reward, and many other MMORPGs also allow players who did not participate in killing a monster to come and take a share of the items the monster had. This kind of \"Competition\" for the \"Shared Rewards\" is, of course, considered to be quite impolite and might lead to later social sanctions against the player. The group initiated changes happen when the group itself invites new players to share the reward or when the other members of the group decide to kick a member out.",
            "The distribution of the reward can be automatic, \"Player Decided Distribution of Rewards &amp; Penalties\", or a hybrid of these two. Automatic reward distribution is, as its name implies, controlled by the game system. There are, of course, many choices for the sharing procedure but only three of them are commonly used. The first option is that the whole reward is constant and each of the players gets an equal shares. In the second option each player get the full reward, for example, killing the monster gives 100 experience points for each of the participating players regardless of the total number of players sharing the reward. The third option is something in between, meaning that the reward for each of the players decreases slightly with the number of players sharing the reward, but the total reward also increases with the number of players. This method is used in, for example, \"Anarchy Online\" for distributing the experience points for killing the monsters. There are, as previously mentioned, more complex functions available some of which can take into account issues such as the amount of participation by each player to reachthe goal, the status of the players, and risks involved for each of the players.",
            "\"Player Decided Distribution of Rewards &amp; Penalties\" usually involves \"Negotiation\" even when there is only one player doing the actual distribution. The mechanisms for haggling and resolving the distribution are, again, varied. The basic issue, however, is to decide which players can do the distribution and what actions and information are available to the players that are handling the distribution. Situations where all players can participate in the distribution by just grabbing the items from the reward stash usually ends up in a chaotic situation where the fastest players get the best items and, sometimes, the bargaining continues for a long time after the final distribution. The case where only one player is responsible for the distribution simplifies the actual distribution, but usually leads to more complex and long term player-to-player relations.",
            "The hybrid version uses both automatic and player decided distribution for the reward. This is usually tied to the type of the reward. For example, in a roleplaying game the reward for rescuing a princess consists of a certain amount of experience points and two magical items. The experience points are shared automatically and it is up to the players to share the magical items as \"Individual Rewards\". A special case of the hybrid version exists when \"Tiebreakers\" are not used: in these cases \"Tied Results\" typically becomes a \"Shared Reward\" the distribution of which is dictated by the rules of the games but players can agree on letting them happen, in one sense making the \"Tied Results\" a \"Collaborative Action\"."
        ],
        "consequences": [
            "When the \"Shared Rewards\" are truly shared, in contrast to being split, they modulate how \"Ownership\" is instantiated in the game and may give rise to \"Social Organizations\". This since \"Shared Rewards\" give an incentive for \"Cooperation\" and usually also increase the \"Social Interaction\", and can be used as a basis for creating \"Alliances\" and \"Team Play\", especially if the \"Shared Rewards\" replenish \"Shared Resources\". Forced \"Shared Rewards\", where the player reaching a goal has to share the reward with another player, can be used as a \"Balancing Effect\" as the leading player has an incentive to share the reward with the last player. Situations where there is player-decided distribution of the rewards and that players have a possibility of longer term interaction gives rise to \"Delayed Reciprocity\", the well known I-scratch-your-back-you-scratch-mine phenomena."
        ]
    },
    "relations": {
        "instantiates": [
            "cooperation",
            "balancing-effects",
            "rewards",
            "mutual-goals",
            "delayed-reciprocity",
            "uncommitted-alliances"
        ],
        "modulates": [
            "collaborative-actions",
            "competition",
            "alliances",
            "team-play",
            "social-interaction",
            "individual-rewards",
            "race",
            "social-organizations",
            "ownership"
        ],
        "instantiated_by": [
            "tied-results",
            "mutual-goals"
        ],
        "modulated_by": [
            "shared-resources",
            "negotiation",
            "player-decided-distribution-of-rewards-penalties"
        ],
        "conflicts": [
            "conflict",
            "excluding-goals",
            "individual-rewards",
            "tiebreakers"
        ]
    }
}