{
    "name": "Shrinking Game World",
    "texts": {
        "definition": "The game world shrinks and thus restricts players' movement in the game.",
        "description": [
            "Some games, primarily those where player compete against each other, decrease the size of the game world as game play progresses. This imposes an outside influence that forces the players together and thereby into conflict."
        ],
        "examples": [
            "The game area shrinks in \"Bomber Man\" after players have failed to eliminate each other in a certain period of time to increase the tension of the game.",
            "One of the multiplayer levels in \"Half-Life\" allowed players to activate an air strike. All those not in a bunker complex when the air strike hit was killed, in effect reducing the \"Game World\" to the bunker for parts of the game play."
        ],
        "usage": [
            "\"Shrinking Game Worlds\" have two prime characteristics: in what way the \"Game World\" shrinks and what activates the shrinkage. Having a uniform and predefined way in which the world shrinks, typically by using \"Tiles\" as a unit of the shrinkage, and how this is activated, most commonly simple a \"Time Limit\", allows player to have \"Strategic Knowledge\" and make increases \"Conflict\" if potential for it existed to begin with. If players can control the shrinkage this allows \"Player Defined Goals\" anda form of \"Player Constructed World\". The ability to control \"Shrinking Game Worlds\" can be used as an offensive ability as being caught in a shrinking area is often a \"Deadly Trap\"."
        ],
        "consequences": [
            "\"Shrinking Game Worlds\" are \"Ultra-Powerful Events\" that instantiate\"The Show Must Go On\". They increase \"Tension\" by limiting players' \"Freedom of Choice\" by creating \"Movement Limitations\". If the events are caused by \"Irreversible Actions\" a \"Shrinking Game World\" can ensure \"Higher-Level Closures as Gameplay Progresses\"."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "movement-limitations",
            "ultra-powerful-events",
            "the-show-must-go-on",
            "deadly-traps",
            "higher-level-closures-as-gameplay-progresses",
            "tension"
        ],
        "modulates": [
            "game-world",
            "conflict"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "tiles",
            "irreversible-actions"
        ],
        "conflicts": [
            "freedom-of-choice"
        ]
    }
}