{
    "name": "Social Organizations",
    "texts": {
        "definition": "Social Organizations are more or less stable group of players who have common long-term interests within the game.",
        "description": [
            "\"Social Organizations\" differ from mere \"Alliances\" in that they are more stable and that the rules of conduct and agenda, the norms of the organization, are stratified in some sort of rules. Organizations usually arise from the natural interaction in \"Alliances\". Some features that prelude the formation of organizations are that the interaction between the members becomes more frequent, the tasks of the group become complex enough to need coordination, the group becomes larger and specific roles for the members emerge. The other interesting characteristics of a proper \"Social Organization\" are a hierarchical power structure between the members; the specific roles of the members are codified in more or less explicit rules governing rank or official status within the group; the organization develops an identity of its own and the members start to identify themselves with the organization. In some cases there are also other incentives for belonging to an organization, such as access to an organization's resources or even an in-game salary of some kind for tasks performed in the organization."
        ],
        "examples": [
            "many multiplayer first person shooters that have possibility for team play against other teams, such as \"Return to Castle Wolfenstein: Enemy Territory\" and \"Counter-Strike\", almost automatically have groups of players forming clans, that is, \"Social Organizations\". The clans have a stable identity; the players can display their belonging to the clan in different ways; the players belonging to a clan usually share a longer term interest, for example, to rise in the clan ranking, or finally beat a rival clan; there are different roles for the members both when playing the game (medic, engineer etc.) and outside the game (clan leader, web-site manager); and clans usually have a power structure where the members are ranked from newbies to clan leaders.",
            "persistent MMORPGs are designed to be good environments for forming stable \"Social Organizations\" as the players stable identity is taken for granted; there are explicitly designed complementary roles for the players right from the beginning; the games often provide also further specialization possibilities for the players and some of the pre-designed tasks, such as killing a powerful monster, are impossible to achieve without longer term coordination of groups activities. It is no wonder that these games very often provide in-game mechanisms for forming and maintaining guilds and other types of stable \"Social Organizations\"."
        ],
        "usage": [
            "\"Social Organizations\" require that players can feel a sense of \"Identification\" with the organization and that other players can successfully do an \"Identification\" of that player. The individual player has to have some ways of developing and maintaining a stable identity within the game itself as otherwise even frequent interaction between players in the game cannot be the basis for trust and affiliation relationships. That is, without a possibility for maintaining a history of social encounters with other players in \"Multiplayer Games\" there is no way for the organizations to emerge. This is not a problem in games requiring face to face situations, but especially in online games this might turn into a problem. In the latter case, even a simple \"Handle\", which is unique and stable for each player, is sufficient for forming stable player identities in the game world. More refined methods of personalization, such as the possibility of modifying the appearance of the player \"Avatar\", help further to form and maintain identities. Some games even keep explicit records of the previous encounters with other players.",
            "\"Social Organizations\" require \"Social Interaction\". Games that provide different, and private, \"Communication Channels\" for the organization allow members to have stronger commitment to the organization. \"Status Indicators\" partly fill the same role and allow asynchronous communication of quantifiable \"Social Statuses\".",
            "Players do not only need methods for providing stable identities for themselves but also for the organization itself. The same principles of \"Identification\" apply here: players need methods for designing banners or emblems of the organization, having specific locations in the game owned by the organization, and so on. The players should also be able to display their membership status or \"Identification\" with the organization. The simplest case, again, is a plain clan identifier attached to players' \"Handles\", but allowing players to wear the organization's emblems on their \"Avatars\" will have a stronger impact on the play experience. Especially larger organizations also use specific logos or other status displays to differentiate between the roles and ranks of their members.",
            "Explicitly using \"Asymmetric Abilities\" for role and skill differentiation, in a fashion similar to \"Orthogonal Unit Differentiation\", usually forms a strong base for \"Social Organizations\". As previously mentioned, the game can provide even further possibilities of role differentiation than just selecting a basic class or role. This is especially important in games which are based on the players' skills, such as team sports, and developing these skills can strongly encourage \"Team Development\" in these games.",
            "An organization needs a longer term goal or interest to survive. In non-persistent team based games the simplest way out is to use a \"Tournament\" structure of some kind to provide the long-term goal as it automatically brings in \"Competition\" between participating organizations. It might be difficult to provide incentives for \"Competition\" between organizations in \"Persistent Game Worlds\", which allow organic formation of the organizations. These games, however, usually bring in \"Competition\" and \"Conflict\" between organizations by providing larger factions to which the player formed organizations belong. One reliable way to guarantee cohesion and longevity of any \"Social Organization\" in a game is to provide a clear external threat or a \"Conflict\" situation to the organization. One way to help the spontaneous formation of \"Social Organizations\" is to use \"Shared Resources\" with \"Social Dilemmas\" in addition to external threats. For example, The Tragedy of the Commons situation mentioned in \"Social Dilemma\" pattern necessitates the formation of \"Social Organizations\" if the pasture is threatened by wolves, and more resources than are available for any one player are needed for protecting the herds from the wolves.",
            "\"Social Organizations\" also have other types of uses for \"Shared Resources\". The most obvious one is, of course, that there are resources that are owned by the organization itself and that all members have equal access to the resources, as is the case in The Tragedy of the Commons example. Most organizations, however, tend to restrict access to the \"Shared Resources\" by nominating some of the members as responsible for how the resources are used. There are several different ways of arranging this, ranging from authoritarian versions where only the leader of the organization has direct access to the resources to more democratic versions where the members vote on the use of the resources. In the most unstructured organizations it may seem that the organization only in theory controls the resources and they are used by the members completely without coordination.",
            "When an organization grows large enough, and the tasks it performs are complex and require coordination, there emerges a need to structure both power hierarchies and communication structures in some way for allowing \"Player Decided Results\" within the organization. A power hierarchy with explicit titles for levels of the hierarchy seems to be the most popular one. The power concept here is slightly simplified to mean that the higher the player is in the power hierarchy the more \"Social Status\" he has, possibly more access to the resources of the organization, more responsibilities, and, in some cases, direct power to give orders to the members below him. Communication structures rarely follow the power hierarchy exactly. The communication structure tells members how the communication between them is arranged and allowed. A strict hierarchical top-down communication structure means that only superiors can give orders or information to the other members. This, however, is rarely the case as there is usually also an upward flow for reporting to superiors as well as horizontal communication between members of the same rank. Other possible communication structures range from those where everyone can communicate with everyone to circles of message passing in centralized systems. These communication structures also allow \"Negotiations\" between the players."
        ],
        "consequences": [
            "\"Social Organizations\" are a form of \"Alliances\" which lets players have \"Emotional Immersion\" in games through \"Identification\" with a group and provides ways to have \"Resource Management\" over \"Shared Resources\" as well as guiding the development of individual members \"Competence Areas\". They more often function by \"Delayed Reciprocity\" than do other forms of \"Alliances\" as players trust each other through shared \"Identification\".",
            "Belonging to a \"Social Organization\" in a game brings in another layer of commitment to the game, a kind of \"Investment\". The player, in effect, starts to feel social responsibility for continuing to play the game, especially if there is a strict division of tasks within the organization, and the organization gives the players ways of identifying with the organization as well. This \"Identification\" can be supported by having \"Shared Rewards\" and \"Shared Penalties\" for members.",
            "Even if the \"Investment\" of a player can be very little to join a \"Social Organization\" these organizations are rarely \"Uncommitted Alliances\" as gaining membership often requires an action of \"Delayed Reciprocity\" from other players, even if the only requirement is continued membership and \"Social Interaction\". Not supporting the \"Social Organization\" in way that players believe is expected from them can create a form of \"Social Dilemma\".",
            "Having \"Social Organizations\" often results in more \"Varied Gameplay\" as, especially larger, organizations are prone to have an internal power struggle for \"Social Status\". In addition to the required coordination efforts, this almost inevitably leads into more \"Social Interaction\" in the game itself. Belonging to a group, especially in an inter-group \"Competition\" and \"Team Play\" situation, brings in a strong \"us versus them\" mentality for the players. This can be a good thing for a player's commitment to the game itself, but might in extreme cases lead to unwanted situations, such as harassment both in-game and out-game. The members of a \"Social Organization\" also tend to trust other members on just the basis of their membership and mistrust outsiders, especially members of competing organizations."
        ]
    },
    "relations": {
        "instantiates": [
            "alliances",
            "team-play",
            "varied-gameplay",
            "social-dilemmas",
            "delayed-reciprocity"
        ],
        "modulates": [
            "competition",
            "cooperation",
            "team-development",
            "social-interaction"
        ],
        "instantiated_by": [
            "player-decided-results",
            "asymmetric-abilities",
            "investments",
            "handles",
            "social-interaction",
            "social-dilemmas"
        ],
        "modulated_by": [
            "social-statuses",
            "conflict",
            "competence-areas",
            "shared-resources",
            "status-indicators",
            "shared-penalties",
            "resource-management",
            "tournaments",
            "multiplayer-games",
            "communication-channels",
            "identification",
            "persistent-game-worlds",
            "negotiation",
            "shared-rewards",
            "orthogonal-unit-differentiation"
        ],
        "conflicts": [
            "uncommitted-alliances"
        ]
    }
}