{
    "name": "Spawning",
    "texts": {
        "definition": "The action of an Avatar appearing in the game world.",
        "description": [
            "All games where new game elements appear during game play must provide means by which these game elements are introduced. [Spawning](spawning) is one of the common ways of doing this besides letting game elements appear from factories, buildings, and cities which all act as a kind of producer. When [Spawning](spawning) occurs, it simply places the game elements in the game environment and lets it be able to do actions and be affected by actions in the game world."
        ],
        "examples": [
            "\"Return to Castle Wolfenstein: Enemy Territory\" moves which spawn points are used in certain levels after major events have taken place, such as blowing up a cave or bank door or blowing up a wall in an old city.",
            "\"Battlefield 1942\" allows players to choose where to spawn after being killed from a number of spawn points, where the exact set of points that can be chosen from depends on the teams position in the game.",
            "spawning in the same position as another player in \"Quake\" killed that player's avatar in what is called a telefrag.",
            "The arcade game \"Gauntlet\" let players enter ongoing games by being spawned into locations near the other players."
        ],
        "usage": [
            "Besides the design of [Spawn Points](spawn-points), which includes deciding if they should be [Safe Havens](safe-havens) and creates [Strategic Locations](strategic-locations), choosing how [Spawning](spawning) should work is mainly a question of [Player Balance](player-balance). As [Spawning](spawning) is typically the result of a [Penalty](penalties) where players may have had [Ability Loss](ability-losses) and may have a bad [Game State Overview](game-state-overview) due to [Downtime](downtime), [Spawning](spawning) players typically are disadvantaged. Several design that can be made to help [Spawning](spawning) player; letting them have [Privileged Abilities](privileged-abilities) of invulnerability for a certain period of time after [Spawning](spawning) to make [Camping](camping) around the [Spawn Point](spawn-points) impossible; letting them purchase or otherwise receive [Tools](tools) to ensure a certain level of preparedness; or letting them have several [Spawn Points](spawn-points) to choose from so that they have a [Freedom of Choice](freedomof-choice) to make [Risk/Reward](risk-reward) decisions.",
            "Besides choosing whether or not to use [Balancing Effects](balancing-effects), the design of [Spawning](spawning) can explicitly force [Downtime](downtime) which also affects [Player Balance](player-balance) as well as [Team Balance](team-balance). [Spawning](spawning) can make [Team Elimination](team-elimination) impossible, but may also be designed to separate it form the individual deaths, for example by letting every players have a number of lives or letting the team as a whole have a limited number of times players can respawn. The setting of the time players have to wait, if any, can be used to create reasonable waiting times in games with [Early Elimination](early-elimination) but also affect the [Risk/Reward](risk-reward) decisions of performing actions in the game which may lead to a lost of the \"Life\" of one's [Avatar](avatars)."
        ],
        "consequences": [
            "[Spawning](spawning) can be seen as the effect of a form of abstract [Producers](producers) at specific [Spawn Points](spawn-points). The action is caused by the beginning of game play when all players perform the action or when one player's [Avatar](avatars) reenters the game after having lost a \"Life\", either as part of normal game play or the effect of [Save-Load Cycles](save-load-cycles). [Spawning](spawning) gives game designs a way of avoiding [Player Elimination](player-elimination) (and [Early Elimination](early-elimination) from the entire game session) while having [Player Killing](player-killing), and [Spawning](spawning) also allowing an easy way to introduce late-arriving players. [Spawning](spawning) create a form of [Game Pauses](game-pauses) from the players' perspective since they cannot do anything until they have spawned.",
            "[Spawning](spawning) can be used to move the center of the game play so that it advances a [Narrative Structure](narrative-structures). This is mainly done in game with [Team Play](team-play) after major [Irreversible Actions](irreversible-actions) (and often goals) have been completed and is done by moving which [Spawn Points](spawn-points) are used by which players.",
            "[Spawning](spawning) is rarely explained within the [Consistent Reality Logic](consistent-reality-logic) of an [Alternative Reality](alternative-reality) but can be sometimes be so through explanations of reinforcements arriving from [Inaccessible Areas](inaccessible-areas) or summonings from alternative dimensions."
        ]
    },
    "relations": {
        "instantiates": [
            "producers",
            "downtime",
            "game-pauses"
        ],
        "modulates": [
            "early-elimination",
            "player-balance",
            "freedomof-choice",
            "risk-reward",
            "narrative-structures",
            "team-balance",
            "player-killing",
            "team-elimination"
        ],
        "instantiated_by": [
            "penalties",
            "lives"
        ],
        "modulated_by": [
            "safe-havens",
            "irreversible-actions",
            "inaccessible-areas",
            "strategic-locations",
            "balancing-effects",
            "spawn-points",
            "ability-losses",
            "camping",
            "tools",
            "privileged-abilities"
        ],
        "conflicts": [
            "early-elimination",
            "consistent-reality-logic"
        ]
    }
}