{
    "name": "Survive",
    "texts": {
        "definition": "The goal of trying to avoid being killed by actions of other players and events in the game.",
        "description": [
            "Many games have effects that capture, destroy, kill, or eliminate game elements depending on the theme of the game. As these events are usually negative for the players who control the game elements, they have the expected goal of trying to make these units [Survive](survive)."
        ],
        "examples": [
            "The players are, sooner or later, going to have all their ships destroyed in \"Space Invaders\" or \"Asteroids\", but surviving allows the players to keep on playing to gain enough points to reach a high score position."
        ],
        "usage": [
            "Defining a [Survive](survive) goal for a player includes determining what game element should [Survive](survive), what danger exists and what actions the player can perform to avoid having game elements eliminated. The archetypical game element connected to a [Survive](survive) goal is an [Avatar](avatars), but having a certain amount percentage of [Units](units) [Survive](survive) (as for example in \"Lemmings\") can also be used. Gaining knowledge of what dangers exist and how dangerous they are offers possibilities for [Supporting Goals](supporting-goals) that can either support [Stimulated Planning](stimulated-planning) or make the goal to [Survive](survive) easier in itself.",
            "Actions that are used to fulfill the goal can be divided into those that primarily focus on the game element that is to [Survive](survive), e. g., improving values such as hit points or defense or moving to advantageous locations, possibly using [Conceal](conceal) as a subgoal, or those that primarily focus on the dangers, e. g., preempting attacks. [Last Man Standing](last-man-standing) is a special case of [Survive](survive) where the goal to [Survive](survive) is combined with [Eliminate](eliminate) and players have to judge the [Risk/Reward](risk-reward) [Tradeoff](tradeoffs) between being offensive or defensive.",
            "The consequences of failing the goal to [Survive](survive) can range from not being able to continue to play, as in the cases of games with [Player Elimination](player-elimination), to the penalties determined by the loss of one of one's [Lives](lives), to simply [Spawning](spawning)."
        ],
        "consequences": [
            "This is the [Preventing Goal](preventing-goals) of [Eliminate](eliminate): to hinder another player or the system from \"Eliminating\" one's [Avatar](avatars) or [Units](units). Games, e. g., old arcade games, that have the elimination of a player's [Avatar](avatars) as the end condition, use the pattern [Survive](survive) as one of the high-level goals of the game.",
            "The use of [Survive](survive) is heavily connected with the use of [Lives](lives) or [Parallel Lives](parallel-lives), and the level of threat can be used to modulate [Tension](tension)."
        ]
    },
    "relations": {
        "instantiates": [
            "continuous-goals",
            "preventing-goals"
        ],
        "modulates": [
            "eliminate"
        ],
        "instantiated_by": [
            "last-man-standing"
        ],
        "modulated_by": [
            "units",
            "conceal",
            "avatars",
            "player-elimination",
            "lives"
        ],
        "conflicts": []
    }
}