{
    "name": "Symmetric Information",
    "texts": {
        "definition": "All players have the same information about the game state, or part of the game state, available to them",
        "description": [
            "In some games, all players have the same information, so the mastery of the game does not rely on having specific information. The simplest and most often used case is having the whole game state known to the players, as in many traditional board games."
        ],
        "examples": [
            "Trick-taking card games have \"Symmetric Information\" about the cards that have been played. Typically, this means that players start with no shared information about who has which cards, but this knowledge grows until the last trick has been played and all players know the exact distribution of cards.",
            "\"Chess\" and \"Go\", as well as nearly all other traditional board games, have all information public, making the distribution symmetric by default. In most cases, the information is simply where all pieces are and what strengths they have.",
            "In the tile-laying game \"Carcassonne\", all players have the same amount of information: the configuration of placed tiles and where players have placed their tiles. No players know the order in which the remaining tile will come into play."
        ],
        "usage": [
            "Game designers can implement enforced or potential \"Symmetric Information\". Enforced \"Symmetric Information\" means that the action and events in the game are designed so that all players are presented with the same information openly. Potential \"Symmetric Information\" occurs when several players have some information, not necessarily the same, but can deduce the same additional information from the information that is known. The use of enforced \"Symmetric Information\" on players' information makes it less risky to have that information as \"Public Information\", as the possibility of passing sensitive information is avoided.",
            "Enforced \"Symmetric Information\" can be present at the start of a game due to the nature of the setup phase, but in order to maintain \"Symmetric Information\", actions and events of a game need to be public. An example of how to enforce \"Symmetric Information\" in a card game can be to only allow players to take cards through draftingand not to take cards upside down from a \"Drawing Stack\".",
            "One way of creating potential \"Symmetric Information\" is to let all players know what individual elements of a certain game element type exist but not to know their distribution. If actions and events during play reveal information about the distribution so that all players get this information, they can start to figure out which distributions are impossible or unlikely, typically combining the pattern with \"Uncertainty of Information\". As all players have received the same information, they can all potentially reach the same conclusions. The \"Right Level of Difficulty\" for achieving information can be modulated by limiting how long the players have access to the information of public actions and events. Games that support \"Memorizing\" only let the players have the information for a short while, for example, only letting the players look at the cards played in a trick until the next trick is started in the trick-taking card games. Games that support \"Puzzle Solving\", such as \"Cluedo\", have special game elements to allow players to record what information has been revealed by actions and events. The game \"Mastermind\" is a further example of the latter, and shows how achieving \"Symmetric Information\" with the other player can be used as a winning condition for a player, while maintaining \"Asymmetric Information\" distribution is the goal for the other player."
        ],
        "consequences": [
            "\"Symmetric Information\" gives all players the same amount of information to decide their actions and strategies. Thus, even if the information is imperfect, games using \"Symmetric Information\" lead to more strategically oriented game play, removing the direct possibilities for \"Bluffing\" in \"Negotiation\" situations such as \"Bidding\" or \"Trading\", limiting secret tactics, and limiting deceit based on the information about the game state. This typically leads to \"Stimulated Planning\", especially when \"Predefined Goals\" are used and known to all. However, since players are aware that other players have the same information that they do, they need to take this into consideration when planning. As this requires trying to guess what the other players are planning and what, in their turn, they are guessing the player is planning, this can significantly affect the \"Right Level of Complexity\" and cause \"Analysis Paralysis\".",
            "Games with \"Social Interaction\" and \"Conflict\" may become somewhat self-balancing if \"Symmetric Information\" is present. In these cases, players may form \"Alliances\" and perform actions such as blockadesin order to counter any lead an individual player has.",
            "Symmetry of information and the quality of the information are loosely connected. Games with total \"Perfect Information\" automatically have \"Symmetric Information\", but in all other cases, \"Symmetric Information\" can be available irrespective of \"Perfect Information\"."
        ]
    },
    "relations": {
        "instantiates": [
            "stimulated-planning"
        ],
        "modulates": [
            "conflict",
            "bidding",
            "trading",
            "analysis-paralysis",
            "public-information",
            "negotiation",
            "bluffing",
            "predefined-goals"
        ],
        "instantiated_by": [
            "perfect-information"
        ],
        "modulated_by": [
            "interferable-goals",
            "perfect-information"
        ],
        "conflicts": [
            "bluffing"
        ]
    }
}