{
    "name": "Team Elimination",
    "texts": {
        "definition": "The elimination of the whole team in team-oriented games is an end condition and the evaluation function.",
        "description": [
            "[Team Elimination](team-elimination) can be used for the whole game instance or just with respect to specific goals or modes of play within the game."
        ],
        "examples": [
            "in \"Counter-Strike\" the other team loses automatically if all the players in that team are eliminated.",
            "in \"Anarchy Online\" and other MMORPGs the team fails in achieving a mission goal if the team members are killed during the mission."
        ],
        "usage": [
            "[Team Elimination](team-elimination) requires that there is at least the possibility of some kind of [Team Play](team-play) and also that there the possibility of either [Player Killing](player-killing) or [Player Elimination](player-elimination). [Team Elimination](team-elimination) with [Player Killing](player-killing) means that even though there is [Spawning](spawning) for the players themselves the team fails when the members are killed. This is the case for failing missions in MMORPGs when the players are killed during the mission. [Team Elimination](team-elimination) is a completed [Collection](collection) of [Eliminate](eliminate) goalsof the team members and it can be used also as [Mutual Goals](mutual-goals) for different teams in the game."
        ],
        "consequences": [
            "[Team Elimination](team-elimination) shares the same basic characteristics with [Player Elimination](player-elimination), including the effect on, for example, [Tension](tension). [Team Elimination](team-elimination) is naturally a [Shared Penalty](shared-penalties) for the team members."
        ]
    },
    "relations": {
        "instantiates": [
            "shared-penalties"
        ],
        "modulates": [
            "team-play"
        ],
        "instantiated_by": [
            "collection",
            "player-elimination",
            "player-killing"
        ],
        "modulated_by": [
            "mutual-goals",
            "spawning"
        ],
        "conflicts": []
    }
}