{
    "name": "Team Development",
    "texts": {
        "definition": "The efficiency of the team is improved either intentionally or unintentionally.",
        "description": [
            "The measurement of team efficiency depends a lot on the game itself but also on the playing style of the players. [Team Development](team-development), however, is most evident in games where there is a possibility to somehow quantify the efficiency of the team either in absolute terms or in relation to other teams. Even in these cases it is possible to set other standards of measuring team efficiency, for example by assessing how well the team members get along with the rest of the team outside the game. Part of the [Team Development](team-development) can be to manage which players should be part of the team."
        ],
        "examples": [
            "the player characters' skills and abilities can be improved with experience in \"Return to Castle Wolfenstein: Enemy Territory\". Some teams plan ahead how to improve the team members' skills in such way that it is beneficial to the whole team and not just for the individual player.",
            "many teams and groups in roleplaying games try to maximize the efficiency of the team by selecting characters with complementary skills and by planning how the skills and abilities of the characters are improved over time."
        ],
        "usage": [
            "[Team Development](team-development) is a form of [Resource Management](resource-management) where the [Resources](resources) involved are the players and their [Skills](skills) and abilities. This [Resource Management](resource-management) aspect of [Team Development](team-development) is heightened if the players or some of the players can choose what kinds of [New Abilities](new-abilities) and [Improved Abilities](improved-abilities) the players acquire. In games with more complex [Character Development](character-development) possibilities, [Team Development](team-development) can give rise to player roles within the team, which are only responsible for the [Resource Management](resource-management) of the team. These kinds of teams naturally form [Social Organizations](social-organizations) with stable role differentiation and [Competence Areas](competence-areas), and hierarchies of status and power."
        ],
        "consequences": [
            "[Team Development](team-development) is often [Resource Management](resource-management) in a game or a [Meta Game](meta-games) to other games. In some games, especially in MMORPGs, the composition management is part of the usual gameplay itself and in these cases the teams are often [Dynamic Alliances](dynamic-alliances). Players' [Character Development](character-development) can also be part of the [Meta Game](meta-games) as [Extra-Game Actions](extra-game-actions), allowing more time for the planning of the [Team Development](team-development). Although, improving the [Skills](skills) of individual players is one way to support the efficiency of the whole team, such individual development of [Competence Areas](competence-areas) may disrupt or at least modulate [Team Balance](team-balance). If the [Team Balance](team-balance) goes out of sync, for example by increasing the [Skills](skills) of one player too much, the efficiency of the whole team usually suffers.",
            "Games supporting [Team Development](team-development) tend to have higher player commitment especially if the players have at least a certain [Freedom of Choice](freedomof-choice) to participate in the planning of [Team Development](team-development). This might be because the players perceive both the individual [Character Development](character-development) and the [Team Development](team-development) as forms of [Investments](investments) which necessarily require long-term commitment from the players."
        ]
    },
    "relations": {
        "instantiates": [
            "meta-games"
        ],
        "modulates": [
            "team-play",
            "roleplaying",
            "team-balance"
        ],
        "instantiated_by": [
            "planned-character-development",
            "investments",
            "improved-abilities",
            "new-abilities"
        ],
        "modulated_by": [
            "competence-areas",
            "resource-management",
            "privileged-abilities",
            "social-organizations",
            "skills",
            "asymmetric-abilities",
            "dynamic-alliances"
        ],
        "conflicts": [
            "team-balance"
        ]
    }
}