{
    "name": "Third-Person Views",
    "texts": {
        "definition": "Players are shown the game world with a focus on a game element under the players' control",
        "description": [
            "Many games center the view of the game environment upon a game element, which the players control. These \"Third-Person Views\", where players observe the game environment as seen from outside the game element they control, let them see more of the immediately surrounding environment than could be achieve by observing from within the game element."
        ],
        "examples": [
            "\"Pac-Man\" is shown from above in the game with the same name, giving players the possibility to see what is behind walls in the maze."
        ],
        "usage": [
            "There are a number of different types of \"Third-Person Views\": isometric, which shows the game elementfrom above slightly to the side; overhead, which provides excellent relations to the surrounding but which offers little information about the game elementitself; chase-cam, which follows the game element exactly behind in the element's line of movement. These can be modified by either linking the movement of the \"Camera\" to the movement of the game element or locking the \"Camera\" to a position relative to the environment. The same trick can be used for \"Public Information\" with \"Third-Person Views\".",
            "\"Third-Person Views\" offer the design option of letting players have control over the \"Camera\" which creates the view. Although this may affect the \"Right Level of Difficulty\" and require more \"Dexterity-Based Actions\", it can allow players to have a complete view of the \"Game World\".",
            "Games with \"Third-Person Views\" that require \"Imperfect Information\" about the terrain of the \"Game World\" at a different level than the view must either use \"Fog of War\" or divide the game area into sections."
        ],
        "consequences": [
            "\"Third-Person Views\" focus the view of the \"Game World\" around an \"Avatar\" or a \"Unit\". Since the entire surrounding around that game element, and specifically the area behind the game element, is visible to the player, this view provides a form of \"Game State Overview\". The centering of the view around a \"Unit\" makes \"Third-Person Views\" support the identification of what \"Unit\" is controlled in moveable \"Focus Loci\".",
            "The feedback from performed movements in \"Third-Person Views\" is not as natural as those of \"First-Person Views\", as it is the relation between the \"Avatar\" or \"Unit\" and the environment that changes rather than the just the environment. \"Third-Person Views\" can still support \"Spatial Immersion\", especially in chase-cam modes, and the better \"Game State Overview\" may make \"Maneuvering\" easier in this view than in \"First-Person Views\". However, \"Aim &amp; Shoot\" actions become more difficult since players have to take both the target and shooter positions and movement into account when performing the actions."
        ]
    },
    "relations": {
        "instantiates": [
            "spatial-immersion",
            "focus-loci"
        ],
        "modulates": [
            "aim-shoot",
            "fog-of-war",
            "game-world",
            "maneuvering",
            "game-state-overview",
            "dexterity-based-actions",
            "public-information"
        ],
        "instantiated_by": [
            "avatars",
            "units"
        ],
        "modulated_by": [
            "fog-of-war"
        ],
        "conflicts": [
            "god-views"
        ]
    }
}