{
    "name": "Tiles",
    "texts": {
        "definition": "Tiles are areas within the game world that partition it into separate parts, usually filling the whole game world.",
        "description": [],
        "examples": [
            "The board game \"Othello\" (aka \"Annex\", aka \"Annexation\") consists of playing tiles and flipping them, trying to make one's color dominant on the board.",
            "In the board game \"Dog eat Dog\" tiles are used to show that the nature on a part of the board has been polluted; they cover the board and show the same scenery, albeit more polluted, dirty and depressing.",
            "\"NetHack\" uses [Tiles](tiles) to represent corridors, walls, dungeon, and cavern floors and so on. These [Tiles](tiles) are used to generate an almost limitless number of different dungeons."
        ],
        "usage": [
            "[Tiles](tiles) can either be passive game elements in a game design or actively used by players. In the former case they are usually arranged before gameplay begins while in the latter case they allow [Tile-Laying](tile-laying) and can be held by players in what functionally are [Card Hands](card-hands).",
            "[Tiles](tiles) can be used either to define the [Game World](game-world) or to be put on an area defined by the [Game World](game-world). They may be designed in such a manner that every tile may be put next to any other tile (regarding form and appearance), or not (implying rules that a tile may only be put where it fits). In board games the game areas that are constructed by [Tiles](tiles) can make use of the two sides of a tile to represent different modes of the game area defined by the tile. In computer games the [Tiles](tiles) may have any number of different modes. [Tiles](tiles) can also have a semi-permanent nature, for example, they can start to deteriorate when an [Avatar](avatars) or one of a player's [Units](units) has been placed on the tile, creating a [Time Limit](time-limits) for long the tile can be used.",
            "[Tiles](tiles) can either be uniform in form, as the squares in \"Chess\", or have irregular shapes, e. g. shaped to fit an illustrative game map as in \"Diplomacy\". Irregularly shaped tiles can be used to make tiles have different properties regarding connections to other areas of the game board, creating [Strategic Locations](strategic-locations). Regardless of the shape, [Tiles](tiles) can also become [Strategic Locations](strategic-locations) by having different characteristics enabling, for example, [Privileged Abilities](privileged-abilities). [Tiles](tiles) that are placed differently in different game instances can be created so that the distribution of different tiles can make certain tiles more valuable.",
            "[Tiles](tiles) can be used to define how and how fast the game elements can move through the connections to the neighboring [Tiles](tiles). They can also be used to define the size of the game elements, i. e. that a game element may, regardless of its actual physically size, be said to occupy one or several tiles fully if placed within them."
        ],
        "consequences": [
            "[Tiles](tiles) allow the [Game World](game-world) to be separated into clearly distinguishable areas, making the position and possibilities of actions easier to judge. [Tiles](tiles) also allow easier construction of the [Game World](game-world) and in many cases are a prerequisite for [Reconfigurable Game Worlds](reconfigurable-game-world), as for example to control how [Shrinking Game Worlds](shrinking-game-world) are instantiated in many games."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-locations",
            "game-world",
            "reconfigurable-game-world"
        ],
        "modulates": [
            "shrinking-game-world"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "moveable-tiles",
            "drawing-stacks",
            "discard-piles",
            "card-hands"
        ],
        "conflicts": []
    }
}