{
    "name": "Tools",
    "texts": {
        "definition": "Tools are game elements that enable the players' Avatars and Units to perform actions otherwise unavailable to them.",
        "description": [
            "[Tools](tools) and the game elements that use them are separate entities and can exist independently of each other, allowing [Tools](tools) to be designed in such way that they can be picked up, dropped, destroyed, traded, and so on; that is, they do not have a fixed position in the [Game World](game-world)."
        ],
        "examples": [
            "Roleplaying games make most intense use of [Tools](tools), often in the form of weapons and armors to affect combat outcomes and gadgets (e. g., keys, ladders, mirrors) to overcome problems. Massively Multiplayer Online Roleplaying Games have expanded this further by requiring the use of various [Tools](tools) in the item production chains such games sometimes support."
        ],
        "usage": [
            "The fundamental characteristics of [Tools](tools) are the actions they support. They may be [Improved Abilities](improved-abilities) through increased in [Skills](skills), [New Abilities](new-abilities), and possibly [Privileged Abilities](privileged-abilities) that players do not have otherwise, or they may have [Extra-Game Consequences](extra-game-consequences).",
            "Several questions regarding the nature of the actions to provide are possible: Do they allow [Achilles' Heels](achilles-heels) of [Enemies](enemies) to be exploited? Do the [Tools](tools) allow [Controllers](controllers) to be used that otherwise would not be usable? Do they modify [Aim & Shoot](aim-shoot) actions?",
            "Depending on how actions of the [Tools](tools) have been set up, several other design choices need to be made: which [Units](units) or [Avatars](avatars) can use the [Tool](tools)? Does the use of the [Tool](tools) require specific skills or does it consume [Resources](resources)? Is there a limit on how long a time or how many times a [Tool](tools) can be used? Can [Tools](tools) be combined? Is there a limit on the amount of [Tools](tools) that can be carried? Are the [Tools](tools) available to a player when creating a [Character](characters) and giving it abilities? Can some [Tools](tools) be acquired directly after [Spawning](spawning)?",
            "Typically [Tools](tools) are [Pick-Ups](pick-ups), i. e., they exist as game elements in the [Game World](game-world) before being acquired. It is also possible to combine [Tools](tools) with other kinds of game elements such as [Helpers](helpers). If the [Tools](tools) are useful to several players, they promote [Competitions](competition) and [Races](race) if the players know the location of the [Tools](tools). However, it may or may not be possible to drop or trade a [Tool](tools) after it has been taken. If a [Tool](tools) is dropped when an [Avatar](avatars) or [Unit](units) carrying it is killed or destroyed, or if [Gain Ownership](gain-ownership) over other players [Tools](tools) is supported in the game design, the presence of [Tools](tools) promotes [Competition](competition) even after the [Tool](tools) has been acquired.",
            "[Tools](tools) can be used as goal objects in [Gain Ownership](gain-ownership) goals, especially if there is only one instance of the [Tool](tools) available and it is in a predetermined place. If the players can construct the [Tools](tools) themselves, which is common in games using [Converters](converters) in [Producer-Consumer](producer-consumer) chains, the knowledge of what [Tools](tools) to construct can be [Strategic Knowledge](strategic-knowledge). However, the production of the [Tool](tools) can require [Resources](resources) or knowledge, and gaining these may be used as goals in themselves using [Gain Ownership](gain-ownership) or [Gain Information](gain-information) goal patterns."
        ],
        "consequences": [
            "[Tools](tools) are game elements that provide actions within a [Consistent Reality Logic](consistent-reality-logic) and allow players means of having [Ownership](ownership) and performing [Transfer of Control](transferof-control) actions regarding these actions. They provide players with [Collecting](collecting) goals that directly give players [Illusion of Influence](illusionof-influence) or a [Perceived Chance to Succeed](perceived-chanceto-succeed).",
            "As [Tools](tools) can give [Privileged Abilities](privileged-abilities), they allow the fulfillment of [Gain Competence](gain-competence) goals but are also often [Rewards](rewards) of other goals. Further, as physical game elements, they can function as explicit goal objects and can be affected by the various actions and events in the [Game World](game-world). [Tools](tools) give the players the ability to affect what actions are available to them and in some cases to other players, for example, by giving the [Tool](tools) to another player."
        ]
    },
    "relations": {
        "instantiates": [
            "gain-competence",
            "illusionof-influence",
            "rewards",
            "perceived-chanceto-succeed",
            "new-abilities",
            "collecting",
            "improved-abilities"
        ],
        "modulates": [
            "avatars",
            "units",
            "characters",
            "gain-ownership",
            "spawning",
            "ownership",
            "skills",
            "consistent-reality-logic",
            "controllers"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "converters",
            "helpers",
            "privileged-abilities",
            "transferof-control"
        ],
        "conflicts": []
    }
}