{
    "name": "Trading",
    "texts": {
        "definition": "Players exchange some kind of Resource, be it information, actions, or game elements, between each other or the game system.",
        "description": [
            "\"Trading\" in its simplest form is an exchange of some kind of \"Resource\" between the buyer and the seller. The simplest way this can be achieved is when players buy something from the game system with an in-game currency, for example, gold coins in a fantasy adventure game. \"Trading\", however, always requires an incentive to do the exchanges. In most cases, this is achieved by requiring that different kinds of resources are required for player progress but that the basic production of the resources for the player is not balanced, thus giving players an incentive to trade surplus resources for resources they are lacking.",
            "\"Trading\" has three distinct phases: initiating the trade by making a trade offer, an optional bargaining phase, and finally resolving the exchange of the \"Resources\". The player initiating the trade usually has an option to cancel the trade at any point. \"Trading\" is usually a specific mode of play in the game and the different phases are sometimes distinct sub-modes of the trading."
        ],
        "examples": [
            "In \"Zelda: A Link to the Past\", the player can replenish his health and magic levels and acquire useful items, such as arrows and bombs, in shops in exchange for rupees. The rupees are used as the basic currency in the game, and they are gained by performing various short tasks in the game, such as navigating a maze in a certain time, and by killing wandering monsters.",
            "\"NetHack\", the classic dungeon crawl traditionally using ASCII-graphics, has different kinds of shops scattered around the dungeons. The player is able to buy different items, ranging from basic food rations to enchanted weapons and magic books, from the shops, and he is also able to sell items to the shop keeper. The basic currency used for such trades in the game is, not surprisingly, gold pieces.",
            "\"Settlers of Catan\", a famous German board game, has a specific trading phase where the player can trade the five basic resources of the game---lumber, wool, grain, bricks, and ore---with other players by announcing the resources he needs and what he is willing to give in return. The other players are also free to make their proposals and counter proposals to the player so the trade also has a bargaining phase. In this game, only the player whose turn it is can initiate trades, which means that the other players may not trade among themselves. There is also an option to trade with the game system, but then the trade usually has a worse return rate than in trades with other players and there is no possibility for bargaining. The trades in the game are open; that is, the other players see what kinds of trades are performed. The design of resource production in the games often make players have unequal production rates between the different resource types, but the progress---building roads, settlements, and cities and buying development cards---requires that the \"Resources\" are somewhat balanced."
        ],
        "usage": [
            "\"Trading,\" in its essence, is a \"Transfer of Control\". When introducing \"Trading\" in a game, one should decide reasons for players to want \"Ownership\" and reasons why they should wish to make exchanges with other players.",
            "One of the most effective incentives for \"Trading\" is to use \"Asymmetric Resource Distribution\", either through what \"Construction\" actions players can perform or what \"Resource Generators\" they have. This means that players will have a surplus of some \"Resources\" while lacking others. \"Symmetric Resource Distribution\" between players does in this case lessen the incentives for \"Trading\", but \"Symmetric Resource Distribution\" of \"Resources\" owned by one player can be used for progression in the game. In the case of multiplayer games, the resource distribution should, of course, be asymmetric between the players. For example, player one has surplus of resource A and lacks resource B, and player two has surplus of resource B and lacks resource A. Thus, both players need both kinds of resources in order to achieve their goals. A less common incentive for \"Trading\", found for example in the board game \"Advanced Civilization\", is to have basically \"Symmetric Resource Distribution\" but have \"Geometric Rewards for Investments\" on a single type of \"Resource\".",
            "One way to achieve asymmetry of \"Resources\" is to use \"Randomness\" for the resource generation and timing the progress requirements in such way that the randomness does not have time to even out. This method is used, for example, in \"Settlers of Catan\" for creating the incentive for \"Trading\". The optional trading with the game system in \"Settlers of Catan\" is introduced, first, to balance out possible radical asymmetries of resource generation for all players and, second, to avoid strategies for totally blocking player progression.",
            "The next step of designing \"Trading\" in a game is to determine the exact mechanisms of the three phases of trade: initiation of the trade, agreement in optional bargaining phase, and resolution of the trade, with potential exchanges of \"Resources\". The rules for the initiation phase dictate which players can start the trade, which players can be involved in the trade, and finally the circumstances that allow the initiation of the trade. The initiation usually also includes the announcement of either the \"Resources\" available for \"Trading\" or the \"Resources\" sought, or both. These are usually quite simple in single-player adventure games where usually only the player can initiate the trade and this is done by entering a specific area in the game; for example, a shop. The situation is more complex in multiplayer games allowing player-to-player \"Trading\". The clearest example is to have a specific \"Trading\" phase during the player's turn, where only the player whose turn it is can initiate the trades but all players can participate in the \"Trading\", as is the case in \"Settlers of Catan\". It is, of course, possible to allow also other players to initiate and perform \"Trading\" with each other during the same phase. Another possibility in this option is to allow players to invite certain other players to the \"Trading\" session or even to have \"Randomness\" in the player composition of the trade.",
            "Another common way of resolving this issue, especially in massively multiplayer online games, is to allow players to initiate trades at any time when located in certain places or in proximity to other players. Here, the question of which players are allowed to participate in the trade is a slightly more difficult issue to tackle: are all players welcome to participate in the trade or are there other mechanisms for excluding players? Free-for-all auctions in specific places seem to be the most common, as they are the simplest to implement. In some cases, there might be a considerable time difference between the initiation of the trade and the next phases, especially in free auctions.",
            "The bargaining or \"Negotiation\" phase is optional, as in some cases there is need for only simple mechanisms of accepting or refusing the trade offers. However in most cases, the bargaining phase is recommended, as it brings in more \"Social Interaction\" and also gives the players more control over the \"Trading\" situation. Bargaining consists of a series of offers and counter offers between the players participating in the trade. The information patterns can, and should, be used to control how much information about the other players bargaining is revealed, as this control will change the dynamics of the bargaining considerably. For example, when all offers and counter offers are known to the players participating in the trade, such knowledge will usually lead to a more dynamic and engaging bargaining phase compared to a situation where only the player who initiated the trade gets all the offers. The bargaining phase ends when one of the offers is accepted or that the initiating player cancels the whole trade.",
            "The resolving phase starts when the initiating player has accepted one of the offers. The simplest, and most usual, case is that the agreed \"Resources\" are simply exchanged between the players. This, however, does not need to be the case. First, it is possible to introduce a \"Betrayal\" in the trade, that is, one or both of the players give something else in return, usually nothing, than was agreed. This can of course be made impossible either by rules or by providing \"Symmetric Information\". Second, using \"Delayed Effects\" to have a time delay between the acceptance of the trade and the actual exchange and using \"Interruptible Actions\" give the other players and the game system a possibility to intervene in the actual trade, to either change the \"Resources\" in the exchange or, for example, to steal (\"Gain Ownership\") or destroy (\"Eliminate\") the \"Resources\" involved in the trade. Third, somewhat related to the previous ones, the players might be required to perform certain actions to fulfill the trade. The most common one is to require players to deliver (\"Delivery\") the \"Resources\" to each other. Resolving trades of actions and information is slightly trickier. The information exchange can use either \"Indirect Information\" or \"Direct Information\" patterns. \"Direct Information\" in this context means that the information is revealed to the player by the game system, for example, if the players trade information about their cards in a card game, they have to show the cards to each other. Trades of \"Indirect Information\" rely on the players to tell the required information to each other allowing \"Bluffing\". \"Bluffing\" is also possible in trades using \"Direct Information\" if the game system allows players to modify the information before it is revealed to other players. Trade of actions almost always relies on the players to really perform the required actions. The game system is usually not able to force a player to do the required actions, although in some cases, it is possible to trade the actions as normal \"Resources\". For example, in \"Settlers of Catan\", there are action cards that, when played, allow players to perform special actions otherwise not available, and players can trade these cards as well as other \"Resources\" in the game. Even though the game system would not force a player to perform the required actions, it can indicate the required actions as specific goals (\"Goal Indicators\") and it is possible that the system penalizes a player who does not perform the actions involved in the trade within an agreed \"Time Limit\"."
        ],
        "consequences": [
            "\"Trading\" gives players a \"Freedom of Choice\" to exchange \"Ownership\" of \"Resources\" through voluntary \"Transfer of Control\" actions. At long as the \"Resources\" are valuable or useful to some players, the possibility for several players to trade with a third party gives rise to \"Competition\". Although \"Trading\" is usually about game elements, it can also concern \"Area Control\".",
            "When enacted between players, especially when there is a possibility for \"Negotiations\", \"Trading\" involves \"Social Interaction\" and is a \"Collaborative Action\". Even the somewhat marginal case of totally anonymous auction has, although quite low, \"Social Interaction\" in the initiation phase where the seller announces the \"Resources\" he is selling and what he is expecting in return. More often, however, \"Trading\" is used to increase the amount of \"Social Interaction\" between the players in the game, and it can be seen as a form of \"Cooperation\".",
            "\"Trading\" usually gives the players alternative strategies for progressing in the game and can be used for balancing the \"Resource\" flows within the game as is quite obvious in the \"Settlers of Catan\" example. Allowing players to buy \"Power-Ups\" from the game system in exchange for some basic currency gives player \"Freedom of Choice\" as to how to progress in the game. Also, rare or difficult-to-obtain special \"Power-Ups\" for sale at a high price give the player \"Optional Goals\" and, at least in some cases, an incentive for players to keep on doing repetitive tasks, such as killing wandering monsters, thus making the play time of the game longer.",
            "Demanding ransom and giving gifts are special cases of \"Trading\". Ransom is an exchange of \"Resources\", usually very concrete ones, for future action, such as releasing a prisoner. Gifts are one-sided trades where the giving side does not expect anything in return. The recipient, of course, can also refuse the gift. Both these cases follow the same interaction principles as \"Trading\" in general. Demanding ransom or proposing to give a gift are the same as initiating a trade, and this can be followed by a bargaining phase (more often in ransom than in gift cases), which can finally end in resolving the exchange or canceling the whole transaction."
        ]
    },
    "relations": {
        "instantiates": [
            "competition",
            "freedom-of-choice",
            "area-control",
            "transfer-of-control",
            "social-interaction"
        ],
        "modulates": [
            "optional-goals",
            "delayed-reciprocity",
            "gain-ownership",
            "cooperation",
            "resources",
            "ownership",
            "power-ups"
        ],
        "instantiated_by": [
            "collaborative-actions",
            "resource-generators",
            "construction"
        ],
        "modulated_by": [
            "direct-information",
            "delivery",
            "indirect-information",
            "time-limits",
            "negotiation",
            "asymmetric-resource-distribution",
            "symmetric-resource-distribution",
            "betrayal",
            "interruptible-actions",
            "bluffing",
            "symmetric-information",
            "geometric-rewards-for-investments",
            "rewards"
        ],
        "conflicts": [
            "symmetric-resource-distribution"
        ]
    }
}