{
    "name": "Trans-Game Information",
    "texts": {
        "definition": "Information that is passed from one game session to another game session.",
        "description": [
            "Some of the information in games is used or usable in other games. This form of information is called \"Trans-Game Information\" as it moves from one game to another. The information can be parts of the game state, information about how to perform actions, what events occur in the game, or simply who won the game."
        ],
        "examples": [
            "the system of handicap in both \"Golf\" and \"Go\" is \"Trans-Game Information\" that is used not only to let players of different skill levels to compete against each other but also allow players to rank themselves.",
            "the results of individual games in a tournament are past to the tournament itself. Sometimes only who won the game is used to affect the tournamentbut often also the actual result in recorded as well to function as tiebreakers."
        ],
        "usage": [
            "\"Trans-Game Information\" can either be used to affect \"Meta Games\", different games, or other game instances of the same game. In all these cases the information spread can be about specific games states while in the last in can also be about the game design. When the information concerns the game design, it can either be rules and how to perform specific actions, where \"Easter Eggs\" exists, or how the \"Narrative Structure\" is constructed, the latter ruining \"Surprises\" and \"Unknown Goals\". As discovering \"Easter Eggs\" and experiencing designed \"Surprises\" is an automatic form of \"Trans-Game Information\" for players when they replay a game, the events are a form of \"Irreversible Actions\" across game instances and lessen the potential for \"Replayability\". \"Public Information\" is by its nature the information that is most likely to spread between games as all players have access to it through intermediates, but the value of what is otherwise \"Imperfect Information\" (such as where \"Easter Eggs\" exist) can be more valuable. However, the spreading of \"Trans-Game Information\" can make any form of information into \"Public Information\" unless the channels used to pass the information is restricted.",
            "Information about game states are usually \"Handles\" and \"Scores\" linked to player results in order to support \"Highscore Lists\" and other means of giving \"Social Status\" to \"Game Mastery\". This information can be used to support \"Handicap\" systems and training against \"Ghosts\". The possibility to compete against others through \"Highscore Lists\" or \"Ghosts\" is a way to increase the \"Replayability\" value of games, especially \"Single-Player Games\". \"Trans-Game Information\" about game states can also be used to make the inner games of \"Games within Games\" affect the outer games and thereby make them into a form of \"Meta Games\".",
            "\"Tournaments\" make extensive use of \"Trans-Game Information\" and do not work without at least the passing of information about \"Handles\" and the main outcome of the individual games. A more specific way to use \"Trans-Game Information\" in \"Tournaments\" is when a game is played back-to-back with players changing roles. In these cases, the \"Score\" by which one player won the previous game is used as the value which the other player must win by to win the \"Tournament\"."
        ],
        "consequences": [
            "As the spreading of \"Trans-Game Information\" can have consequences that are not defined within the game state in which they originated they can create \"Extra-Game Consequences\". \"Trans-Game Information\" allows individual players to build \"Strategic Knowledge\" between game sessions and \"Game Mastery\" in games depending on such knowledge, thereby promoting \"Replayability\". When the information is regarding players' achievements, it gives a basis to instantiate \"Handicaps\" in specific game instances and give \"Social Status\" when the \"Trans-Game Information\" is available to other people to observe. The use of \"Save-Load Cycles\" can be seen as using \"Trans-Game Information\" to ease the completion of challenges or goals, if the abandoned play sessions are considered separate part of separate game sessions.",
            "In games with \"Character Development\" and \"Never Ending Stories\", typically roleplaying games, the information about the \"Characters\" are a form of \"Trans-Game Information\" as players may not know if a finished play session also signifies the end of the game session, and may regard the next play session as a new game session.",
            "\"Storytelling\" about gameplay is a special form of \"Trans-Game Information\" that is communicated unrestricted by the game design and that allows \"Social Status\" to be earned, \"Strategic Knowledge\" to be passed and \"Roleplaying\" to be enacted."
        ]
    },
    "relations": {
        "instantiates": [
            "social-statuses",
            "strategic-knowledge",
            "irreversible-actions",
            "game-mastery",
            "extra-game-consequences"
        ],
        "modulates": [
            "handicaps",
            "character-development",
            "never-ending-stories",
            "narrative-structures",
            "public-information"
        ],
        "instantiated_by": [
            "high-score-lists",
            "strategic-knowledge",
            "tournaments",
            "score",
            "ghosts",
            "easter-eggs",
            "replayability",
            "handles",
            "save-load-cycles",
            "meta-games",
            "games-within-games"
        ],
        "modulated_by": [
            "storytelling",
            "public-information",
            "imperfect-information"
        ],
        "conflicts": [
            "surprises",
            "replayability",
            "unknown-goals"
        ]
    }
}