{
    "name": "Turn-Based Games",
    "texts": {
        "definition": "The players take turns to make their actions to change the game state, and the progress of game time is not tied to the real time.",
        "description": [
            "The progress of game time in [Turn-Based Games](turn-based-games) is not directly linked to real time, and it may be up to the players to pace the game."
        ],
        "examples": [
            "In \"Chess\", the players take turns to move their pieces on the board. In the basic variant, there is no strict time limit for the players to execute their turns apart from social pressure exerted by the other player.",
            "\"Laser Squad Nemesis\" and the \"Combat Mission\" serie offer the players modes for hot-seating, switching the player whose turn it is, and sending the turn information via e-mail to the other player."
        ],
        "usage": [
            "[Turn-Based Games](turn-based-games) may be easily changed to [Tick-Based Games](tick-based-games) by simply introducing [Time Limits](time-limits) to the players' [Turn Taking](turn-taking). [Turn-Based Games](turn-based-games) can be supported by [Dedicated Game Facilitators](dedicated-game-facilitators), especially when the turn is resolved simultaneously, but they are also at least partly [Self-Facilitated Games](self-facilitated-games), as completing the turn requires effort from the players, distinct from the actual gameplay.",
            "[Combat](combat) and [Capture](capture) in [Turn-Based Games](turn-based-games) compared to [Real-Time Games](real-time-games) requires more of players cognitive skills, as they have more time to think, and the [Timing](timing) of actions in [Combat](combat) and [Capture](capture) require more [Puzzle Solving](puzzle-solving) skills than skills in [Dexterity-Based Actions](dexterity-based-actions).",
            "Some [Turn-Based Games](turn-based-games) allow players to pass their turn without making any actions, in principle, making one big [No-Op](no-ops) action. The actions available to the players during their turn can vary from simple pre-specified actions (such as roll a die and move) to complex action sequences with [Budgeted Action Points](budgeted-action-points). An interesting alternative is to have [Asymmetric Abilities](asymmetric-abilities) that rotate out of sync with the turns. Also in some games, these action sequences can have characteristics of [Real-Time Games](real-time-games) such as [Maneuvering](maneuvering), although these have otherwise contradictory characteristics."
        ],
        "consequences": [
            "[Turn-Based Games](turn-based-games) almost always have [Downtime](downtime) when the other players have to wait for the active player's turn to terminate during the [Game Pauses](game-pauses) for [Turn Taking](turn-taking), especially in [Synchronous Games](synchronous-games). This effect of [Downtime](downtime) in [Asynchronous Games](asynchronous-games) is often less drastic, as the players have a possibility of some action other than waiting for the other players to complete their turns. It is possible, however, to limit the effects of this [Downtime](downtime) by having the players plan and execute their actions at the same time, and the actions are resolved simultaneously when the players have submitted their actions. If the [Turn Taking](turn-taking) is sequential, there are [Role Reversals](role-reversal) when the players change their modes of play from active to passive."
        ]
    },
    "relations": {
        "instantiates": [
            "role-reversal",
            "downtime"
        ],
        "modulates": [
            "combat",
            "synchronous-games",
            "asynchronous-games",
            "asymmetric-abilities",
            "capture"
        ],
        "instantiated_by": [
            "turn-taking"
        ],
        "modulated_by": [
            "budgeted-action-points",
            "timing",
            "puzzle-solving",
            "dedicated-game-facilitators",
            "game-pauses"
        ],
        "conflicts": [
            "maneuvering"
        ]
    }
}