{
    "name": "Uncertainty of Information",
    "texts": {
        "definition": "The information available to the player may have different levels of reliability",
        "description": [
            "Many games give players information but of a kind, or through a medium, that makes their correctness uncertain. This is not the same as not knowing the specific details of a part of the game state or even knowing that a part of the game state exists. It is rather that the player cannot trust the information completely due to the manner in which he or she received the information."
        ],
        "examples": [
            "In \"Diplomacy\", the current game state is known to all players, but as the player actions are revealed simultaneously, there is a level of uncertainty as to what the other players are going to do during the game round and ultimately what is going to be the outcome. This seems to be in conflict with the previous statement that information patterns only govern the current game state, but as the players in \"Diplomacy\" have to write down their orders before the resolution phase, they then become part of the whole game state."
        ],
        "usage": [
            "The prime design requirement for \"Uncertainty of Information\" about game elements is to de-couple the spreading of information from the game element that carries the information. As soon as information about a specific part of the game state can be spread without simultaneously revealing that part of the game state, \"Uncertainty of Information\" is possible. This is especially unavoidable when sending \"Indirect Information\", which loses accuracy when translated, but uncertainty can also be achieved by sending \"Direct Information\" that has been tampered with or has been sent through a distorting medium. An illustrating example of \"Indirect Information\" in this sense is the use of white and black pegs in \"Mastermind\" to show the level of correctness of guesses without relying on the actual pegs to show the correct answer.",
            "Actions and goals that can be chosen without requiring the consumption of game elements naturally have an \"Uncertainty of Information\" about them, allowing for \"Unknown Goals\" and secret tactics. However, by designing game elements that control what actions or goals players may or may not use, the \"Uncertainty of Information\" may be limited. An action or event with \"Delayed Effect\" can be a source for \"Uncertainty of Information\" in itself.",
            "\"Uncertainty of Information\" can be either based on un-mediated \"Social Interaction\" or be supported by the mechanics of the game. The first case is more difficult for the game designer to modulate but offers players the chance of gaining \"Extra-Game Information\" by reading the body language of the other players. Examples include \"Poker\" and \"Diplomacy\". The second case can be achieved in several ways: through \"Communication Channels\" that are not limited by the correctness of the information sent, through the design of the game elements used to pass information so that \"Imperfect Information\" is achieved (e. g., the markers in \"Space Hulk\" that indicate one, two, or three genestealers), or through unreliability in the game elements used by a player to collect information, e. g., having game elements with actions that collect information but have an evaluation function that contains \"Randomness\".",
            "Patterns that provide players with information about the consequences of players' actions, e. g., \"Status Indicators\", \"Outcome Indicators\",\"Progress Indicators\", and \"Goal Indicators\", naturally limit \"Uncertainty of Information\". However, one way to combine an indicator with the pattern is to show players the accuracy of information as part of an indicator. Possible examples of this use of explicit accuracy levels include indicating only the presence of enemy units but not their type or statements along the line of \"The enemy unit is in this position with a certainty of 80\\%.\"",
            "\"Uncertainty of Information\" can be applied on \"Perfect Information\" and even \"Direct Information.\" By falsely indicating that information may be wrong or by introducing \"Red Herrings\", the player may be tricked into not relying on correct information."
        ],
        "consequences": [
            "\"Uncertainty of Information\" is tightly connected to \"Imperfect Information\"; one of them is required for \"Secret Alliances\" to be able to exist, and both can be the basis for \"Gain Information\" and \"Exploration\" goals. While \"Uncertainty of Information\" concerns how reliable the medium and representation of the information are, \"Imperfect Information\" deals with information possessed by the players. When information exchange is performed in such way that the players can have information about the exchange itself, \"Uncertainty of Information\" can be the effect of \"Imperfect Information\". An example of this is when information is exchanged through the explicit exchange of game elements and players have \"Imperfect Information\" about which game element has been passed.",
            "Basically all games with \"Asymmetric Information\" between players that allow some form of \"Negotiation\" support \"Uncertainty of Information\", as the players themselves can be an unreliable medium. However, any \"Communication Channel\" that similarly supports transferal of \"Indirect Information\" can be a source of uncertainty. The presence of the pattern forces players to make decisions without being sure about the conditions that influence the decision, something that can heighten \"Tension\" if the decisions are important. To some players, the \"Uncertainty of Information\" is also perceivable as \"Randomness\".",
            "Different levels of reliability of information give rise to another level of uncertainty players have to take into account when deciding further actions. Depending on the level of \"Predictable Consequences\", this can either promote \"Analysis Paralysis\" or give \"Limited Planning Ability\". When the \"Uncertainty of Information\" is mainly about the game state values connected to other players, this may limit the potential of succeeding with \"Interferable Goals\" or even \"Conflict\"."
        ]
    },
    "relations": {
        "instantiates": [
            "secret-alliances",
            "secret-resources",
            "tension",
            "limited-planning-ability"
        ],
        "modulates": [
            "predictable-consequences",
            "unknown-goals",
            "delayed-effects",
            "outcome-indicators"
        ],
        "instantiated_by": [
            "indirect-information",
            "exploration",
            "communication-channels",
            "imperfect-information",
            "gain-information"
        ],
        "modulated_by": [
            "randomness"
        ],
        "conflicts": [
            "conflict",
            "direct-information",
            "status-indicators",
            "interferable-goals",
            "perfect-information",
            "goal-indicators",
            "progress-indicators",
            "outcome-indicators"
        ]
    }
}