{
    "name": "Uncommitted Alliances",
    "texts": {
        "definition": "The players have a possibility to start and end alliances without direct in-game investments or risking penalties.",
        "description": [
            "[Uncommitted Alliances](uncommitted-alliances) are typically alliances which players form outside the game system and are thereby are not explicitly formed through game actions. There are, however, games in which the alliances have to be explicitly stated within the game but can still be undone without direct penalties. There are, however, usually penalties involved with such a breach of agreement, but these are dictated by how the breach affects the player relations during the later play."
        ],
        "examples": [
            "in \"Diplomacy\" basically all agreements between players are [Uncommitted Alliances](uncommitted-alliances) as there are no in-game penalties involved in case players leave the alliances, and the dynamics of the game play are built on this premise. If players agree not to attack each other during one game year and one of the players attacks anyway, the penalty of this breach of agreement depends on the other players as the game rules do not inflict any such penalties."
        ],
        "usage": [
            "The extra requirements of [Uncommitted Alliances](uncommitted-alliances) compared to ordinary [Alliances](alliances) are that there should be no investments required to start an alliance and that breaking the alliance is just a matter of not conforming to the agreement; that is, there are no direct, rule-governed penalties involved in breaking [Uncommitted Alliances](uncommitted-alliances). This also means that the players are given a possibility of [Betrayal](betrayal). The player breaking the alliance of course loses the trust of at least the former members of the alliance and they also might decide to punish the player through new [Uncommitted Alliances](uncommitted-alliances).",
            "[Uncommitted Alliances](uncommitted-alliances) are usually emergent rather than designed but normally arise due to players wanting to influence [Predictable Consequences](predictable-consequences). The two most common cases are through players want to gang up against perceived leaders to enforce [Balancing Effects](balancing-effects) or through perceived [Hovering Closures](hovering-closures) of goals that allow [Shared Rewards](shared-rewards) or have [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties). A special case is when players can notice that they are about to have a [Tied Result](tied-results) and decide not to compete in order to focus on other areas of the game. This is of course not possible when [Tiebreakers](tiebreakers) are used."
        ],
        "consequences": [
            "The possibility of having [Uncommitted Alliances](uncommitted-alliances) in the game naturally creates more dynamic relationships between players and usually also leads to more [Social Interaction](social-interaction) in the form of [Negotiations](negotiation). That alliances can be broken without direct [Penalties](penalties) creates a new level of [Tension](tension) of trust between the players. This requires [Risk/Reward](risk-reward) judgments to be made before entering the [Uncommitted Alliance](uncommitted-alliances) and may make the entering into such an [Alliance](alliances) into a \"Leap of Faith\".",
            "[Uncommitted Alliances](uncommitted-alliances) naturally create [Dynamic Alliances](dynamic-alliances) as the alliances have a tendency to be dynamic, i. e. they appear and disappear depending on the game situation. This characteristic can also make the formation of [Social Organizations](social-organizations) difficult. [Uncommitted Alliances](uncommitted-alliances) usually cluster around [Delayed Reciprocity](delayed-reciprocity) situations."
        ]
    },
    "relations": {
        "instantiates": [
            "leapsof-faith",
            "risk-reward",
            "tension"
        ],
        "modulates": [
            "alliances",
            "balancing-effects",
            "social-interaction"
        ],
        "instantiated_by": [
            "predictable-consequences",
            "tied-results",
            "betrayal",
            "shared-rewards",
            "delayed-reciprocity",
            "hovering-closures"
        ],
        "modulated_by": [
            "penalties",
            "dynamic-alliances",
            "negotiation"
        ],
        "conflicts": [
            "social-organizations",
            "tiebreakers"
        ]
    }
}