{
    "name": "Unknown Goals",
    "texts": {
        "definition": "Goals initially, or currently, unknown to players.",
        "description": [
            "[Unknown Goals](unknown-goals) are goals that players are currently not aware of. The [Unknown Goals](unknown-goals) can either be goals that players themselves will have to fulfill later to win or complete the game, or can be goals that the other players are trying to complete but have no knowledge about. Some [Unknown Goals](unknown-goals) may be revealed during gameplay while others at the end of the game. In some cases these goals are never revealed and it may be the case that other alternatives may have to be chosen when replaying the game to reveal the [Unknown Goals](unknown-goals)."
        ],
        "examples": [
            "The collectable card game \"Illuminati New World Order\" has known goals which all players have, but also allows individual players to have goal cards which gives individual players goals that unknown to the other players.",
            "Most adventure games start by providing the players with an overarching goal which motivates the players to complete the game. However, the different subgoals that have to be completed before the main goal is completed are usually unknown, as knowing these would ruin many of the surprises in the narrative."
        ],
        "usage": [
            "Designing [Unknown Goals](unknown-goals) consists primarily of determining to whom the goals should be unknown and in what ways players can gain knowledge about them. Determining what players should be aware of the [Unknown Goal](unknown-goals) is basically a question of deciding whether players should have [Asymmetric Information](asymmetric-information), i. e. some players knowing of the goal and others not knowing it, or players should have [Symmetric Information](symmetric-information), i. e. all players being equally unaware of the goal. A possible additional design choice is whether to try and make the [Unknown Goals](unknown-goals), if possible, unknown even when replaying the game. Achieving the last option can be done using [Dedicated Game Facilitators](dedicated-game-facilitators) or [Ephemeral Goals](ephemeral-goals), and increase [Replayability](replayability) but may limit the possible build-up of [Strategic Knowledge](strategic-knowledge).",
            "The most common way of informing players of their own [Unknown Goals](unknown-goals) is as [Rewards](rewards) for the completion of other goals, either as direct answers in [Gain Information](gain-information) goals or as developments in the [Narrative Structure](narrative-structures). [Clues](clues) may be used to give players [Indirect Information](indirect-information) about the [Unknown Goals](unknown-goals), and [Downtime](downtime) may give players time to figure out both their own and others' [Unknown Goals](unknown-goals) without being penalized for not focusing on gameplay.",
            "Players usually learn about other players' [Unknown Goals](unknown-goals) when the goals are completed or cannot any longer be completed, although this is not necessary when there is a computerized or dedicated human [Dedicated Game Facilitator](dedicated-game-facilitators). In these cases, the closure may be totally secret to the other players, even after the end of the game, or the other players may receive [Imperfect Information](imperfect-information) that the closure has occurred but not the exact nature of the [Reward](rewards) or [Penalty](penalties).",
            "To make the discovery of other players' unknown goals during gameplay, the game design can either include [Asymmetric Information](asymmetric-information) or [Uncertainty of Information](uncertaintyof-information). The first case, using [Asymmetric Information](asymmetric-information), requires that the system contains information what goals the players have (through [Predefined Goals](predefined-goals) or [Committed Goals](committed-goals)) while the second case can use information in the game or by supporting the observation of the other players' actions. Games that make use of computers or dedicated (non-playing) people as game facilitatorscan reveal the [Unknown Goal](unknown-goals) without informing the other players, creating additional levels of [Gain Information](gain-information) goals concerning if other players have succeeded with their [Gain Information](gain-information) goals."
        ],
        "consequences": [
            "Gaining knowledge about [Unknown Goals](unknown-goals) is typically [Surprises](surprises) and can force [Planned Character Development](planned-character-development) to be modified. If they are revealed at the same time as they are completed this may cause additional [Surprises](surprises) due to the unexpected [Rewards](rewards). If player are aware of the existence of the goals they have to complete in a game but not the nature of the goal, [Unknown Goals](unknown-goals) in a game naturally provides a [Hierarchy of Goals](hierarchyof-goals) with the [Gain Information](gain-information) as a subpattern to the [Unknown Goal](unknown-goals) itself. This is a common way to build the [Narrative Structure](narrative-structures) in mystery games, often using [Clues](clues) to support the [Gain Information](gain-information) goals. The [Tension](tension) in a game can be increased if [Unknown Goals](unknown-goals) become [Committed Goals](committed-goals) by the players' actions.",
            "A similar hierarchy exists if the player knows of the existence of other players' goals but these are [Unknown Goals](unknown-goals), since there may either exist a [Preventing Goal](preventing-goals) to the [Unknown Goal](unknown-goals) or exist a [Gain Information](gain-information) goal that gives [Strategic Knowledge](strategic-knowledge). [Turn Taking](turn-taking) and other [Downtime](downtime) when players can observe each others actions allow possibilities to try to figure out each others [Unknown Goals](unknown-goals) in [Competition](competition) situations.",
            "[Unknown Goals](unknown-goals) that are also [Predefined Goals](predefined-goals) can restrict [Replayability](replayability) since they are no longer unknown when playing the game a second time. Similarly, if [Unknown Goals](unknown-goals) are used to create [Surprises](surprises) when unfolding a [Narrative Structure](narrative-structures) using [Dynamic Goal Characteristics](dynamic-goal-characteristics), these goals will be known when playing the game again, which may work against [Replayability](replayability). Both these cases can be mitigated by having [Ephemeral Goals](ephemeral-goals) or by having \"Selectable Set of Goals\" which allow alternative gameplay experiences to unfold by selecting novel choices.",
            "Games that allow goals that are initially unknown to the other players but which can be revealed later can put the player having the goal at a significant disadvantage. This promotes [Tension](tension) and [Risk/Reward](risk-reward) but if this is not desirable [Ephemeral Goals](ephemeral-goals) or \"Selectable Set of Goals\" can be used to let the player to choose new goals.",
            "Although [Predefined Goals](predefined-goals) may be [Unknown Goals](unknown-goals) the first time a game is played, they are not so in following game instances, nor are they from the beginning if players have received [Trans-Game Information](trans-game-information) about them."
        ]
    },
    "relations": {
        "instantiates": [
            "surprises",
            "gain-information"
        ],
        "modulates": [
            "hierarchyof-goals",
            "strategic-knowledge",
            "committed-goals",
            "competition",
            "ephemeral-goals",
            "rewards",
            "planned-character-development"
        ],
        "instantiated_by": [
            "conceal",
            "dynamic-goal-characteristics",
            "dedicated-game-facilitators",
            "imperfect-information"
        ],
        "modulated_by": [
            "selectable-setsof-goals",
            "clues",
            "uncertaintyof-information",
            "asymmetric-information",
            "narrative-structures",
            "downtime",
            "turn-taking"
        ],
        "conflicts": [
            "predefined-goals",
            "replayability",
            "symmetric-goals"
        ]
    }
}