{
    "name" : "Achievements",
    "categories" : [
        "Achievement Patterns",
        "Patterns",
        "Meta Patterns"
    ],
    "texts" : {
        "definition" : "Goals whose fulfillment is stored outside the scope of individual game sessions.",
        "markups" : [
            "<style=\"Definition\">Goals whose fulfillment is stored outside the scope of individual game sessions.</style>",
            "Completing a game or winning over adversaries can often provide enough encouragement for people to play a game if they find the core gameplay mechanics interesting. However, sometimes this is not enough nor does this necessarily motivate people to test all ways of playing a game that it provides. For these cases, <style=\"CurrentLink\">Achievements</style> can be used. Becoming popular after the development of the web, these are various forms of records of things a player has done while playing the game which is accessible outside any given specific game instance, typically not stored on a player's own computer and publicly viewable through the internet.",
            "The most basic form of <style=\"CurrentLink\">achievement</style> is a reward for completing some goal in the game that is necessary for completing the whole game. While these measure how far players have gotten in the game, others are awarded for playing in a more difficult way or testing optional activities. Some achievements are also awarded for perseverance in that are only given for performing a certain task or actions for a great number of times. For an alternative categorization of <style=\"CurrentLink\">Achievements</style> than the one found here, see the three-part article series at Gamasutra by Lucas Blair.",
            "<style=\"H3\">Examples</style>",
            "<style=\"CurrentLink\">Achievements</style> schemes are often developed by platform developers rather than individual game developers, and supporting them may or may not be required to be allowed to release games on them. Both PlayStation 3 and the Xbox 360 console platforms provide <style=\"CurrentLink\">Achievement</style> support through PSN trophies and Gamerscore system respectively (the latter also working with Games for Windows titles), and require the developers use them. Valve Software uses Steam Achievements to provide similar functionality but does not require games to make use of it.",
            "As of late 2010, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Left%204%20Dead%202\">Left 4 Dead 2</link></style> in the <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Left%204%20Dead%20series\">Left 4 Dead series</link></style> supports 65 <style=\"CurrentLink\">Achievements</style> but based on earlier history this is likely to increase with further expansions. While several of these are rewarded for completing campaigns (e.g. <i>Midnight Rider</i> and <i>Weatherman</i>), others can be gained by completing ephemeral goals many times (e.g. <i>Cache Grab</i>  and <i>Shock Jock</i>). Some goal related <style=\"CurrentLink\">Achievements</style> require specific weapons to be used (e.g. <i>Chain of Command</i> and <i>Tank Burger</i>) while others require especially good successes (e.g. <i>Long Distance Carrier</i> and <i>Wing and a Prayer</i>) or doing actions in specific circumstances (e.g. <i>A Spittle Help from my Friends</i> and <i>Kill Bill</i>). Others still make gameplay more difficult by adding additional goals (e.g. <i>Gong Show</i> and ''Guardin' Gnome<i>) or requiring a self-imposed handicap (e.g. </i>Confederacy of Crunches<i> and </i>Bridge over Trebled Waters<i>). To motivate players to explore some of the alternative ways of playing the game, there are also several achievements for this (e.g. </i>Mutant Overlord<i> and </i>Port of Scavenge'').",
            "The class-based <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Team%20Fortress%202\">Team Fortress 2</link></style> has many different types of <style=\"CurrentLink\">Achievements</style>. Some are possible to acquire regardless of which class one plays (e.g. <i>Batter Up</i>, and <i>Firefighter</i>) while other require you to play specific classes (e.g. <i>Team Doctor</i> and <i>Hot on Your Heels</i>). Others encourage players to dedicatedly play a class and collect <style=\"CurrentLink\">Achievements</style> for that class (e.g. <i>Sniper Milestone 1</i>, <i>Sniper Milestone 2</i>, and <i>Sniper Milestone 3</i>) while other yet pull players towards testing all ways of playing the game (e.g. <i>Head of the Class</i>). Other still motivate players to enact actions that help teamplay (e.g. <i>Land Grab</i> ) or cause more unusual events (<i>A Cut Above</i> and <i>OMGWTFBBQ</i>).",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Fallout:%20New%20Vegas\">Fallout: New Vegas</link></style> provides both <style=\"CurrentLink\">Achievements</style> for completing quests (e.g. ''Ain't That a Kick in the Head<i> and </i>Arizona Killer<i>) and for performing certain actions enough times (e.g. </i>Lead Dealer<i> and </i>Master of the Mojave<i>). To encourage players to test the gambling mini-games within the main game one <style=\"CurrentLink\">Achievement</style> for each exists (</i>Double Down<i>, and </i>One Armed Bandit<i>). The <style=\"CurrentLink\">Achievement</style> </i>Ol' Buddy Ol' Pal<i>, which is awarded for recruiting a companion, could be seen as a reward for reaching a goal but since the goal is easily achieved when a player is made aware of the possibility, it is arguably more a reward for being willing to test having a companion. Those electing to complete the game with additional demands on handling sleep deprivation and a need to consume food and water are rewarded with the  </i>Hardcore'' <style=\"CurrentLink\">Achievement</style>.",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Torchlight\">Torchlight</link></style> rewards completion of quests through achievements such as <i>Purple People Defeater</i> and <i>Beast Slayer I</i>, and additionally rewards players that have complete the game on hard or very hard levels with <i>Beast Slayer II</i> and <i>Beast Slayer III</i>. Similarly, those who have played in the hardcore mode can get specific achievements (e.g. <i>Hardcore Victor</i> and <i>Hardcore Hero</i>) and those that have completed the game quickly can get others still (<i>Swift Execution</i> and <i>Speed King</i>). Besides these goal related <style=\"CurrentLink\">Achievements</style>, the game also provides <style=\"CurrentLink\">Achievements</style> for testing some of the optional gameplay (e.g. <i>Fetch a Fair Price</i>  and <i>Mod Squad</i>) or performing simple tasks many times (e.g. 'Walkabout<i>, </i>Gambling Addict<i>, and </i>Angler'').",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Assassin's%20Creed%202\">Assassin's Creed 2</link></style> has several achievements for completing parts of the storyline (e.g. <i>Exit the Son</i>, <i>Bloody Sunday</i>, and <i>The Prophet</i>). Others are provided for completing optional goals (e.g. <i>Myth Maker</i> and <i>Vitruvian Man</i>) or simple ones several times (e.g. <i>Street Cleaner</i>, <i>Kleptomaniac</i>, and <i>I like the view</i>). Especially good performances of actions, or combos, are rewarded with other <style=\"CurrentLink\">Achievements</style> (e.g. <i>Messer Sandman</i>, <i>Sweeper</i>, <i>No-Hitter</i>, <i>Doctor</i>).",
            "The expansion <i>Wrath of the Lich King</i> introduced <style=\"CurrentLink\">Achievements</style>  to <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/World%20of%20Warcraft\">World of Warcraft</link></style>. Of the over 700 introduced,  many include completing dungeons and raids (e.g. <i>Blackfathom Deeps</i>, <i>Uldaman</i>, and ''Zul'Gurub<i>) while others are rewarded for participating in special events or testing features of the game (</i>I Found One!<i> for collecting an egg during the </i>Noblegarden<i> event and </i>Represent<i>, </i>Shave and a Haircut<i>, and </i>Dual Talent Specialization<i> for testing various features). A large part of the achievements are awarded for either repeatedly succeeding with smaller goals (e.g. </i>Got My Mind On My Money<i>, </i>Honorable Kills<i>, and </i>Stable Keeper<i>) or for collecting sets of <style=\"CurrentLink\">Achievements</style> (e.g. </i>Explore Eastern Kingdoms<i> and </i>Classic Dungeonmaster'').",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/FarmVille\">FarmVille</link></style> names its <style=\"CurrentLink\">Achievements</style> ribbons and has four levels for each type of ribbon (yellow, white, red, and the most challenging blue). They are awarded a multitude of things: collecting animals (<i>Zoologist</i> and for unique animals ''Noah's Ark<i>), getting building (</i>Architect<i>), buying items at the market (</i>A Pretty Penny<i>), selling crafted items to friends (</i>Super Salesman''), and changing one's avatar's appearance daily (<i>Looking Fresh</i>).",
            "On Steam, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Civilization%20V\">Civilization V</link></style> has 138 unlockable <style=\"CurrentLink\">Achievements</style>.",
            "<style=\"H2\">Using the pattern</style>",
            "Being used to impartially store records of particular <style=\"Link\"><link=\"gameplay-statistics\">Gameplay Statistics</link></style> between game instances, <style=\"CurrentLink\">Achievements</style> need <style=\"Link\"><link=\"dedicated-game-facilitators\">Dedicated Game Facilitators</link></style>. Several sub-categories of Achievements exist and one starting point for including them in a game design is to consider one of these. <style=\"Link\"><link=\"goal-achievements\">Goal Achievements</link></style> are those that are awarded by successfully completing <style=\"Link\"><link=\"optional-goals\">Optional</link></style> or <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Enforced%20Goals\">Enforced Goals</link></style>. Related to this, <style=\"CurrentLink\">Achievements</style> may be used to reward and document the fulfillment of <style=\"Link\"><link=\"ephemeral-goals\">Ephemeral Goals</link></style> which typically otherwise go unnoticed (except for maybe preventing other goals to have succeeded). <style=\"Link\"><link=\"testing-achievements\">Testing Achievements</link></style> are those that are given simply for players trying some action in the game, and can be a way for game designers to encourage players both to learn how to play and to engage in <style=\"Link\"><link=\"experimenting\">Experimenting</link></style>. <style=\"Link\"><link=\"handicap-achievements\">Handicap Achievements</link></style> are those given to players for completing goal with self-imposed penalties, e.g. having the <style=\"Link\"><link=\"difficulty-levels\">Difficulty Levels</link></style> as difficult as possible or using a limited range of disadvantageous weapons. The <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Left%204%20Dead%20series\">Left 4 Dead series</link></style> have both these types of <style=\"Link\"><link=\"handicap-achievements\">Handicap Achievements</link></style> in the second installment: <i>Still Something To Prove</i> for completing all <style=\"Link\"><link=\"campaigns\">Campaigns</link></style> on the expert <style=\"Link\"><link=\"difficulty-levels\">Difficulty Level</link></style> and <i>Tank Burger</i> for killing the <style=\"Link\"><link=\"boss-monsters\">Boss Monster</link></style> known as a Tank using only melee weapons. <style=\"Link\"><link=\"ragequitting\">Ragequitting</link></style> is a uncommon and possibly controversial reason for providing <style=\"CurrentLink\">Achievements</style>. Even so, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Team%20Fortress%202\">Team Fortress 2</link></style> awards those playing the Pyro class the achievement \"BarbeQueQ\" if one is dominating another player and that player leaves the game before it is finished. <style=\"CurrentLink\">Achievements</style> can however also be given out to players as rewards for <i>not</i> <style=\"Link\"><link=\"ragequitting\">Ragequitting</link></style>; <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Left%204%20Dead%202\">Left 4 Dead 2</link></style> does this with the \"Connecting Fights\" achievement that is given to players that play through the entire Dead Air campaign in one go in the team vs. team mode.",
            " ",
            "Most <style=\"CurrentLink\">Achievements</style> can be modified by simply requiring that an action or goal needs to be done several times for the achievement to be rewarded. That is, one may consider <style=\"Link\"><link=\"collections\">Collections</link></style> of actions or goals rather than just one. In the case of <style=\"Link\"><link=\"goal-achievements\">Goal Achievements</link></style> if may make sense to have different <style=\"CurrentLink\">Achievements</style> for the individual goals and one for completing the whole set, creating a <style=\"Link\"><link=\"goal-hierarchies\">Goal Hierarchies</link></style>. <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/World%20of%20Warcraft\">World of Warcraft</link></style> does this in several levels, e.g. providing the <i>Arathi Highlands Quests</i> for completing 18 quests in that area, and the <i>Loremaster of Eastern Kingdoms</i> for completing that and 13 other in the Eastern Kingdoms. In contrast, <style=\"Link\"><link=\"grind-achievements\">Grind Achievements</link></style> are those that players eventually will get through <style=\"Link\"><link=\"grinding\">Grinding</link></style> rather than some level of <style=\"Link\"><link=\"gameplay-mastery\">Gameplay Mastery</link></style>. ",
            "Although <style=\"CurrentLink\">Achievements</style> can easily be used to create <style=\"Link\"><link=\"meta-games\">Meta Games</link></style>, players can be motivated to strive towards them by giving in-game <style=\"Link\"><link=\"rewards\">Rewards</link></style> for achieving them as well. These may be <style=\"Link\"><link=\"cosmetic-game-items\">Cosmetic Game Items</link></style>, possible usable for <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Avatar%20Personalization\">Avatar Personalization</link></style>, whose purpose is to provide <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Game-Based%20Social%20Statuses\">Game-Based Social Statuses</link></style> (especially appropriate for <style=\"Link\"><link=\"goal-achievements\">Goal Achievements</link></style> that require <style=\"Link\"><link=\"gameplay-mastery\">Gameplay Mastery</link></style>) but can also provide minor in-game effects. Examples of the first case can be found in <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Team%20Fortress%202\">Team Fortress 2</link></style>, which provides the <i>Grizzled Veteran Medal</i> for those who played the game within the first three months of its release. The ribbons used in <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/FarmVille\">FarmVille</link></style> for <style=\"CurrentLink\">Achievements</style> are examples of the second type; they all give some form of <style=\"Link\"><link=\"game-items\">Game Items</link></style> as an extra <style=\"Link\"><link=\"rewards\">Reward</link></style>, e.g. the first level of <i>A Pretty Penny</i> gives the player a rest tent. Since they are not supposed to disrupt <style=\"Link\"><link=\"player-balance\">Player Balance</link></style>, <style=\"Link\"><link=\"sidegrades\">Sidegrades</link></style> can be effects of <style=\"CurrentLink\">Achievements</style> that do have in-game effects. However, if the <style=\"Link\"><link=\"rewards\">Rewards</link></style> start to have to much in-game effects the <style=\"CurrentLink\">Achievements</style> are likely to turn into a form of <style=\"Link\"><link=\"sidequests\">Sidequests</link></style> rather than be <style=\"CurrentLink\">Achievements</style>. For <style=\"Link\"><link=\"unwinnable-games\">Unwinnable Games</link></style>, the presence of <style=\"CurrentLink\">Achievements</style> can provide clear goals (although they are <style=\"Link\"><link=\"optional-goals\">Optional Goals</link></style> of course). <style=\"Link\"><link=\"extra-game-broadcasting\">Extra-Game Broadcasting</link></style> can be used to increase the <style=\"Link\"><link=\"value-effort\">Value of Effort</link></style> and potential <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Game-Based%20Social%20Statuses\">Game-Based Social Statuses</link></style> or simply to announce what gameplay is possible in the game.",
            "Another level of <style=\"Link\"><link=\"meta-games\">Meta Games</link></style> can be created in games with <style=\"CurrentLink\">Achievements</style> by supporting additional <style=\"CurrentLink\">Achievements</style> based on getting various <style=\"Link\"><link=\"collections\">Collections</link></style> of other <style=\"CurrentLink\">Achievements</style>. While having all <style=\"CurrentLink\">Achievements</style> can always be present as an implicit goal for a player (and thereby be a <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Meta%20Game\">Meta Games</link></style>) this and other subsets of already existing <style=\"CurrentLink\">Achievements</style> can be made into explicit <style=\"CurrentLink\">Achievements</style> to encourage players to strive for them. ",
            "<style=\"H3\">Diegetic Aspects</style>",
            "<style=\"CurrentLink\">Achievements</style> can work against <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Narrative%20Engrossment\">Narrative Engrossment</link></style> since it draws attention to an optional <style=\"Link\"><link=\"meta-games\">Meta Game</link></style>. This is typically compounded by a culture of having cross-referential jokes or word plays (e.g. <i>The Incredible Hulk</i> in <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/World%20of%20Warcraft\">World of Warcraft</link></style>; <i>Armory of One</i>, <i>Price Chopper</i>, and <i>Kill Bill</i> in <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/L4D2\">L4D2</link></style>; ''Ain't That a Kick in the Head<i> and </i>Veni, Vidi, Vici<i> in <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Fallout:%20New%20Vegas\">Fallout: New Vegas</link></style>; and </i>Marxman<i> and </i>Rasputin'' in <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Team%20Fortress%202\">Team Fortress 2</link></style>).",
            "Even so, <style=\"CurrentLink\">Achievements</style> can be used to promote <style=\"Link\"><link=\"replayability\">Replayability</link></style> in games with <style=\"Link\"><link=\"open-destiny\">Open Destinies</link></style> for <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/NPCs\">NPCs</link></style> or player <style=\"Link\"><link=\"characters\">Characters</link></style> by providing one for each ending possible.",
            "<style=\"H3\">Interface Aspects</style>",
            "Given that <style=\"CurrentLink\">Achievements</style> exist outside specific game instances they need to be accessible without starting a play session. When they are accessible from within the game, it is usually through a <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Secondary%20Interfaces\">Secondary Interface</link></style>.",
            "<style=\"H3\">Narrative Aspects</style>",
            "As mentioned above, the presence of <style=\"CurrentLink\">Achievements</style> may work against <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Narrative%20Engrossment\">Narrative Engrossment</link></style>. This since they focus players' attention on a <style=\"Link\"><link=\"meta-games\">Meta Game</link></style> aspect, and may reveal part of what can happen later on during gameplay.",
            "<style=\"H2\">Consequences</style>",
            "<style=\"CurrentLink\">Achievements</style> are a form of <style=\"Link\"><link=\"gameplay-statistics\">Gameplay</link></style> and <style=\"Link\"><link=\"public-player-statistics\">Public Player Statistics</link></style> that are <style=\"Link\"><link=\"unlocking\">Unlocked</link></style>. They allow players to participate in <style=\"Link\"><link=\"meta-games\">Meta Games</link></style> based upon using these as <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Trans-Game%20Information\">Trans-Game Information</link></style>, and by doing so they provide players with a <style=\"Link\"><link=\"freedom-choice\">Freedom of Choice</link></style> to strive for <style=\"Link\"><link=\"optional-goals\">Optional Goals</link></style>, including the <style=\"Link\"><link=\"collections\">Collections</link></style> goal of <style=\"Link\"><link=\"unlocking\">Unlocking</link></style> all available <style=\"CurrentLink\">Achievements</style>. Receiving them are <style=\"Link\"><link=\"extra-game-consequences\">Extra-Game Consequences</link></style> and may serve as <style=\"Link\"><link=\"social-rewards\">Social Rewards</link></style>; getting these before others can create <style=\"Link\"><link=\"races\">Races</link></style>. When collections of <style=\"CurrentLink\">Achievements</style> can be given numerical values, either by a simple percentage of how many have been completed or a tally of individual values associated with each <style=\"CurrentLink\">Achievement</style>, they can efficiently function as <style=\"Link\"><link=\"high-score-lists\">High Score Lists</link></style>. By this, they can provide a <style=\"Link\"><link=\"value-effort\">Value of Effort</link></style> through being a form of <style=\"Link\"><link=\"rewards\">Reward</link></style> than can give <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Game-Based%20Social%20Statuses\">Game-Based Social Statuses</link></style>. For <style=\"Link\"><link=\"single-player-games\">Single-Player Games</link></style>, <style=\"CurrentLink\">Achievements</style> may be the only way to display <style=\"Link\"><link=\"gameplay-mastery\">Gameplay Mastery</link></style> besides using <style=\"Link\"><link=\"spectators\">Spectators</link></style>.",
            "When <style=\"CurrentLink\">Achievements</style> are used to create <style=\"Link\"><link=\"goal-hierarchies\">Goal Hierarchies</link></style> of <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Enforced%20Goals\">Enforced Goals</link></style>, they function as <style=\"Link\"><link=\"progress-indicators\">Progress Indicators</link></style>. When they are used to reward the completion of <style=\"Link\"><link=\"optional-goals\">Optional Goals</link></style> or the testing of different ways for play a game, <style=\"CurrentLink\">Achievements</style> encourages <style=\"Link\"><link=\"replayability\">Replayability</link></style>. For game that have <style=\"Link\"><link=\"challenging-gameplay\">Challenging Gameplay</link></style>, the <style=\"Link\"><link=\"rewards\">Reward</link></style> <style=\"CurrentLink\">Achievements</style> offer can provide some extra motivation to make it more likely that players will try to complete the game or goals within it.",
            "<style=\"H2\">Relations</style>",
            "<style=\"H3\">Can Instantiate</style>",
            "<style=\"Link\"><link=\"collections\">Collections</link></style>, <style=\"Link\"><link=\"extra-game-consequences\">Extra-Game Consequences</link></style>, <style=\"Link\"><link=\"freedom-choice\">Freedom of Choice</link></style>, <style=\"Link\"><link=\"gameplay-mastery\">Gameplay Mastery</link></style>, <style=\"Link\"><link=\"gameplay-statistics\">Gameplay Statistics</link></style>, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Game-Based%20Social%20Statuses\">Game-Based Social Statuses</link></style>, <style=\"Link\"><link=\"goal-hierarchies\">Goal Hierarchies</link></style>, <style=\"Link\"><link=\"high-score-lists\">High Score Lists</link></style>, <style=\"Link\"><link=\"meta-games\">Meta Games</link></style>, <style=\"Link\"><link=\"optional-goals\">Optional Goals</link></style>, <style=\"Link\"><link=\"progress-indicators\">Progress Indicators</link></style>, <style=\"Link\"><link=\"public-player-statistics\">Public Player Statistics</link></style>, <style=\"Link\"><link=\"races\">Races</link></style>, <style=\"Link\"><link=\"replayability\">Replayability</link></style>, <style=\"Link\"><link=\"rewards\">Rewards</link></style>, <style=\"Link\"><link=\"social-rewards\">Social Rewards</link></style>, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Trans-Game%20Information\">Trans-Game Information</link></style>, <style=\"Link\"><link=\"unlocking\">Unlocking</link></style>, <style=\"Link\"><link=\"value-effort\">Value of Effort</link></style>",
            "<style=\"H4\">with <style=\"Link\"><link=\"collections\">Collections</link></style></style>",
            "<style=\"Link\"><link=\"meta-games\">Meta Games</link></style>",
            "<style=\"H3\">Can Modulate</style>",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Avatar%20Personalization\">Avatar Personalization</link></style>, <style=\"Link\"><link=\"campaigns\">Campaigns</link></style>, <style=\"Link\"><link=\"open-destiny\">Open Destiny</link></style>, <style=\"Link\"><link=\"sidegrades\">Sidegrades</link></style>, <style=\"Link\"><link=\"unwinnable-games\">Unwinnable Games</link></style>",
            "<style=\"H3\">Can Be Instantiated By</style>",
            "<style=\"Link\"><link=\"dedicated-game-facilitators\">Dedicated Game Facilitators</link></style>, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Enforced%20Goals\">Enforced Goals</link></style>, <style=\"Link\"><link=\"ephemeral-goals\">Ephemeral Goals</link></style>, <style=\"Link\"><link=\"goal-achievements\">Goal Achievements</link></style>, <style=\"Link\"><link=\"grind-achievements\">Grind Achievements</link></style>, <style=\"Link\"><link=\"handicap-achievements\">Handicap Achievements</link></style>, <style=\"Link\"><link=\"optional-goals\">Optional Goals</link></style>, <style=\"Link\"><link=\"testing-achievements\">Testing Achievements</link></style>, <style=\"Link\"><link=\"ragequitting\">Ragequitting</link></style>",
            "<style=\"H3\">Can Be Modulated By</style>",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Collection\">Collection</link></style>, <style=\"Link\"><link=\"cosmetic-game-items\">Cosmetic Game Items</link></style>, <style=\"Link\"><link=\"extra-game-broadcasting\">Extra-Game Broadcasting</link></style>, <style=\"Link\"><link=\"game-items\">Game Items</link></style>, <style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Secondary%20Interfaces\">Secondary Interfaces</link></style>",
            "<style=\"H3\">Possible Closure Effects</style>",
            "N/A",
            "<style=\"H3\">Potentially Conflicting With</style>",
            "<style=\"Link\"><link=\"http://virt10.itu.chalmers.se/index.php/Narrative%20Engrossment\">Narrative Engrossment</link></style>, <style=\"Link\"><link=\"ragequitting\">Ragequitting</link></style>"
        ]
    },
    "relations" : {
        "instantiates" : [
            "collections",
            "social-rewards",
            "trans-game-information",
            "meta-games"
        ],
        "modulates" : [
            "avatar-personalization",
            "campaigns",
            "open-destiny"
        ],
        "instantiated_by" : [
            "dedicated-game-facilitators",
            "grind-achievements",
            "handicap-achievements",
            "optional-goals",
            "testing-achievements",
            "ragequitting"
        ],
        "modulated_by" : [
            "collection"
        ],
        "conflicts" : [
            "narrative-engrossment",
            "ragequitting"
        ]
    }
}