{
    "name": "Aim & Shoot",
    "texts": {
        "definition": "The act of taking aim at something and then shooting at it.",
        "description": [
            "One of the most natural ways of showing attention to something is to look or point at it. Real-time games usually provide some action that can be done to the game element pointed at. Generalized, this action can be described as [Aim & Shoot](aim-shoot) regardless of if anything is aimed or actually shot."
        ],
        "examples": [
            "Shooting in all first-person shooters consists of taking aim on the opponents, with possible compensations for their movement, and shooting.",
            "In \"Zelda: Ocarina of Time\", the player must aim and shoot a grappling hook to be able to swing \"Link\" between chasms.",
            "\"Pokemon Snap!\" gives players a camera and lets them move along a track trying to take as good pictures as possible of Pokemons."
        ],
        "usage": [
            "Making [Aim & Shoot](aim-shoot) actions possible primarily depend on enabling players to complete [Alignment](alignment) goals of two points by a straight line. For [First-Person Views](first-person-views) this is trivial, as one point is the player's view point unless either of the two points is moving. Somewhat more difficult are [Third-Person Views](third-person-views), as more movement of the player's [Focus Loci](focus-loci) is usually necessary. [God Views](god-views) are in most cases too difficult, as it is too hard to get the [Spatial Immersion](spatial-immersion) required in order to line up the two points accurately.",
            "The difficulty of [Aim & Shoot](aim-shoot) actions can be due to the [Movement](movement) either of the game elements aimed at or the game element aiming. For [Units](units) or [Avatars](avatars), the intentional [Movement](movement) due to [Traverse](traverse) or [Evade](evade) goals can make aiming at them more difficult. For [Moveable Tiles](moveable-tiles) or other game elements, the mechanical [Movement](movement) due to [The Show Must Go On](the-show-must-go-on) can likewise make aiming more difficult. The aiming can be further complicated by the players' own [Movement](movement) of their [Focus Loci](focus-loci) or by a swaying of the aim to simulate the difficulty of real-world aiming.",
            "Design of the [Game World](game-world) that makes players have a bad overview of the game state, for example the inclusions of [Obstacles](obstacles), makes it difficult to prepare for shooting. This means that potential targets likely are [Surprises](surprises), and any shots will not be well aimed. Similarly, other forms of [Surprises](surprises) likely cause [Disruption of Focused Attention](disruptionof-focused-attention) events and make players lose their aim. Aiming can also be made more difficult by introducing [Tension](tension), for example through [Competition](competition) or [Time Limits](time-limits).",
            "The possibility of [Aim & Shoot](aim-shoot) actions can be restricted by requiring [Tools](tools) or the use of [Resources](resources). The latter can introduce [Tension](tension) to the activity and require [Risk/Reward](risk-reward) choices between shooting now or waiting for a possible better situation to shoot.",
            "Although [Combat](combat) with the goals of [Capture](capture) or [Eliminate](eliminate) is the activity that most often creates [Aim & Shoot](aim-shoot) actions, other goals and reasons are possible. [Delivery](delivery) of game elements can be done by throwing or shooting the game elements to the receiver and [Capture](capture) can be the capturing of information rather than game elements. Shooting spider webs, throwing grappling hooks, or even firing cannons with oneself inside it can give explanations for how [Privileged Movement](privileged-movement) can be performed by [Aim & Shoot](aim-shoot)."
        ],
        "consequences": [
            "[Aim & Shoot](aim-shoot) is a [Dexterity-Based Action](dexterity-based-actions) that is possible in [Real-Time Games](real-time-games). Often requiring [Extended Actions](extended-actions) and [Timing](timing) from a game element's point of view, [Aim & Shoot](aim-shoot) promotes [Spatial Immersion](spatial-immersion).",
            "Interestingly enough, most sports games due not make use of [Aim & Shoot](aim-shoot) even though this is one of the primary activities in sports they simulate. The cause for this is probably the lack of overview of the game statethat players would have if they had perspectives that allowed [Aim & Shoot](aim-shoot).",
            "[Aim & Shoot](aim-shoot) actions from other players or [Enemies](enemies) naturally increase and present [Evade](evade) goals."
        ]
    },
    "relations": {
        "instantiates": [
            "spatial-immersion",
            "tension",
            "movement",
            "extended-actions",
            "timing",
            "evade",
            "maneuvering"
        ],
        "modulates": [
            "tools",
            "resources",
            "capture",
            "delivery"
        ],
        "instantiated_by": [
            "combat",
            "eliminate",
            "privileged-movement",
            "enemies",
            "alignment"
        ],
        "modulated_by": [
            "traverse",
            "movement",
            "the-show-must-go-on",
            "moveable-tiles",
            "evade"
        ],
        "conflicts": [
            "god-views",
            "obstacles",
            "disruptionof-focused-attention",
            "surprises"
        ]
    }
}