{
    "name": "Asynchronous Games",
    "texts": {
        "definition": "Games where the players game and play sessions do not necessarily overlap in time.",
        "description": [
            "The players in these games can start playing the game regardless of the other players and also choose when they want to have their play sessions."
        ],
        "examples": [
            "MMORPGs can have thousands of players in a single game instance. The players can join and leave the game whenever they want, and particular players do not have to play the game simultaneously, although there almost always are some other players playing at the same time.",
            "The players do not often play the game at the same time in play-by-mail games, even though in many cases their game sessions are the same. Some massively multiplayer play-by-mail games, such as \"Quest\" from KJC Games, share the characteristics of MMORPGs in that the players' game sessions do not have to overlap."
        ],
        "usage": [
            "[Real-Time Games](real-time-games),[Tick-Based Games](tick-based-games), and [Turn-Based Games](turn-based-games) are all suitable for [Asynchronous Games](asynchronous-games), although the play session structure has to be designed differently for each case. [Real-Time Games](real-time-games), such as existing MMORPGs, allow the players to choose when they wish to log in to the game and have real-time play sessions. [Tick-Based Games](tick-based-games) place a certain time pressure on the players, as they usually have to execute their actions within a given [Time Limit](time-limits) or lose their chance to influence the game state. Depending on the duration of a single tick, these games share characteristics from both [Real-Time Games](real-time-games) and [Turn-Based Games](turn-based-games).",
            "One way to add some of the features of [Asynchronous Games](asynchronous-games) to [Single-Player Games](single-player-games) is to store a record of a single player's performance in a particular game instance, thus allowing other players to compete against the [Ghosts](ghosts) of that player's experience.",
            "All [Asynchronous Games](asynchronous-games) require some form of [Communication Channel](communication-channels) to make it possible for the players to affect the game state and, in some cases, communicate with one another. The use of [Public Information](public-information) is restricted by [Asynchronous Games](asynchronous-games); information that can be revealed in [Synchronous Games](synchronous-games) to [Spectators](spectators) because players do not have sufficient time to process the information can become sensitive in [Asynchronous Games](asynchronous-games)."
        ],
        "consequences": [
            "Game instances of [Asynchronous Games](asynchronous-games) typically have quite long lifetimes. The players have, to some extent, [Freedom of Choice](freedomof-choice) as to when they wish to play the game and to which extent they want to influence the progress in the game. These games almost universally require the use of [Dedicated Game Facilitators](dedicated-game-facilitators) to maintain the game state within a [Persistent Game World](persistent-game-worlds). The main exceptions are games where [Ghosts](ghosts) are used, although it can be argued that [Ghosts](ghosts) are persistent parts of the [Game World](game-world) over different players' game sessions. The players can scatter their play sessions over a long period of time, in one sense, meaning that there is [Downtime](downtime) between the sessions. [Asynchronous Games](asynchronous-games), however, are constructed in such way that [Downtime](downtime) between the play sessions is not necessarily perceived as such by the players, as they do not have to intentionally wait for the other players to perform their actions."
        ]
    },
    "relations": {
        "instantiates": [
            "downtime"
        ],
        "modulates": [
            "freedomof-choice",
            "persistent-game-worlds"
        ],
        "instantiated_by": [
            "dedicated-game-facilitators",
            "ghosts"
        ],
        "modulated_by": [
            "communication-channels"
        ],
        "conflicts": [
            "public-information"
        ]
    }
}