{
    "name": "Attention Swapping",
    "texts": {
        "definition": "Players have to move their attention between different parts of the game.",
        "description": [
            "Many games have several different goals or goals that are so difficult to complete that they have to be divided into several different goals that have to be completed in parallel. In these kinds of games, the players must move between different goals and activities, performing [Attention Swapping](attention-swapping), in order to succeed in the game."
        ],
        "examples": [
            "\"Missile Command\" where players have to switch their attention between which cities they wish to defend.",
            "\"Arcadia\" by gameLab allows players to play four small games inspired by videogames from the 1980s, all simultaneously. Each game is simple, but the real challenge lies in being aware of which game one has to be focus on.",
            "In \"Go\" the opening game is based around play in the four corners of the board which each can be considered semi-independent areas. Moving game play from one corner to another is a simple way for more experienced players to challenge novice players since these have much greater difficult with the [Attention Swapping](attention-swapping) between the parts of the board."
        ],
        "usage": [
            "[Attention Swapping](attention-swapping) is closely related to the [Right Level of Difficulty](right-levelof-difficulty) and [Right Level of Complexity](right-levelof-complexity) of a game. Complex games by their nature require [Attention Swapping](attention-swapping) to a certain degree, so complexity can be used to create the need for [Attention Swapping](attention-swapping) as well as how much is needed, for example having to take into account several other vehicles when [Maneuvering](maneuvering). As the swapping adds an extra challenge in itself beyond the challenge of the activities swapped between, its presences can modulate [Right Level of Difficulty](right-levelof-difficulty) in an additional way besides the difficulty of the activities themselves. The difficulty of the [Attention Swapping](attention-swapping) can be decreased by supporting a [Game State Overview](game-state-overview), to the degree where the switching between activities does not need to be perceived as moving one's attention between different activities.",
            "Requiring players to do [Attention Swapping](attention-swapping) can be done in two main ways. The first is possible only in [Real-Time Games](real-time-games) and requires players to perform multitasking either by controlling several independent [Units](units) or by having to observe several different activities in the [Game World](game-world), or both. The second consists of having sufficiently complex game state without an adequate [Game State Overview](game-state-overview) so that a player cannot know all the currently important factors. This forces the player to create [Reconnaissance](reconnaissance) goals or, for games with a [God Views](god-views), explicitly limit what part of the game state he is focusing on, which can be seen as a form of [Stimulated Planning](stimulated-planning).",
            "[Attention Swapping](attention-swapping) can be between goals or between actions. Making players have to switch between which goals they are focusing requires the presences of several goals that can be strived for simultaneously and that the possibilities to succeed with the goals, or the value of their [Rewards](rewards) and [Penalties](penalties), change with the game state. The later requirement is usually a natural course of [Conflict](conflict) or the effect of a goals outcome for completing higher-level goals. For an example of where the value of a [Reward](rewards) changes, take the case where a player current has the two short-term goals in \"Chess\" of either capture a knight or a pawn in \"Chess\", his or her attention may swap from the knight to the pawn if the opponent's movement makes it possible to check the king by taking the pawn.",
            "Swapping between actions can be required either because doing nothing, i. e. a [No-Op](no-ops) action, against events in the game would lead to receiving [Penalties](penalties) or missing [Rewards](rewards), or because letting ongoing activities fail would do so. This swapping can be further complicated if the swapping also requires swapping [Focus Loci](focus-loci). Forcing players to start performing activities, typically to start using a [Unit](units), can be achieved by the presence of [Conflict](conflict) or effects of [The Show Must Go On](the-show-must-go-on). For activities to be ongoing and be able to fail, they need to be both [Extended Actions](extended-actions) and [Interruptible Actions](interruptible-actions). All these kinds of requirements can be found in [Combat](combat) in [Real-Time Games](real-time-games) or trying to maintain or gain [Area Control](area-control). A special form of switching between actions is when players have to switch between manipulating [Book-Keeping Tokens](book-keeping-tokens) and game elements that are part of the [Game World](game-world).",
            "[Surprises](surprises) naturally catch players' attention and can thereby be used to cause involuntary [Attention Swapping](attention-swapping)."
        ],
        "consequences": [
            "[Attention Swapping](attention-swapping) is required when players have [Limited Foresight](limited-foresight) due to not being able to observe several parts of gameplay simultaneously. Trying to switch one's concentration between several different activities or [Focus Loci](focus-loci) requires that one also is actively trying to notice when one has to make this switch. This is a form of [Resource Management](resource-management) of ones own attention which can require [Cognitive Immersion](cognitive-immersion) and [Tradeoffs](tradeoffs) to be made. As focusing on the wrong activity can cause failure, [Attention Swapping](attention-swapping) promotes [Tension](tension). [Disruption of Focused Attention](disruptionof-focused-attention) events cause involuntary [Attention Swapping](attention-swapping) and are commonly caused by [Enemies](enemies) during [Combat](combat).",
            "[Attention Swapping](attention-swapping) affects different forms of [Immersion](immersion) differently. [Emotional Immersion](emotional-immersion) is often affected negatively by [Attention Swapping](attention-swapping) except when used for [Surprises](surprises) or to cause confusion. When the [Attention Swapping](attention-swapping) is done by trying to [Movement](movement) of [Avatars](avatars) or [Units](units), the pattern supports [Spatial Immersion](spatial-immersion), especially when [First-Person Views](first-person-views) are used. [Attention Swapping](attention-swapping) promotes [Cognitive Immersion](cognitive-immersion) in addition to modulating existing [Cognitive Immersion](cognitive-immersion), as players have to reevaluate their possibility to affect the game after moving their attention between different aspects of the game."
        ]
    },
    "relations": {
        "instantiates": [
            "reconnaissance",
            "tension",
            "resource-management",
            "cognitive-immersion"
        ],
        "modulates": [
            "right-levelof-complexity",
            "stimulated-planning",
            "spatial-immersion",
            "right-levelof-difficulty",
            "cognitive-immersion",
            "tradeoffs",
            "limited-foresight"
        ],
        "instantiated_by": [
            "disruptionof-focused-attention",
            "units",
            "cameras",
            "parallel-lives",
            "surprises",
            "extended-actions",
            "interruptible-actions",
            "collaborative-actions",
            "maneuvering",
            "combat",
            "enemies",
            "area-control"
        ],
        "modulated_by": [
            "the-show-must-go-on",
            "game-state-overview",
            "god-views",
            "incompatible-goals",
            "penalties",
            "rewards",
            "conflict",
            "focus-loci"
        ],
        "conflicts": [
            "game-state-overview",
            "emotional-immersion"
        ]
    }
}