{
    "name": "Bluffing",
    "texts": {
        "definition": "Players have a possibility to convey false information to other players in order to benefit from the situation.",
        "description": [
            "Usually the basic information for [Bluffing](bluffing) is something about the current game state, as is the case in \"Poker\". It is possible, however, that [Bluffing](bluffing) concerns other game components such as past events and actions, players' goals, and even players' strategies and intentions. One of the simplest games of this kind of [Bluffing](bluffing) is an iterated version of [Paper-Rock-Scissors](paper-rock-scissors), where the players try to outguess the other player's action based on previous plays and social clues."
        ],
        "examples": [
            "\"Poker\" uses [Bluffing](bluffing) as one of the basic characteristics of the game. The players do not have direct information about the other players' hands but try to guess the relative values based on the play of previous rounds, social clues, and how the players are playing the current round. [Bluffing](bluffing) in \"Poker\" thus means that the player is trying to give a false impression to other players about the actual value of his hand.",
            "The classic board game \"Diplomacy\" has all the information about positions of the players' armies and fleets available to all players. [Bluffing](bluffing) in this game is based on giving the other players false information about the current strategies, goals, and agreements between the players. The game even has a specific diplomacy phase for giving the players the ability to scheme against other players."
        ],
        "usage": [
            "In order to have the possibility for bluffing, the game should have [Asymmetric Information](asymmetric-information) together with means of players giving each other [Indirect Information](indirect-information) about game components, that is, the players do not have direct access to the required information but can get it from other players, usually via [Social Interaction](social-interaction). Games that have [Symmetric Information](symmetric-information) as well as [Direct Information](direct-information) about game elements limit the possibilities for [Bluffing](bluffing) but can still have it concerning players' goals, strategies, and intentions. This, however, also requires that players have a possibility of some kind of cooperation and that the player actions can have an effect on the other players' position in the game. An example of a game not satisfying these requirements is a \"100 Meter Dash\", or almost any other sports race, where [Bluffing](bluffing) seems to be almost impossible.",
            "[Bluffing](bluffing) is possible in almost all cases of [Negotiation](negotiation) and can be used to avoid situations where [Randomness](randomness) would normally let players feel [Luck](luck), since [Bluffing](bluffing) can add a level of social skill even on totally random situations. Common examples where [Bluffing](bluffing) is usually possible include [Trading](trading), [Betting](betting), and [Bidding](bidding). An explicit type of game element that can be used for [Bluffing](bluffing) is [Alarms](alarms) when these can be activated by players' actions."
        ],
        "consequences": [
            "The possibility of [Bluffing](bluffing) in games creates uncertainty about results and thereby [Tension,](tension) especially for a [Bluffing](bluffing) player. [Bluffing](bluffing) modulates [Social Interaction](social-interaction) between players, and players bluffing must be able to control their [Emotional Immersion](emotional-immersion), especially if the game is played in a face-to-face situation. Even though a face-to-face situation is beneficial for this type of game, it is not a requirement. As long as the possibilities and channels for [Negotiation](negotiation) exist, there is a possibility for [Bluffing](bluffing). [Bluffing](bluffing) in most cases leads to at least a possibility of [Betrayal](betrayal)."
        ]
    },
    "relations": {
        "instantiates": [
            "risk-reward",
            "betrayal",
            "tension"
        ],
        "modulates": [
            "bidding",
            "trading",
            "emotional-immersion",
            "alarms",
            "social-interaction"
        ],
        "instantiated_by": [
            "indirect-information",
            "social-interaction",
            "negotiation",
            "betting",
            "asymmetric-information"
        ],
        "modulated_by": [
            "direct-information",
            "symmetric-information"
        ],
        "conflicts": [
            "symmetric-information",
            "luck"
        ]
    }
}