{
    "name": "Collection",
    "texts": {
        "definition": "The completion of several goals that together form a coherent unit.",
        "description": [
            "[Collection](collection) is a high-level goal requiring completion of several subgoals. [Collection](collection) are common in games to give players a better sense of what goals they will have to fulfill, how they have succeeded so far, and how the goals they presently are trying to complete fit in the overall play of the game."
        ],
        "examples": [
            "\"WarioWare, Inc.\" is a [Collection](collection) of small and quick games that have to be completed in sequence.",
            "In \"Decathlon\", players have 10 events to complete.",
            "\"Pac-Man\" has to gobble up all the pills to finish a level. While eating each pill is a very low-level goal, the goal for each level is the [Collection](collection) of all pills.",
            "In \"Lotto\", the [Collection](collection) is completed by getting matching numbers during the draw."
        ],
        "usage": [
            "The simplest case is to use the [Collection](collection) as the end condition of the whole game, that is, to finish the [Collection](collection) is to finish the game. Other possibilities are to have the completion of a [Collection](collection) as part of a [Hierarchy of Goals](hierarchyof-goals) or give [Rewards](rewards) that give [New Abilities](new-abilities) or increase a player's [Score](score).",
            "Of course, the nature and characteristics of the subgoals have to be defined when designing a [Collection](collection). These goals can be of the same nature, for example [Gain Ownership](gain-ownership) goals to have [Ownership](ownership) over several identical [Pick-Ups](pick-ups) or [Eliminate](eliminate) goals in deathmatch games or \"Magic: The Gathering\", but can also be of totally different nature as in \"WarioWare, Inc.\" and \"Decathlon\". Adventure games often use [Collection](collection) with different types of subgoals for progressing in the game. The player first has to travel to a castle, find the key to a treasure chest, get the magic sword from the chest, and finally kill the dragon. In these games, the sequence in which the goals are achieved is significant to ensure [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses), and usually the last goal in the sequence is an encounter with a [Boss Monster](boss-monsters). However, games using a \"Selectable Set of Goals\" to define a [Collection](collection) offer players [Freedom of Choice](freedomof-choice) and a variety of tactics. Often after finishing one [Collection](collection), another one is offered to the player, which can be seen as an application of [Dynamic Goal Characteristics](dynamic-goal-characteristics).",
            "Common instances of [Collection](collection) include [Last Man Standing](last-man-standing) and [Configuration](configuration). Games using [Last Man Standing](last-man-standing), such as \"Magic: The Gathering\" and deathmatch games without [Spawning](spawning), use [Collection](collection) to achieve [Team Elimination](team-elimination)."
        ],
        "consequences": [
            "Achieving a [Collection](collection) is done by performing [Collecting](collecting) actions so that players are the beneficiaries of [Transfer of Control](transferof-control) actions. A [Collection](collection) is the easiest possible [Hierarchy of Goals](hierarchyof-goals), a number of goals with an overarching goal. As [Collections](collection) are \"Hierarchies of Goals\", they allow the game progression to be structured into smaller sections and can be used to modulate [Tension](tension) in [Narrative Structures](narrative-structures). [Collection](collection) can be recursive so a [Collection](collection) can be a subgoal of another [Collection](collection) in order to create complex structures and hierarchies. The presence of a [Collection](collection) makes the completion of all its subgoals into natural [Save Points](save-points)."
        ]
    },
    "relations": {
        "instantiates": [
            "transferof-control",
            "team-elimination"
        ],
        "modulates": [
            "narrative-structures"
        ],
        "instantiated_by": [
            "last-man-standing",
            "configuration",
            "collecting",
            "gain-ownership"
        ],
        "modulated_by": [
            "save-points",
            "ownership",
            "dynamic-goal-characteristics"
        ],
        "conflicts": []
    }
}