{
    "name": "Dedicated Game Facilitators",
    "texts": {
        "definition": "Games that have machines or people who perform actions and provide choices so that players can play a game.",
        "description": [
            "Many games require actions and evaluations be done which do not offer any choices for players and are not supposed to be influenced by players. To enable better gameplay, and in some cases to enable gameplay at all, these games use [Dedicated Game Facilitators](dedicated-game-facilitators) which are machines, computers, or humans that are not players. Especially common reasons for use of [Dedicated Game Facilitators](dedicated-game-facilitators) are evaluation of complex and interconnected evaluation functions, improvising to allow greater player freedom, or to ensure impartial judgment."
        ],
        "examples": [
            "computer programs running games are all [Dedicated Game Facilitators](dedicated-game-facilitators) that allow gameplay whenever players want to play, and can simulate opponents or provide access to opponents through network connections.",
            "the croupiers or dealers in casinos are [Dedicated Game Facilitators](dedicated-game-facilitators) that support gameplay for the players without playing the game themselves.",
            "game masters in tabletop roleplaying games are examples of people who can be considered both [Dedicated Game Facilitators](dedicated-game-facilitators) and players. Game Masters in tabletop war games provide similar functions as their counterparts in roleplaying games, but usually do not control game elements and are thus not considered players."
        ],
        "usage": [
            "[Dedicated Game Facilitators](dedicated-game-facilitators) can either be humans or automats in the form of machines or computers. All of these can enforce a number of functions in the game: enacting [Agents](agents), controlling the timing of the unfolding of [Narrative Structures](narrative-structures) and adjust it to players' [Characters](characters), or creating [Never Ending Stories](never-ending-stories); enforcing [Turn Taking](turn-taking) although some type of facilitators can also make [Turn Taking](turn-taking) optional or unnecessary; providing [Unknown Goals](unknown-goals) so players can have [Imperfect Information](imperfect-information) about what to do in the game and can experience [Surprises](surprises); enabling [Communication Channels](communication-channels) which can be private, restricted, faulty, or leaky; or initiating [Balancing Effects](balancing-effects) during gameplay due to differences in players' positions in the game. The option to using [Dedicated Game Facilitators](dedicated-game-facilitators) is to have [Self-Facilitated Games](self-facilitated-games).",
            "Although [Dedicated Game Facilitators](dedicated-game-facilitators) can be used to provide [Public Information](public-information) about certain aspects of the game state, such as \"Highscore Lists\", one of the most common uses of [Dedicated Game Facilitators](dedicated-game-facilitators) is to avoid having the complete game state as [Public Information](public-information).",
            "Common human game facilitatorsare [Game Masters](game-masters), but dealers in various [Betting](betting) games are examples of games where a human game facilitator is needed for other tasks than maintaining and enacting a [Game World](game-world). [Game Masters](game-masters) allow [Smooth Learning Curves](smooth-learning-curves) as they can mentor the players until they have mastered certain levels of skill in the game. Judgescan be [Dedicated Game Facilitators](dedicated-game-facilitators) but may also be players that are temporarily appointed to judge a certain event. Due to problems with splitting ones attention, humans performing as game facilitators require some form of [Turn Taking](turn-taking).",
            "Computers as [Dedicated Game Facilitators](dedicated-game-facilitators) allow [Real-Time Games](real-time-games) where [The Show Must Go On](the-show-must-go-on). They can smoothly integrate [Storytelling](storytelling) such as [Cut Scenes](cut-scenes) in the unfolding [Narrative Structure](narrative-structures). Having the game state completely in computer memory makes saving and [Save-Load Cycles](save-load-cycles) easy, and through them [Smooth Learning Curves](smooth-learning-curves) and [Experimenting](experimenting). Since they are impartial to repetitious activities, computers allow [Replayability](replayability) of games even with strong [Narrative Structures](narrative-structures) as long as it is in the players' interest. For computer operated [Synchronous Games](synchronous-games) and [Tick-Based Games](tick-based-games), no perceivable [Turn Taking](turn-taking) needs to be present, unless it is an integral part of the game design, and players can be geographically distributed all over the world.",
            "Machines are primarily used as [Dedicated Game Facilitators](dedicated-game-facilitators) in novelty games to allow players use physical abilities."
        ],
        "consequences": [
            "[Dedicated Game Facilitators](dedicated-game-facilitators) ensure the game state of the game and control that it is updated correctly. They thereby can enforce [Ultra-Powerful Events](ultra-powerful-events) and allow [Asynchronous Games](asynchronous-games) as they can maintain the game state between players' play sessions. In the case of games with [Game Worlds](game-world), this allows for [Persistent Game World](persistent-game-worlds) s where the actions players take can continue to affect the game world after the players have stopped playing. [Dedicated Game Facilitators](dedicated-game-facilitators) also allow the possibility for players to have [Enemies](enemies) without causing [Conflict](conflict) with other players in [Multiplayer Games](multiplayer-games), or to have [Enemies](enemies) in [Single-Player Games](single-player-games).",
            "Evaluation functions, where many parameters influence the outcome, or the results cause chain reactions, require computers as [Dedicated Game Facilitators](dedicated-game-facilitators) in order to avoid [Downtime](downtime). Examples of such evaluations functions are [Combat](combat) resolutions in [Turn-Based Games](turn-based-games) such as \"Hearts of Iron\" or physics engines in 3D game worlds such as \"Deus Ex: Invisible War\"."
        ]
    },
    "relations": {
        "instantiates": [
            "surprises",
            "unknown-goals",
            "smooth-learning-curves",
            "narrative-structures",
            "imperfect-information",
            "asynchronous-games",
            "persistent-game-worlds",
            "communication-channels",
            "balancing-effects",
            "cut-scenes",
            "turn-taking",
            "the-show-must-go-on",
            "enemies",
            "storytelling",
            "agents"
        ],
        "modulates": [
            "conflict",
            "combat",
            "never-ending-stories",
            "multiplayer-games",
            "experimenting",
            "downtime",
            "game-world",
            "synchronous-games",
            "betting",
            "characters",
            "replayability"
        ],
        "instantiated_by": [
            "game-masters"
        ],
        "modulated_by": [],
        "conflicts": [
            "downtime",
            "public-information"
        ]
    }
}