{
    "name": "Delayed Effects",
    "texts": {
        "definition": "The effects of actions and events in games do not occur directly after the actions or events have started.",
        "description": [
            "[Delayed Effects](delayed-effects) are those effects of actions and events that are explicitly dictated by the rules in the game; effects that are the results of combined actions or are unexpected or unplanned do not qualify as [Delayed Effects](delayed-effects), even if the effects take place after some actions or events have taken place."
        ],
        "examples": [
            "The effect of placing bets in \"Poker\" does not become apparent until a player folds or players show their card hands.",
            "The activation of the most powerful weapons in first-person shooters usually takes some time from activation to the time it fires, usually to balance them somewhat against the other weapons in the game."
        ],
        "usage": [
            "The primary design choices for [Delayed Effects](delayed-effects) are if players should be aware of when the effects will occur and how the period of delay is determined. Showing when the effects will take place is usually done through [Progress Indicators](progress-indicators) and allows players to perform actions requiring [Timing](timing). Not providing information about when [Delayed Effects](delayed-effects) are about to occur increases the sense of [Randomness](randomness) in a game, even if the period of delay is not random. [Delayed Effects](delayed-effects) that are unknown to players lessen the functionality of savingas they may make it difficult to know when to save to be able to avoid [Irreversible Actions](irreversible-actions).",
            "Fixed periods of delay give players the chance to use [Memorizing](memorizing) to have a form of [Strategic Knowledge](strategic-knowledge). If the periods of delay are random, or if players do not have knowledge of the periods of delay, this can turn the use of other actions into [Risk/Reward](risk-reward) choices, if their success depends on the [Delayed Effects](delayed-effects).",
            "Making some actions have [Delayed Effects](delayed-effects) is a way of creating [Balancing Effects](balancing-effects) between different actions when the more powerful actions take a longer time to perform."
        ],
        "consequences": [
            "[Delayed Effects](delayed-effects) impose a [Time Limit](time-limits) on actions so that players must wait until the effects occur and can therefore affect [Tradeoffs](tradeoffs) between different effects. When the [Delayed Effects](delayed-effects) of an action are known, it gives [Predictable Consequences](predictable-consequences) to the game, which provides [Stimulated Planning](stimulated-planning). When combined with the absence of [Predictable Consequences](predictable-consequences), it instead provides players the possibility to start feeling [Luck](luck) before the outcome is shown, regardless of if they feel [Luck](luck) after the outcome is presented. This is used often in [Quick Games](quick-games) with single actions to heighten the [Anticipation](anticipation).",
            "The wait for the effects to take place is a form of [Hovering Closures](hovering-closures) once the events or actions that cause the [Delayed Effects](delayed-effects) have been done, and waiting for them can create [Anticipation](anticipation) or [Tension](tension), especially when combined with [Uncertainty of Information](uncertaintyof-information). When the [Delayed Effects](delayed-effects) are also the cause of [Extended Actions](extended-actions), it allows players to detect and try to stop them if they are [Interruptible Actions](interruptible-actions).",
            "Examples of [Delayed Effects](delayed-effects) are [Delayed Reciprocity](delayed-reciprocity), [Betting](betting), [Ultra-Powerful Events](ultra-powerful-events), and [Investments](investments). The two first are caused by other players and can cause friction between them and those experiencing the [Delayed Effects](delayed-effects), while the last two are determined by the game system and can have more [Predictable Consequences](predictable-consequences). [Delayed Effects](delayed-effects) cause increased [Tension](tension) in the two first cases when they can result in [Betrayals](betrayal)."
        ]
    },
    "relations": {
        "instantiates": [
            "time-limits",
            "strategic-knowledge",
            "stimulated-planning",
            "anticipation",
            "memorizing",
            "balancing-effects",
            "tradeoffs",
            "timing",
            "hovering-closures",
            "tension"
        ],
        "modulates": [
            "quick-games",
            "betrayal",
            "interruptible-actions",
            "luck"
        ],
        "instantiated_by": [
            "extended-actions",
            "investments",
            "delayed-reciprocity",
            "betting"
        ],
        "modulated_by": [
            "progress-indicators",
            "uncertaintyof-information",
            "randomness"
        ],
        "conflicts": []
    }
}