{
    "name": "Delivery",
    "texts": {
        "definition": "Delivery consists of moving a certain game element to another specified game element or place within the game space.",
        "description": [
            "Games which have goals consisting of moving one game element from one place to another may be complicated by only letting players be able to move the game element through the effect of other game elements. In these cases, the goals may be seen as making a [Delivery](delivery) of a game element by using other game elements."
        ],
        "examples": [
            "\"Football\" can be described as the task of delivering the ball into the other team's goal.",
            "capture the flag variants of first-person shooters have the goal of gaining access of the other team's flag and carrying it to one's own capture point."
        ],
        "usage": [
            "[Delivery](delivery) is the goal [Traverse](traverse) with the additional requirement that a certain game element must be brought to the [Goal Point](goal-points). The game element can be moved in several different ways: [Pick-Ups](pick-ups) allow players to concentrate on their own [Movement](movement) by carrying the game element; making the game element move by performing actions on it allows for [Aim & Shoot](aim-shoot) actions; or that they cannot be moved directly and required players to [Herd](herd) it through using other game elements. [Delivery](delivery) can be used as a subgoal in [Trading.](trading)",
            "Game elements that are [Pick-Ups](pick-ups) give [Gain Ownership](gain-ownership) goals, but also allow the [Delivery](delivery) to be divided between different [Units](units), possibly as different subgoals. This lets players use different [Units](units) for different areas in the game space depending on which [Privileged Abilities](privileged-abilities) they have and which obstacles are encountered. It also allows [Delivery](delivery) to be done by group of players where it is not important who delivers the game element as long as it is delivered, as for example in \"Football\". This allows for [Shared Rewards](shared-rewards) in [Team Play](team-play) or [Dynamic Alliances](dynamic-alliances) but also that the [Delivery](delivery) goal of one player can be combined the [Gain Ownership](gain-ownership) goal of another player to create [Cooperation](cooperation). By introducing players with opposing [Gain Ownership](gain-ownership) goals as [Preventing Goals](preventing-goals), game designers can introduce [Conflict](conflict) and [Tension](tension) into the game."
        ],
        "consequences": [
            "[Delivery](delivery) can be used to steer players' [Movement](movement) within the game space and is a classic way of steering a player's progress along a [Narrative Structure](narrative-structures). Depending on the obstacles and resistances in completing the goal, [Delivery](delivery) can contain subgoals of [Evade](evade), [Stealth,](stealth) or [Overcome](overcome)."
        ]
    },
    "relations": {
        "instantiates": [
            "goal-points",
            "traverse",
            "movement"
        ],
        "modulates": [
            "narrative-structures",
            "trading"
        ],
        "instantiated_by": [
            "herd"
        ],
        "modulated_by": [
            "stealth",
            "overcome",
            "evade",
            "gain-ownership"
        ],
        "conflicts": []
    }
}