{
    "name": "Dexterity-Based Actions",
    "texts": {
        "definition": "Actions whose success or failure depends on some form of dexterity, in most cases, eye-hand coordination.",
        "description": [
            "[Dexterity-Based Actions](dexterity-based-actions) are those actions whose effects are determined by how the player physically performs them. The effects of the actions do not have to be directly connected to what the player is manipulating for actions to be dexterous: billiards and computer games are examples of how games can be manipulated through indirect control."
        ],
        "examples": [
            "Most sports require skillful [Dexterity-Based Actions](dexterity-based-actions) as part of [Game Mastery](game-mastery), and this is often used to define what a sport is. The question of whether \"Chess\" is a sport shows that this definition is not fully accepted by everyone.",
            "Moving [Avatars](avatars) in first-person shooters can be seen as a [Dexterity-Based Action](dexterity-based-actions), since players can get feedback quickly enough to feel immersed in the virtual environment."
        ],
        "usage": [
            "[Dexterity-Based Actions](dexterity-based-actions) are present in both traditional games and computer games, but are mediated in computer games. However, they must be [Real-Time Games](real-time-games), and response times from computer systems can affect [Dexterity-Based Actions](dexterity-based-actions) negatively; if actions take much time before they are enacted---typically above 100 milliseconds---they do not seem to be the immediate effect of player actions and thereby do not seem to be [Dexterity-Based Actions](dexterity-based-actions). This can somewhat be mitigated with games that have few [Surprises](surprises) and either use [Timing](timing) for single actions together with [Progress Indicators](progress-indicators) or use [Rhythm-Based Actions](rhythm-based-actions) where the delays can be ignored for the internal rhythm that players can maintain.",
            "Examples of actions that require [Dexterity-Based Actions](dexterity-based-actions) are [Movement](movement) that requires [Maneuvering](maneuvering), especially to avoid [Obstacles](obstacles), and various forms of [Combat](combat) or games with [Overcome](overcome) goals, with [Aim & Shoot](aim-shoot) being a particularly common form in computer games. The difficulty of [Dexterity-Based Actions](dexterity-based-actions) can be modulated by making players manipulate game elements through [Indirect Control](indirect-control).",
            "The difficulty of [Dexterity-Based Actions](dexterity-based-actions) is dependent on how the players perceive the [Game World](game-world). Although [First-Person Views](first-person-views) give players [Spatial Immersion](spatial-immersion) and thereby a perception of the game state, which is directly related to the actions that are to be performed, [Third-Person Views](third-person-views) can sometimes be easier, since they make it easier to see the relation between their [Focus Loci](focus-loci) and the environment. For example, timing the jump over a chasm can be easier with a [Third-Person View](third-person-views) than a [First-Person View](first-person-views), as players can see exactly when to push off while still seeing where one is going. Likewise, [Maneuvering](maneuvering) a vehicle can be easier from a [Third-Person View](third-person-views), as one can see the distance to other objects more easily and can have a better sense of scale.",
            "[Surprises](surprises) make ongoing [Dexterity-Based Actions](dexterity-based-actions) difficult, and the success of [Dexterity-Based Actions](dexterity-based-actions) is easily destroyed by any [Disruption of Focused Attention](disruptionof-focused-attention) events. For non-mediated [Dexterity-Based Actions](dexterity-based-actions) in sports, e. g., archery, the high levels of [Game Mastery](game-mastery) can be described as being able to ignore all [Disruption of Focused Attention](disruptionof-focused-attention) events, including the ones generated by one's own thoughts."
        ],
        "consequences": [
            "[Dexterity-Based Actions](dexterity-based-actions) are present in [Real-Time Games](real-time-games) where either [Timing](timing) or[Extended Actions](extended-actions) is required; in the latter case, with a granularity so small that players do not notice the end of one action and the start of another action. Performing these forms of actions gives [Sensory-Motoric Immersion](sensory-motoric-immersion) and [Spatial Immersion](spatial-immersion) in games with a [Game World](game-world). Mastering [Dexterity-Based Actions](dexterity-based-actions) often forms the core of [Game Mastery](game-mastery) in [Real-Time Games](real-time-games), andvarious forms of [Dexterity-Based Actions](dexterity-based-actions) are common as the basis for games in [Polyathlons](polyathlons)."
        ]
    },
    "relations": {
        "instantiates": [
            "spatial-immersion",
            "game-mastery"
        ],
        "modulates": [
            "overcome",
            "polyathlons"
        ],
        "instantiated_by": [
            "combat",
            "extended-actions",
            "maneuvering",
            "obstacles",
            "movement"
        ],
        "modulated_by": [
            "surprises",
            "progress-indicators",
            "indirect-control"
        ],
        "conflicts": [
            "disruptionof-focused-attention"
        ]
    }
}