{
    "name": "Dynamic Goal Characteristics",
    "texts": {
        "definition": "Certain characteristics of the goals, usually the information available to the players, change during gameplay.",
        "description": [
            "Many games have goals whose requirements change from the players' perspective during gameplay. There are two kinds of changes through which this can occur: either the players gain more information about the requirements or the requirements change. The first case is common in adventure and roleplaying games. In this case, the player may first know only the final goal, e. g., defeat the evil overlord without knowing how this is possible, and the subgoals that make the goal possible are gradually revealed to the player during gameplay. A common way to change the requirements of goals is to define the goals using variables of the game state. Winning most ball sports can be defined as having a higher score than the other team, making the goal definition depend on the other team's score.",
            "The use of [Dynamic Goal Characteristics](dynamic-goal-characteristics) to describe a goal can in many games also be done by defining a static high-level goal, which starts with one subgoal and whenever that subgoal is completed, generates a new subgoal that has the same general structure as the previous subgoal. Which in the better description depends on the level of detail needed and on the purpose of the description: the former may for example be simpler to use when explaining the rules to someone that is going to play a game, while the latter may be easier to implement in program code."
        ],
        "examples": [
            "In the roleplaying game \"Neverwinter Nights\", part of the overall goal at the start is to perform a complicated ritual with several non-player characters. When the ritual is finally performed, it turns out that one of the characters doing the ritual is a traitor, and then another goal is revealed to the player: defeat the traitor.",
            "Many children's games, such as \"Tag\" and [King of the Hill](kingofthe-hill), can either be described as using [Dynamic Goal Characteristics](dynamic-goal-characteristics) or having a static high-level goal with subgoals that switch from avoiding one person to avoiding another person (or being the hunter) in \"Tag\" and from defense to offense in [King of the Hill](kingofthe-hill).",
            "The card game Fluxx has the current winning goal represented by a played card. Although the game can be said to have the static goal of fulfilling the goal card criteria, the specific winning goal changes as soon as a player plays a new goal card."
        ],
        "usage": [
            "The main design choice for using [Dynamic Goal Characteristics](dynamic-goal-characteristics) is, of course, to choose what characteristics of the goal are going to be dynamic. As mentioned previously, changing the information related to a goal is often used in adventure games and that [Role Reversal](role-reversal) is perhaps one of the most common ways to instantiate [Dynamic Goal Characteristics](dynamic-goal-characteristics). Another common way is to have an [Eliminate](eliminate) goal related to a certain kind of a game element but having a [Resource Generator](resource-generators) that generates the actual element.",
            "The goal definition can be conditionally dynamic as is the case in, for example, \"Squash\". The first goal is to get nine points, but if the player does not have a two-point lead, the goal becomes dynamic in regard to the amount of points required for winning the game. This automatically guarantees that there is a \"Perceivable margin\" for the winner. The obvious way of describing the goal is to change the definition from absolute (e. g., nine points are needed) to relative (e. g., at least nine points are needed and two points more than the other player).",
            "Another way to create [Dynamic Goal Characteristics](dynamic-goal-characteristics) with changing requirements is to use a [Player Defined Goal](player-defined-goals) but allow players to change the definition during gameplay according to certain rules. [Planned Character Development](planned-character-development) is an example of how [Player Defined Goals](player-defined-goals) can be combined with [Dynamic Goal Characteristics](dynamic-goal-characteristics): players make plans for their [Characters](characters) based upon their wishes and the current game state but as the [Narrative Structure](narrative-structures) unfolds, the game state may change so that the ways to reach the [Planned Character Development](planned-character-development) change as well, and may also make the player choose different goals altogether for the development of the [Character](characters)."
        ],
        "consequences": [
            "The use of [Dynamic Goal Characteristics](dynamic-goal-characteristics) to reveal information about a [Hierarchy of Goals](hierarchyof-goals) in stages lets the goals of a player be strongly linked to revealing the [Narrative Structure](narrative-structures) of the game. This use, common in many adventure games, allows the game to be complex and also increases the play time without confusing the player, especially if used to hide goal that no longer can be fulfilled due to [Excluding Goals](excluding-goals). This kind of use of [Imperfect Information](imperfect-information) also leads to more possibilities of dramatic narrative turns in the game. Goals may effectively be [Unknown Goals](unknown-goals) if the number of variants allowed by the [Dynamic Goal Characteristics](dynamic-goal-characteristics) is large enough.",
            "Having the requirements of a goal change during gameplay can be used to ensure that there is a \"Perceivable margin\" between the winner and other players, e. g., requiring that the winner has two more points than the other player in some ball games."
        ]
    },
    "relations": {
        "instantiates": [
            "perceivable-margins",
            "resource-generators",
            "unknown-goals",
            "imperfect-information"
        ],
        "modulates": [
            "hierarchyof-goals",
            "planned-character-development",
            "collection",
            "narrative-structures",
            "excluding-goals"
        ],
        "instantiated_by": [
            "role-reversal"
        ],
        "modulated_by": [],
        "conflicts": []
    }
}