{
    "name": "Dynamic Alliances",
    "texts": {
        "definition": "The alliances are dynamic in nature, that is, new alliances can be created, old alliances can die out and the characteristics, especially the player composition, of an alliance can change during the game play.",
        "description": [
            "Many games have [Alliances](alliances) which are stable throughout the whole game instance or even between several game instances that as is the case with, for example, most team sports. Some games, however, have [Alliances](alliances) that can change over time depending on the game situation. As stated in the [Alliance](alliances) pattern, the characteristics that can change are the rules of conduct, the agenda and the player composition. It is common that the player composition of an [Alliance](alliances) can change over time but there are also cases where the rules of conduct or the agenda change while the player composition stays the same. Perhaps the most common [Dynamic Alliances](dynamic-alliances) in strategy games are based on two players agreeing to have peaceful relations. These kinds of alliances usually end when one of the players brutally attacks the other player regardless of the previous agreement."
        ],
        "examples": [
            "in \"Diplomacy\" the [Alliances](alliances) change and shift depending on the game situation. First, Italy can be in the same [Alliance](alliances) as Turkey and France against the naval power of Great Britain, but later when France starts a war with Germany both Great Britain and Italy make a secret pact to attack France after she has moved her armies to the German border."
        ],
        "usage": [
            "In order to have [Dynamic Alliances](dynamic-alliances), of course, there has to be the basic possibility of having [Alliances](alliances) at all. These [Alliances](alliances) can range from short-term, such as performing a [Collaborative Action](collaborative-actions) with immediate consequences or resolving a [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties), or be long-term possibly lasting for entire game sessions. In addition, [Dynamic Alliances](dynamic-alliances) require mechanisms for creating and removing [Alliances](alliances) and changing the characteristics during the game, usually in the form of [Negotiation](negotiation) between the players.",
            "The simplest case from the game system point of view is to use [Uncommitted Alliances](uncommitted-alliances) without explicit declarations of the nature or characteristics of [Alliances](alliances) within the game itself. The next option is to give the players ways to create more stable groups within the game while still letting the players state the rules of conduct and the agenda out of the game system. In such cases there also have to be mechanisms for controlling the player composition. The exact mechanisms can range from simple team identifiers added to the [Handles](handles) of the players in team based first person shooters to elaborate guild and team handling functionality in Massively Multiplayer Online Roleplaying Games. Another rather simple use is to provide clear cut and stable rules of conduct and agendas for different sides in a team based game and let the players handle the player composition, as is done, for example, in \"Return to Castle Wolfenstein: Enemy Territory\". The most elaborate option, again from the game system point of view, is to provide the players explicit means to create or choose their own rules of conduct and agendas from predefined sets and at the same time provide mechanics for controlling the player composition.",
            "The next major decision is whether players should have to invest some resources for joining or creating an alliance and are there [Penalties](penalties) for breaching the alliance. The case of not having to do investments to join or not risking [Penalties](penalties) is covered in more detail in [Uncommitted Alliances](uncommitted-alliances) pattern. The common way of requiring [Investments](investments) for joining an [Alliance](alliances) is that the player is required to have certain abilities or have sufficient resources. In some cases the player is also required to transfer a certain amount of basic resources for the use of the [Alliance](alliances) or just to pay some kind of a membership fee. For example, some guilds in MMORPGs require that the player is of a certain character class and also has reached a minimum level or competence in the game. Some also require the player to give basic resources, such as money or special items, to the [Alliance](alliances). The [Penalties](penalties) for leaving or breaking an Alliance can be automatic, such as losing experience points when leaving the guild or a reduction in Score when shooting members of the same team in a first-person-shooter. The [Penalty](penalties) can also be specified chosen by the other members of the [Alliance](alliances). However, a breach of an [Alliance](alliances) does not necessarily mean automatically losing membership.",
            "The existence of [Safe Havens](safe-havens) can increase the possibility of [Dynamic Alliances](dynamic-alliances) appearing if players can perform hostile actions against each other, as the [Safe Haven](safe-havens) gives players a place where [Negotiation](negotiation) can take place safely.",
            "[Dynamic Alliances](dynamic-alliances) are always concerned about the dynamics of [Cooperation](cooperation) and [Competition](competition) between the players. One powerful method to bring in incentives for these kinds of dynamics is to use some kind of a [Social Dilemma](social-dilemmas) within the game. Another way is to have goals where only one player can win, for example [Last Man Standing](last-man-standing) or [King of the Hill](kingofthe-hill) or where players are trying to gain the highest [Score](score). In these cases the other players may form [Dynamic Alliances](dynamic-alliances) to gang up against the leader and the alliances only is valid as long as there still is a clearly perceived leader to fight against."
        ],
        "consequences": [
            "[Dynamic Alliances](dynamic-alliances) allow [Alliances](alliances) where players can perform or experience [Role Reversal](role-reversal) and have more [Varied Gameplay](varied-gameplay) in their [Team Play](team-play). Having [Dynamic Alliances](dynamic-alliances) brings in another layer of gameplay, not for the game state but for [Social Interaction](social-interaction) to manipulate and observe the shifting social relationships between the players during the game. This allows for a form of [Team Development](team-development) where players with the right [Competence Areas](competence-areas) are actively recruited to teams or [Alliances](alliances)."
        ]
    },
    "relations": {
        "instantiates": [
            "role-reversal",
            "varied-gameplay",
            "social-interaction"
        ],
        "modulates": [
            "alliances",
            "team-development",
            "uncommitted-alliances",
            "team-play"
        ],
        "instantiated_by": [
            "collaborative-actions",
            "penalties",
            "last-man-standing",
            "kingofthe-hill",
            "score"
        ],
        "modulated_by": [
            "competence-areas",
            "competition",
            "safe-havens",
            "cooperation",
            "social-dilemmas",
            "negotiation"
        ],
        "conflicts": []
    }
}