{
    "name": "Evade",
    "texts": {
        "definition": "This is the goal to avoid being captured or hit.",
        "description": [
            "Many elements in a game---for example, monsters, falling rocks, and bullet shots---are directly dangerous to the game elements controlled by players and are best avoided. This encourages players to try and [Evade](evade) these or suffer the consequences."
        ],
        "examples": [
            "\"Go\" gives an example of a turn-based game in which [Evade](evade) occurs. When playing the game, players may have groups that will be captured unless they manage to [Evade](evade) an enclosure constructed by another player.",
            "\"Pac-Man\" has the goal of avoiding the ghosts while collecting the yellow dots."
        ],
        "usage": [
            "Creating an [Evade](evade) goal involves deciding what [Enemies](enemies) should to be evaded and what [Penalties](penalties) occur it the goal is not achieved, as typically [Evade](evade) goals have no explicit [Rewards](rewards). [Evade](evade) goals can seldom be completed in themselves, with the exception of [Evade](evade) goals with [Time Limits](time-limits), but can often be completed by achieving another goal: that of completing an [Excluding Goal](excluding-goals) to whatever goal causes the actions the player is trying to [Evade](evade). Examples of this are to shoot an enemy that is trying to shoot you or to deactivate a robot that is trying to kill you. The [Penalty](penalties) for failing to [Evade](evade) something is closely related to the [Reward](rewards) of the [Preventing Goal](preventing-goals), but usually means [Damage](damage), the loss of a \"Life\", or control of a [Unit](units) (possibly because another player completed [Gain Ownership](gain-ownership) of the [Unit](units)). The [Penalty](penalties) can also be that the players are forced into [Committed Goals](committed-goals), where both succeeding and failing those goals can have negative consequences, for example, having to fight an innocent opponent to the death for having failed a [Stealth](stealth) goal.",
            "[Evade](evade) goals can be [Supporting Goals](supporting-goals) for [Traverse](traverse) and [Delivery](delivery) goals. If the player succeeds with evading the possible[Enemies](enemies), there may be no need to succeed with [Overcome](overcome) goals.",
            "[Evade](evade) goals usually have [Units](units) or moving game elements with dangerous connotations such as bullets, arrows, or missile-like spells as the game elements to be avoided. Noticing [Aim & Shoot](aim-shoot) actions from these trigger [Evade](evade) goals but also of course make the [Aim & Shoot](aim-shoot) actions more difficult. However, in games where players' [Units](units) or [Avatars](avatars) constantly move, [Evade](evade) goals can also be constructed around [Deadly Traps](deadly-traps). Any kind of [Movement Limitations](movement-limitations) that affect players during evading naturally make them more difficult.",
            "[Evade](evade) patterns can interact with [Overcome](overcome) patterns when one player has both. If the [Overcome](overcome) patterns are not used at all, the player with the [Evade](evade) goal cannot make the chaser fail by directly affecting values related to the chaser. When both [Evade](evade) and [Overcome](overcome) are present simultaneously, they allow players to create tactics of offense and defense, e. g., to strike or dodge in a boxing game. Another option is to let a player have the [Evade](evade) goal until a certain other goal, e. g., [Gain Ownership](gain-ownership) of a weapon, is completed and then the player has the possibility to strive for the [Overcome](overcome) pattern. This can be used to create [Role Reversal](role-reversal) patterns, as in \"Pac-Man\", so the chasers move from having an [Overcome](overcome) goal to having an [Evade](evade) goal."
        ],
        "consequences": [
            "[Evade](evade) goals are based upon not being hit and therefore naturally promote [Movement](movement) in games. The goals are [Continuous Goals](continuous-goals) where a player is trying to hinder the completion of another player's [Capture](capture) or [Eliminate](eliminate) goalsor to avoid being hit (which are [Connection](connection) goals). As such, they are [Preventing Goals](preventing-goals) and create [Tension](tension) as the player is trying to hinder other players' goals.",
            "In [Real-Time Games](real-time-games), [Evade](evade) typically requires players to be proficient in [Maneuvering](maneuvering) while [Puzzle Solving](puzzle-solving) is often the required skill in [Turn-Based Games](turn-based-games)."
        ]
    },
    "relations": {
        "instantiates": [
            "continuous-goals",
            "movement",
            "tension",
            "preventing-goals"
        ],
        "modulates": [
            "delivery",
            "capture",
            "traverse",
            "eliminate"
        ],
        "instantiated_by": [
            "stealth"
        ],
        "modulated_by": [
            "damage",
            "deadly-traps",
            "time-limits",
            "movement-limitations",
            "puzzle-solving",
            "enemies",
            "lives",
            "units"
        ],
        "conflicts": []
    }
}