{
    "name": "Experimenting",
    "texts": {
        "definition": "Performing actions to learn how the rules of cause and effect work in a game.",
        "description": [
            "In all but the most simple of games, the complete consequences from actions performed are difficult to understand, but [Experimenting](experimenting) can aid in understanding them. Actions may be tested for this reason simply because they have not been tested before if a player is willing to see a game session primarily as a learning period. Some games explicitly build experimenting into gameplay as puzzles. In these cases, the actions used to test possible solutions are usually reversible."
        ],
        "examples": [
            "Gameplay in \"Mastermind\" consists of one player guessing the correct combination of colored pegs. As the chance for guessing correctly based only on luck is very small, successful gameplay requires that the player combines the results from different guesses to draw conclusions and uses the guesses as experiments.",
            "In \"Pontifex\", players' goals are to build bridges and to learn how the physics model works. The players' have to experiment with how cable, joints, and metal beams interact.",
            "The computer game \"The Incredible Machine\" lets players use a limit set of objects such as pipes, bowling balls, cats, candles, ropes, and balloons to try and reach goal states by making the objects interact with each other in certain ways.",
            "The abstract game \"Zendo\" require players to set up arrangements of different colored pyramids to extrapolate the correct arrangement rules that a game master has decided to use for that particular game instance.",
            "Creating potions in \"Morrowind\" can be an experiment if the player is not an alchemist master, as not all effects of ingredients are known until one reaches that level."
        ],
        "usage": [
            "[Experimenting](experimenting) is a form of [Gain Information](gain-information) goal and as such requires [Imperfect Information](imperfect-information). The [Imperfect Information](imperfect-information) can be about the fundamental rules of cause and effect in computer games, about the long-term consequences of actions, or about the game state. In the first two cases, gaining the [Imperfect Information](imperfect-information) gives [Strategic Knowledge](strategic-knowledge) about the [Predictable Consequences](predictable-consequences) in the game, while the last case can provide information about other players' game elements and tactics. The actual actions used in the [Experimenting](experimenting) can be any; with [Experimenting](experimenting), players learnabout the actions by performing them. However, it is especially common with [Experimenting](experimenting) when doing [Puzzle Solving](puzzle-solving) , finding possible [Combos](combos), or trying to find [Achilles' Heels](achilles-heels) of [Enemies](enemies).",
            "In order to encourage [Experimenting](experimenting), the actions should not have severe consequences. In [Quick Games](quick-games), this may not be a problem if the outcome of the game has no [Extra-Game Consequences](extra-game-consequences), as a new game session can be started again. In other forms of games, [Experimenting](experimenting) is encouraged by having [Reversability](reversability) of actions, either by allowing [Save-Load Cycles](save-load-cycles) or avoiding [Irreversible Actions](irreversible-actions). This is typically easier to do in games with [Dedicated Game Facilitators](dedicated-game-facilitators), as they can easily restore game states and not require players to do so. Actions that are closely related to [Constructive Play](constructive-play), for example [Construction](construction), are better suited for [Experimenting](experimenting), because these actions are less likely to result in [Competition](competition). Providing [Reversability](reversability) in certain locations, which can be seen as a form of [Safe Havens](safe-havens), allows for [Smooth Learning Curves](smooth-learning-curves), as players can train and gain a certain level of [Game Mastery](game-mastery) before having to risk failure.",
            "When [Experimenting](experimenting) can have severe consequences, they create [Tension](tension) and can require [Leaps of Faith](leapsof-faith) but also encourage [Stimulated Planning](stimulated-planning). [Competition](competition) puts players in situations where the effect of every action can have the potential of affecting the overall outcome of the [Competition](competition), and due to this act of [Experimenting](experimenting), these situations force players to make [Risk/Reward](risk-reward) choices between the potential benefits of the experiment against the possible loss of not performing the most optimal action."
        ],
        "consequences": [
            "[Experimenting](experimenting) relies on the presence of a [Gain Information](gain-information) goal, which players try to complete by performing different variations of actions in a game. The act of planning and [Experimenting](experimenting) promotes [Cognitive Immersion](cognitive-immersion) and can modulate the [Right Level of Difficulty](right-levelof-difficulty) of a game. As the actions performed when [Experimenting](experimenting) do not usually fulfill a goal in the game, the activity gives [Illusionary Rewards](illusionary-rewards), but these can be valuable for gameplay since they may provide [Strategic Knowledge](strategic-knowledge).",
            "The possibility of [Experimenting](experimenting) in a game can aid in avoiding the emergence of [Analysis Paralysis](analysis-paralysis), as players can try the effects and consequences of their ideas and plans rather than try to deduce the effects and consequences. This can provide [Smooth Learning Curves](smooth-learning-curves).",
            "Using [Non-Renewable Resources](non-renewable-resources) when [Experimenting](experimenting) can be costly but encourage [Stimulated Planning](stimulated-planning), unless the game allows players to use [Save-Load Cycles](save-load-cycles)."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "leapsof-faith",
            "cognitive-immersion",
            "stimulated-planning",
            "smooth-learning-curves",
            "game-mastery",
            "risk-reward",
            "tension"
        ],
        "modulates": [
            "right-levelof-difficulty"
        ],
        "instantiated_by": [
            "predictable-consequences",
            "reversability",
            "imperfect-information",
            "gain-information",
            "construction",
            "puzzle-solving",
            "combos",
            "right-levelof-complexity",
            "illusionary-rewards"
        ],
        "modulated_by": [
            "safe-havens",
            "constructive-play",
            "dedicated-game-facilitators",
            "quick-games"
        ],
        "conflicts": [
            "competition",
            "irreversible-actions"
        ]
    }
}