{
    "name": "Extended Actions",
    "texts": {
        "definition": "Actions that take so long to complete that they require players to miss opportunities to perform other actions in order to complete them.",
        "description": [
            "Not all actions in games take place immediately, and some require that players continue to perform them for a period of time before taking effect. Such actions are [Extended Actions](extended-actions) and require players to make choices between completing them and abandoning them in order to start other actions. If they cannot be interrupted, they do not even let player abandon them in favor of other actions, and the player must commit fully to them."
        ],
        "examples": [
            "Taking photographs to complete certain mission goals in \"America's Army\" requires that the player performs an action continuously for a certain period of time, is not able to check the surroundings freely, and risk being killed.",
            "Buildings in the \"Age of Empires\" series let players build [Units](units), but the production of these [Units](units) takes time, and while they are being produced, no new production of units can start."
        ],
        "usage": [
            "There are three main reasons for using [Extended Actions](extended-actions) instead of normal actions: requiring a certain commitment of players to start using the action but make continued use easy; encouraging player to use the actions continuously to achieve additional effects; or requiring commitment from players for a continuous period of time. The first reason gives [Stimulated Planning](stimulated-planning) and may have [Balancing Effects](balancing-effects) if more powerful actions require more preparation and [Resources](resources). The second reason gives players increased [Freedom of Choice](freedomof-choice), as it provides players with additional ways of using actions but can also limit players by making the continuation of the action very valuable, as for example when using [Geometric Rewards for Investments](geometric-rewardsfor-investments). The third reason can, like the first reason, cause [Stimulated Planning](stimulated-planning) and have [Balancing Effects](balancing-effects) but can also increase [Tension](tension) if the actions are [Interruptible Actions](interruptible-actions). Gaining [Area Control](area-control) is an example of an action often using [Extended Actions](extended-actions) for the third reason.",
            "Once the action is started, the [Extended Actions](extended-actions) may either be possible to stop or be unstoppable by the players who initiated the action. The first case makes completing the actions into [Continuous Goals](continuous-goals) as the player may be tempted to perform other actions instead, and the completions may be affected by other players' actions if the actions are [Interruptible Actions](interruptible-actions). The latter case makes the [Extended Actions](extended-actions) a form of [Ultra-Powerful Events](ultra-powerful-events) and starting to use them becomes [Irreversible Actions](irreversible-actions). This makes the initiation of such actions [Risk/Reward](risk-reward) choices against other possible future needs of the actions and may cause [Tension](tension)."
        ],
        "consequences": [
            "[Extended Actions](extended-actions) can be seen as a form of [Investments](investments) as they tie up the possible actions available to players besides any possible uses of [Resources](resources). They may either start taking effect immediately, having increased consequences the longer they are performed, or may require an initial threshold to be reached before starting to have effect. In the latter case, the completion of them entails [Hovering Closures](hovering-closures) and has [Perceivable Margins](perceivable-margins), especially if they are also [Collaborative Actions](collaborative-actions), since they then show the willingness of several players to perform the actions. A [Progress Indicator](progress-indicators), which may be an [Illusionary Reward](illusionary-rewards) to provide feedback within a [Game World](game-world), usually shows how close to the threshold the player is in this case.",
            "When [Extended Actions](extended-actions) do not produce effects until they are finished, the actions leading up to the completion can be regarded as [No-Ops](no-ops) and the initial action can be seen as having a [Delayed Effect](delayed-effects). When players only have one [Focus Loci](focus-loci), these [No-Ops](no-ops) can equal [Downtime](downtime) for the player and limit their [Freedom of Choice](freedomof-choice). In contrast, when [Extended Actions](extended-actions) are used in combination with multiple [Focus Loci](focus-loci), typically [Units](units), gaining maximal benefit of all the possible actions through [Attention Swapping](attention-swapping) can become a part of [Game Mastery](game-mastery).",
            "[Producers](producers) and [Controllers](controllers) are typically game elements to provide [Extended Actions](extended-actions) that are not provided by players' [Focus Loci](focus-loci). [Combos](combos) and [Dexterity-Based Actions](dexterity-based-actions) such as [Aim & Shoot](aim-shoot) are examples of [Extended Actions](extended-actions) provided by players' [Focus Loci](focus-loci). [Rhythm-Based Actions](rhythm-based-actions) are a form of [Dexterity-Based Action](dexterity-based-actions) that can support [Extended Actions](extended-actions) using or not using [Focus Loci](focus-loci)."
        ]
    },
    "relations": {
        "instantiates": [
            "attention-swapping",
            "continuous-goals",
            "investments",
            "balancing-effects",
            "stimulated-planning",
            "hovering-closures",
            "tension",
            "risk-reward",
            "downtime",
            "irreversible-actions",
            "delayed-effects",
            "freedomof-choice",
            "perceivable-margins",
            "area-control"
        ],
        "modulates": [
            "game-mastery",
            "producers",
            "collaborative-actions"
        ],
        "instantiated_by": [
            "combos"
        ],
        "modulated_by": [
            "progress-indicators",
            "focus-loci",
            "interruptible-actions",
            "geometric-rewardsfor-investments",
            "illusionary-rewards",
            "units"
        ],
        "conflicts": [
            "freedomof-choice"
        ]
    }
}