{
    "name": "Game Masters",
    "texts": {
        "definition": "People who act as game facilitators of game worlds for players.",
        "description": [
            "Games with activities that cannot be performed by players or mechanized components require humans that are dedicated to facilitating the games. Examples of activities that are difficult to achieve without these [Game Masters](game-masters) include personalizing descriptions of game worlds according to the players' characters and their actions, or adjusting narratives due to unexpected actions from the characters."
        ],
        "examples": [
            "all non-computerized roleplaying requires that one person playing the games takes the role of game master in order to describe the game world, enact characters not controlled by players, determine and describe the consequences of player actions and unfold the narrative.",
            "the game \"Zendo\" has a game master who secretly decides on a secret rule how differently-colored pyramids should be arranged to have Buddha nature. The players play the game by trying to extrapolate the rule from tests."
        ],
        "usage": [
            "Supporting [Game Masters](game-masters) in game design consist of providing them with tools to run the game that allows them to shape the gameplay according to their, and the players', wishes. Common tools are an adjustable [Narrative Structure](narrative-structures), pre-generated [Characters](characters) that can be used as [Enemies](enemies) and provide opportunities for [Roleplaying](roleplaying).",
            "The power of [Game Masters](game-masters) can be mitigated by explicit rules and the use of [Randomness](randomness). Open determination of evaluation functions can also be used, for example rolling [Dice](dice) openly, but this hinders [Game Masters](game-masters) from faking the results in favor of [Player Decided Results](player-decided-results) so that the [Narrative Structure](narrative-structures) can be maintained."
        ],
        "consequences": [
            "[Game Masters](game-masters) can be seen as story-tellers that allow the listeners to affect the story and are a way to provide [Dedicated Game Facilitators](dedicated-game-facilitators) in [Self-Facilitated Games](self-facilitated-games) that are also [Multiplayer Games](multiplayer-games). As they interact with the other players, often through [Storytelling](storytelling) or [Roleplaying](roleplaying), they promote the presence of [Social Interaction](social-interaction) in games and allow for [Negotiation](negotiation) regarding all aspects of the games. The information they provide about the game state can easily become [Indirect Information](indirect-information) if that is advantageous since [Game Masters](game-masters) can often influence the presentation of the game state significantly, including lying.",
            "[Game Masters](game-masters) can often be also seen as being partly players since they get to perform many of the same actions as the other players. However, they are players with disproportionate [Empowerment](empowerment) over the game due to their [Privileged Abilities](privileged-abilities): they basically have full [Creative Control](creative-control) and the [Persistent Game World](persistent-game-worlds) is their [Player Constructed World](player-constructed-worlds), and other players only have influence with the [Game Masters'](game-masters) permission. Further, all results in the game can be the [Player Decided Results](player-decided-results) of the [Game Masters'](game-masters) will. This means that [Game Masters](game-masters) can modulate players' [Perceived Chance to Succeed](perceived-chanceto-succeed) completely as they wish, including making them feel that some actions have no possibility of success or letting them feel that they can have [Luck](luck). This modulation of player chance can be used to give [Balancing Effects](balancing-effects) so that [Player Balance](player-balance) is achieved between players or provide the [Right Level of Difficulty](right-levelof-difficulty) for the whole group of players. Although this may negatively affect [Emotional Immersion](emotional-immersion), it may be a way to maintain the [Narrative Structure](narrative-structures) without resorting to [Ultra-Powerful Events](ultra-powerful-events).",
            "[Game Masters](game-masters) are an insurance that the [Narrative Structure](narrative-structures) of the game can be maintained, or at least adjusted to be consistent with the players' actions, as they can create [Ultra-Powerful Events](ultra-powerful-events) in the [Game World](game-world). They provide the most efficient way [Cut Scenes](cut-scenes) can be modulated with the players and the game state, since the whole [Cut Scene](cut-scenes) can be done by [Storytelling](storytelling) and [Roleplaying](roleplaying) by the [Game Masters](game-masters) themselves. They also guarantee [Limited Foresight](limited-foresight) among the players since any [Narrative Structure](narrative-structures) can at any moment be discarded by [Game Masters](game-masters) in favor of other plots or storylines as they control the [Storytelling](storytelling) in the game. By doing so, they can provide [Surprises](surprises) and let players have some [Creative Control](creative-control) of the developing story, especially regarding their characters through [Planned Character Development](planned-character-development), to provide an [Illusion of Influence](illusionof-influence) or shared the influence over a [Player Constructed World](player-constructed-worlds) with the other players. They can ensure that [Downtime](downtime) is shared equally by players by enforcing [Turn Taking](turn-taking) and insert [Tension](tension) by [Ephemeral Goals](ephemeral-goals) with all players experiencing [Downtime](downtime) at the same time. By providing mentorship, the presence of [Game Masters](game-masters) can provide [Smooth Learning Curves](smooth-learning-curves) for players.",
            "Besides the [Ultra-Powerful Events](ultra-powerful-events) that unfold the [Narrative Structure](narrative-structures), [Game Masters](game-masters) can create similar effect by taking control of players' actions when the players are not consistent with their characters personality or what is appropriate in the [Alternative Reality](alternative-reality).",
            "The power of [Game Masters](game-masters) can cause rule arguments as rules are one of the few ways for players to influence the game besides the ways in which the [Game Masters](game-masters) allow. However, [Game Masters](game-masters) can also act as judgesin rule argumentsbetween players and negotiate [Ability Losses](ability-losses) for players to ensure [Player Balance](player-balance). [Game Masters](game-masters) can also remove any concepts of a [Limited Set of Actions](limited-setof-actions) as players can describe whatever they wish to do and the game master can determine the outcome."
        ]
    },
    "relations": {
        "instantiates": [
            "surprises",
            "indirect-information",
            "limited-foresight",
            "player-decided-results",
            "emotional-immersion",
            "ephemeral-goals",
            "dedicated-game-facilitators",
            "illusionof-influence",
            "balancing-effects",
            "persistent-game-worlds",
            "creative-control",
            "enemies",
            "negotiation",
            "tension",
            "empowerment",
            "player-constructed-worlds",
            "narrative-structures",
            "privileged-abilities",
            "storytelling",
            "social-interaction",
            "roleplaying",
            "right-levelof-difficulty",
            "turn-taking",
            "perceived-chanceto-succeed"
        ],
        "modulates": [
            "multiplayer-games",
            "planned-character-development",
            "game-world",
            "ability-losses",
            "downtime",
            "cut-scenes",
            "luck",
            "characters"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "randomness"
        ],
        "conflicts": [
            "downtime",
            "limited-setof-actions",
            "perceived-chanceto-succeed",
            "randomness"
        ]
    }
}