{
    "name": "Game World",
    "texts": {
        "definition": "The environment in which the gameplay or parts of the gameplay takes place is determined by the spatial relationships of the game elements.",
        "description": [
            "Usually games have a [Game World](game-world) in which the spatial relationships of game elements are important, for example, the actual game board in \"Monopoly\". There are other elements where the spatial relationships are not important as long as categories can be identified, for example, the amount of money each player has in \"Monopoly\". The strict definition adopted here requires that the elements in the [Game World](game-world) have spatial relationships that define and constrain the possible movements within the [Game World](game-world). As already stated, many games have both the spatial [Game World](game-world) and other elements that have a possible impact on the [Game World](game-world) but that do not have spatial relationships. The [Game World](game-world) is usually limited and contained, but some games, for example, \"Five-in-a-Row\", have a potentially infinite [Game World](game-world).",
            "[Game Worlds](game-world) can be classified first into continuous and discrete. The movement for the player in a continuous [Game World](game-world) is at least seemingly fluid and continuous, and in discrete [Game Worlds](game-world), the movement happens in larger steps. This classification is not clear cut, as it can be argued that every computer [Game World](game-world) is, in fact, discrete, as the positions and the environment are expressed in digital format. The second categorization concerns the main spatial relationships between the game elements. These basic categories are: linear (or 1D), reticular, 2D and 3D. These categories are orthogonal to the continuous and discrete categorization so that there are eight basic categories (even though the reticular-continuous category is slightly troublesome). Linear [Game Worlds](game-world) are those in which the movement can happen only in one or two directions. For example, \"Backgammon\" and \"Ludo\" have linear [Game Worlds](game-world). The movement in reticular [Game Worlds](game-world) can happen only between connected nodes in a graph. The arrangement of different territories in \"Diplomacy\", \"Hearts of Iron\", and many other strategy games is a good example of a reticular [Game World](game-world). The 2D [Game World](game-world) is just what it says: the movement is limited to a two-dimensional plane. \"Chess's\" board and \"Pac-Man's\" levels are good examples of 2D [Game Worlds](game-world). The last category, 3D, is as straightforward as the previous one: the movement is more or less free in all the three dimensions. Note here that the main classification is based on how the movement, and not only player movement, is limited in the world and not on the graphical representation of the world. This means that, for example, a computer \"Chess\" with splendidly rendered 3D graphics still has a 2D [Game World](game-world)."
        ],
        "examples": [
            "Even though the view to the world was in 3D, the [Game World](game-world) of \"Wolfenstein 3D\" still remained two-dimensional [Kent01]."
        ],
        "usage": [
            "The defining features of a [Game World](game-world) are the spatial relationships between the game elements, which determine what kinds of [Movement](movement) actions are possible in the game (see [Levels](levels) for details on possible game elements). A designer must first determine if there is a need for the [Game World](game-world) and then decide based on the desired basic [Movement](movement) actions which kind of game worlds would suit the gameplay the best. Another basic decision concerning [Game Worlds](game-world) is how players should experience them: concretely through [First-Person Views](first-person-views) and [Third-Person Views](third-person-views) or abstractly through [Storytelling](storytelling).",
            "Populating the [Game World](game-world) with game elements can be continuous or can be done before gameplay begins. Players' perceptions of the [Game World](game-world) will be strongly affected by the presence of any known [Strategic Locations](strategic-locations) due to the placement of these types of game elements. Continuous introduction of game elements requires [Resource Generators](resource-generators) or [Spawn Points](spawn-points), or players may create them, by [Construction](construction) or by acting as [Producers](producers). Other common game elements in [Game Worlds](game-world) include [Resources](resources), [Obstacles](obstacles), [Inaccessible Areas](inaccessible-areas), [Enemies](enemies), [Deadly Traps](deadly-traps), [Helpers](helpers), and [Goal Points](goal-points). Besides player actions, the effects of [Producers](producers) and [Converters](converters) can change not only the game elements in the [Game World](game-world) but aspects of the [Game World](game-world) itself. The presence of game elements, and [Strategic Locations](strategic-locations) due to geographical features in the [Game World](game-world), significantly affects [Player Balance](player-balance) and decides which locations are suitable for specific actions such as [Camping](camping).",
            "In addition to game elements, the appearance of the [Game World](game-world) can be modulated by [Outstanding Features](outstanding-features). These can either point to the presence of game elements or simply give reference points to players and thereby support [Game World Navigation](game-world-navigation). [Area Control](area-control) does not change the appearance of the [Game World](game-world) but changes how players can perform actions within the [Game World](game-world).",
            "The [Game World](game-world) can be constructed so that players have either a full overview through a [God View](god-views) or have a partial overview using [Fog of War](fogof-war), [Game State Overview](game-state-overview), and varying abilities of [Avatars](avatars) and [Units](units). The concrete difference here is whether players are able to view the whole game world at once. The presence of [Easter Eggs](easter-eggs) and [Secret Resources](secret-resources) can encourage [Exploration](exploration) when players do not have a complete overview of the [Game World](game-world). The spatial characteristics of a [Game World](game-world) can be further specified by designing it to be open or closed. An open game world can be expanded during gameplay, potentially infinitely or through creating spatial cycles, while a closed one has a predefined maximum size.",
            "[Game Worlds](game-world) can be constructed to appear continuous or made out of [Tiles](tiles), possibly through [Tile-Laying](tile-laying). Besides this decision of how the [Game World](game-world) should be perceived on a fine level of granularity, the game world can be partitioned into different areas, [Levels](levels), on a higher level of granularity. The [Levels](levels) make the rest of the [Game World](game-world) into [Inaccessible Areas](inaccessible-areas), and this can be used to guarantee different modes of play or to maintain a [Narrative Structure](narrative-structures). [Game Worlds](game-world) can be predetermined by the designer or constructed by the players by using a [Reconfigurable Game World](reconfigurable-game-world). In both cases, the designer has to first figure out the basic building blocks of the [Game World](game-world), even when the world is continuous. The granularity or size of a [Game World](game-world) can be modulated during gameplay through [Dedicated Game Facilitators](dedicated-game-facilitators). Especially [Game Masters](game-masters), who can provide [Storytelling](storytelling), can provide additional information such as the history of the [Game World](game-world) or facts that are not quantified in the game system. In [Player Constructed Worlds](player-constructed-worlds) and [Roleplaying](roleplaying), players can do actions similar to [Game Masters](game-masters) and provide a way to create a stable form of [Never Ending Stories](never-ending-stories).",
            "[Game Worlds](game-world) can evolve in several different ways. Besides the effect of players' actions on game elements, [Storytelling](storytelling) and [Ultra-Powerful Events](ultra-powerful-events) such as [Shrinking Game Worlds](shrinking-game-world) can change the environment during gameplay."
        ],
        "consequences": [
            "[Game Worlds](game-world) give players an [Alternative Reality](alternative-reality) inwhich they can experience [Immersion](immersion) through [Spatial Immersion](spatial-immersion), especially in games with [First-Person Views](first-person-views). The [Game World](game-world) limits the area on which players have to focus and also often very intuitively limits the possible movement actions, creating a basis for [Consistent Reality Logic](consistent-reality-logic). Specifically, the activities outside the [Game World](game-world) related to the game should in these cases only concern administrative tasks (distributing resources, converting \"money,\" moving score markers, etc.) and performing activities required by the mechanics of the game (e. g., rolling dice).",
            "Not all games have a [Game World](game-world) ---in [Paper-Rock-Scissors](paper-rock-scissors) there is no need for a [Game World](game-world) ---while most of the card games do not have meaningful spatial relationships between the cards that would determine possible [Movement](movement) actions."
        ]
    },
    "relations": {
        "instantiates": [
            "spatial-immersion",
            "exploration",
            "immersion"
        ],
        "modulates": [
            "player-balance",
            "camping",
            "roleplaying"
        ],
        "instantiated_by": [
            "tiles",
            "reconfigurable-game-world",
            "levels"
        ],
        "modulated_by": [
            "god-views",
            "deadly-traps",
            "goal-points",
            "fogof-war",
            "resource-generators",
            "never-ending-stories",
            "converters",
            "producers",
            "construction",
            "resources",
            "game-state-overview",
            "movement",
            "inaccessible-areas",
            "game-masters",
            "storytelling",
            "player-constructed-worlds",
            "dedicated-game-facilitators",
            "easter-eggs",
            "secret-resources",
            "obstacles",
            "enemies",
            "spawn-points",
            "helpers",
            "strategic-locations",
            "outstanding-features",
            "area-control",
            "shrinking-game-world"
        ],
        "conflicts": []
    }
}