{
    "name": "Ghosts",
    "texts": {
        "definition": "Ghosts are the overlay of elements and actions from previous game sessions in a current game session so that players can compare their current progress with that of the previous attempts.",
        "description": [],
        "examples": [
            "racing games such as \"Gran Turismo 3\" make use of [Ghosts](ghosts) to let players compare their current play session with earlier ones, or to practice against the optimal path."
        ],
        "usage": [
            "[Ghosts](ghosts) are mainly used in [Races](race) or other games where the player has a limited overview of the whole game world and where there is little outside influence on players' performance.",
            "The main design choice affecting player influence on the game's use of [Ghosts](ghosts) is whether players should be allowed to select which game sessions are saved and used as [Ghosts](ghosts) or if this is determined by the game mechanically, i. e. by [Score](score). Further, the use of [Ghosts](ghosts) can be chosen to only be possible within the same save file, i. e. defining a closed game world, or be shared to other save files as [Trans-Game Information](trans-game-information)."
        ],
        "consequences": [
            "[Ghosts](ghosts) can be seen as a form of \"Highscore List\" that contains the whole game sessions instead of only the [Score](score). As such, [Ghosts](ghosts) can be used to make a [Single-Player Game](single-player-games) into a form of mixture between an [Asynchronous Game](asynchronous-games) and [Multiplayer Games](multiplayer-games) where the whole play sessions are played before comparing results. [Ghosts](ghosts) naturally create [Competition](competition) even though the players are not playing at the same time."
        ]
    },
    "relations": {
        "instantiates": [
            "competition",
            "asynchronous-games"
        ],
        "modulates": [
            "multiplayer-games",
            "race"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": []
    }
}