{
    "name": "Goal Indicators",
    "texts": {
        "definition": "Players are given information about his current goals in the game.",
        "description": [
            "There are two basic types of [Goal Indicators](goal-indicators). The first, the goal statement, is concerned with how players get information about goals in the first place, and the second type of indicators is used to guide or focus players' actions in game play. The difference is, perhaps, most evident in adventure games, such as the \"Zelda\" -series, where players are first given the goal, for example \"find the Magic Sword\", and then the position of the goal object is shown on the overview map to guide players.",
            "Some games are almost completely unplayable without proper [Goal Indicators](goal-indicators). For example, in some of the missions in \"Grand Theft Auto 3,\" where the goal object is moving, and the task of the players is to hunt it down, players would be quite certainly lost without the help of indicators in the overhead map."
        ],
        "examples": [
            "in \"Grand Theft Auto 3\" the subgoals in the game are indicated with floating arrows which point out where the goal objects are located. These goals are always connected to a specific game element, for example, to go to a specific place, kill a certain character and so on. The nature of these goals is usually revealed to the player in cut scenes, which are also used to carry the story forward in the game. Players can also check their current goals from a specific goal list.",
            "\"Chess, Backgammon\" and other classical board games state the goals of players directly in the rules (check-mate the opponent's king, move all the pieces off the board). The position of the opponent's king in \"Chess\" and the location of the home base in \"Backgammon\" are [Goal Indicators](goal-indicators), which guide players' actions during the game play."
        ],
        "usage": [
            "[Goal Indicators](goal-indicators) have many of the same effects on game play as [Clues](clues) and both may in many cases be used for the same reasons. In addition, the options available in one pattern are often available in the other. Therefore, the use of [Goal Indicators](goal-indicators) is best done by considering the options of both patterns.",
            "[Goal Indicators](goal-indicators) are primarily necessary when goals are difficult to remember, or when other parts of the game may be too attention grabbing. In both cases [Goal Indicators](goal-indicators) can be used in two different ways: either to provide [Game State Overview](game-state-overview), by presenting the goals in a view separated from the main view of the game, or by augmenting the appearance of parts of the [Game World](game-world). The latter case is most common with game elements linked to goals, [Goal Points](goal-points) and the objectives of [Gain Ownership](gain-ownership) goals.",
            "A prerequisite for the game to have [Goal Indicators](goal-indicators) is that there are goals that can be explicitly stated, as it is practically impossible to have indicators for vague or non-existent goals. This is obvious in games which do not have explicit goals, such as \"SimCity\", where the [Player Defined Goals](player-defined-goals) are more or less defined by players during the game play without explicitly stating them in the game system. The goals, however, do not have to be [Predefined Goals](predefined-goals). In most of the cases of [Dynamic Goal Characteristics](dynamic-goal-characteristics) it is beneficial to have clear [Goal Indicators](goal-indicators) of both types. There are, as usual, exceptions as some games base their game play on hiding the available goals from the players and how the [Goal Indicators](goal-indicators) are used should reflect this design choice.",
            "The nature of the first type of indicators, the goal statement, depends very much on the nature of the game. Games of more abstract nature, such as most board and card games, have the goal statement explicit in the game rules or introduction. This is also made easier as these games usually have very explicit higher level goals. Story driven games almost have to embed the goal statements in the story progression in some forms of [Cut Scenes](cut-scenes) or in dialogues with non-player characters. In this way goals become a natural part of the whole [Narrative Structure](narrative-structures).",
            "The guiding indicators are slightly trickier to implement in the design. The first and foremost question for the designer is to determine if players should end up wandering around aimlessly without explicit guides. Also, if the gameplay itself is based on [Exploration](exploration) or trying to achieve some other kind of sense of discovery for the player, the use of guiding indicators has to be carefully thought out, as too explicit guiding could destroy the challenge. The [Goal Indicator](goal-indicators) can, and in many cases should, indicate the [Time Limit](time-limits), if any, of reaching the goal.",
            "Games that have several [Optional Goals](optional-goals) players can pursue, and where the goal selection is at least potentially dynamic, benefit from having explicit lists of the players' current goals available. This can be implemented in adventure and roleplaying games as \"adventure journals\", which automatically keep track of the current status of goals. Examples of games with these types of [Goal Indicators](goal-indicators) are \"Fallout\", \"Baldur's Gate\", and \"Morrowind\"."
        ],
        "consequences": [
            "The obvious consequence of using [Goal Indicators](goal-indicators) is that the players have a clear, or at least clearer, view on what they should do in the game, especially if the indicator uses [Direct Information](direct-information). [Goal Indicators](goal-indicators) provide foci for the players to support [Stimulated Planning](stimulated-planning).",
            "[Goal Indicators](goal-indicators) can also be used to provide [Spectators](spectators) with [Public Information](public-information) about the games, letting them guess what tactics and strategies different players have based on the information and the actions the players perform."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "time-limits",
            "public-information",
            "narrative-structures"
        ],
        "instantiated_by": [
            "goal-points"
        ],
        "modulated_by": [
            "direct-information",
            "game-state-overview",
            "cut-scenes"
        ],
        "conflicts": [
            "uncertaintyof-information",
            "player-defined-goals"
        ]
    }
}