{
    "name": "God's Finger",
    "texts": {
        "definition": "A God's Finger is a game element that allows the player to affect the game world, but which cannot be affected by events in the game world itself.",
        "description": [],
        "examples": [
            "many real-time strategy games make use of a [God's Finger](god-finger) in the form of a cursor that is used to select individual units or groups. Similarly, the \"Sims\" makes use of a cursor to let players move between the different characters in the game and to manipulate the game world.",
            "the cursor in god-game \"Black &amp; White\" is literally a [God's Finger](god-finger)."
        ],
        "usage": [
            "The simplest use of a [God's Finger](god-finger) is to let players navigate the [Game World](game-world) to select the [Units](units) they wish to use. However, a [God's Finger](god-finger) can act as a [Focus Loci](focus-loci) for actions that are independent of [Units](units) or to specify the effect areas of ranged actions, for example, by selecting an area by stating its boundaries. Often the [God's Finger](god-finger) is outside the [Consistent Reality Logic](consistent-reality-logic) of the game but exceptions are possible, e. g. through using spirits and possessions."
        ],
        "consequences": [
            "A [God's Finger](god-finger) lets the players navigate the game world regardless of where their [Avatars](avatars) and [Units](units) are. By doing so, they may limit the use of [Surprises](surprises) and the feeling of [Immersion](immersion) as the [God's Finger](god-finger) does not typically provide a point of identificationfor the player and is outside the [Consistent Reality Logic](consistent-reality-logic) of the game."
        ]
    },
    "relations": {
        "instantiates": [
            "focus-loci"
        ],
        "modulates": [
            "units"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": [
            "surprises",
            "consistent-reality-logic"
        ]
    }
}