{
    "name": "Herd",
    "texts": {
        "definition": "Moving a game element to a location in the game without directly interacting with it.",
        "description": [
            "[Herd](herd) is the goal of making a game element be in a certain location in the game where the movement of the game element cannot be directly control, as for example game element are when being carried."
        ],
        "examples": [
            "\"Pool\" is an example of herding where players only have one point of control, the cue ball.",
            "\"Populous\" allows players to place markers in the game world which make all the people under the player's control move towards the marker."
        ],
        "usage": [
            "There are three primary design choices when creating a [Herd](herd) goal: what to [Herd](herd), how the herding is done, and the choice of [Goal Point](goal-points), i. e. where to [Herd](herd) the game element that is herded.",
            "The game element to be herded may be able to move, but may be or not be able to do so without influences from the player. The influences for the herded game element to move based on player actions are typically motivated by the [Consistent Reality Logic](consistent-reality-logic) of the game, either as transferal of momentum from other game elements due to [Contact](contact), physical forces such as gravity or magnetism, or as emotional reactions such as anger, attraction or fright based for game elements with simulated personalities. Game elements that also move due to other influences or goals can be used to achieve the[Right Level of Difficulty](right-levelof-difficulty) of the goal, and may be described as having [Herd](herd) as a [Preventing Goal](preventing-goals) to the game elements' [Traverse](traverse) goals.",
            "The act of herding can be done in two ways, either by creating repulsion or attraction to the game element to be herded. The former case is typically by achieving [Contact](contact) with the game element to give it momentum, as for example when hitting a ball in \"Pool\" with another ball or simulations of game elements with the same magnetic polarity. Example of attractions are resources that are essential for the survival for [Units](units), such as food, or deep gravity wells such as black holes. When constructing a [Herd](herd) goal, one has the option to use \"Privileged\" [Movement](movement) to make an asymmetrical relationship between the game elements herding and being herded. This is typically used to let the herding game element have freer [Movement](movement) that the herded game element to modulate the [Right Level of Difficulty](right-levelof-difficulty).",
            "[Herd](herd) can easily be made to promote [Cooperation](cooperation) by making it a [Symmetric Goal](symmetric-goals) for several players, so that the players control different game elements that all try to make a game element move into a specific area."
        ],
        "consequences": [
            "[Herd](herd) is the [Traverse](traverse) goal of [Delivery](delivery) with [Indirect Control](indirect-control) and is performed through a form of [Collecting](collecting) actions\".\" Similar to [Delivery](delivery), [Herd](herd) can be used to steer players' [Movement](movement) within the game space but can provide more fluid gameplay as the control of the game element changes easier between teams or within a team or group of [Units](units).",
            "[Herd](herd) seldom makes use of [Stealth](stealth) because of the lack of control of the game element being herding."
        ]
    },
    "relations": {
        "instantiates": [
            "goal-points",
            "delivery",
            "indirect-control",
            "movement",
            "preventing-goals"
        ],
        "modulates": [
            "traverse",
            "collecting"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "privileged-movement",
            "contact"
        ],
        "conflicts": [
            "stealth"
        ]
    }
}