{
    "name": "Immersion",
    "texts": {
        "definition": "Immersion in the Game World or immersion in the activity of play.",
        "description": [
            "Games require players' attention and as such can make players focus on gameplay to the extent that they feel immersed in the games. This [Immersion](immersion) can take many forms, depending on what type of activity the players are performing in a game and what is required to become an expert player. Regardless of the type of immersion, achieving it can be satisfying to the players and can be one of the goals for playing the game. However, the immersion does not mean that players are unaware of their surroundings or that they are playing a game, but rather that they are deeply focused on the interaction they are having within the game."
        ],
        "examples": [
            "First-person shooters require players to focus intensely on the spatial movement of their [Avatar](avatars) and react instantaneously to events that occur in the [Game World](game-world). This is more efficiently achieved when players perform their actions with the [Avatar](avatars) as their reference point for movement rather than their own body.",
            "Many simple puzzled-based games such as \"Bejeweled\" or \"Minesweeper\" can, even though they have very little graphics and no virtual environment compared to advanced 3D games, capture players' attention through their cognitive demands so that the players become unaware of how much time is spent playing them."
        ],
        "usage": [
            "Four main types of gameplay [Immersion](immersion) can be found in games: [Spatial Immersion](spatial-immersion), [Emotional Immersion](emotional-immersion), [Cognitive Immersion](cognitive-immersion), and [Sensory-Motoric Immersion](sensory-motoric-immersion). [Spatial Immersion](spatial-immersion) is the result of extensive [Maneuvering](maneuvering) in the [Game World](game-world) in [Real-Time Games](real-time-games) and can sometimes be felt in movies. [Emotional Immersion](emotional-immersion) is obtained by responding to the events that [Characters](characters) are part of during the unfolding of a [Narrative Structure](narrative-structures) and is similar to the [Immersion](immersion) that books, theater, or movies provide. [Cognitive Immersion](cognitive-immersion) is based upon the focus on abstract reasoning and is usually achieved by complex problem solving. [Sensory-Motoric Immersion](sensory-motoric-immersion) is the result of feedback loops between repetitious movements players make to perform actions in the game and the sensory output of the game. Although claimed as one of the greatest dangers with playing games,\"Psychological Immersion\", or the confusion of the [Game World](game-world) and the real world, has not been verifiable under rigorous examination (see [Dear91] or [ESA]).",
            "Although [Immersion](immersion) is one of the most difficult patterns to instantiate in game design, common ways of trying to achieve it are through [Narrative Structures](narrative-structures), [Characters](characters), [Avatars](avatars), [Game Worlds](game-world), [Overcome](overcome) goals, and the presence of [Freedom of Choice](freedomof-choice). [Smooth Learning Curves](smooth-learning-curves) can maintain [Immersion](immersion) in games by not making challenges too easy or hard, which can make the game boring or frustrating and making players move their focus away from gameplay."
        ],
        "consequences": [
            "[Immersion](immersion) is not the cause of [Game Mastery](game-mastery) but can often be found in those that possess [Game Mastery](game-mastery) and is often sought by players. However, once the [Immersion](immersion) gained in gameplay has been achieved, it can easily be lost. The most common causes for this loss are [Disruption of Focused Attention](disruptionof-focused-attention) events, [Extra-Game Actions](extra-game-actions) such as handling [Book-Keeping Tokens](book-keeping-tokens) or performing [Save-Load Cycles](save-load-cycles), presentation of [Extra-Game Information](extra-game-information) such as [Status Indicators](status-indicators), the breakdown of a [Consistent Reality Logic](consistent-reality-logic), and forced [Downtime](downtime). Examples of more specific causes are [Reconfigurable Game Worlds](reconfigurable-game-world) and[Invisible Walls](invisible-walls), which can ruin [Spatial Immersion](spatial-immersion); [Games within Games](gameswithin-games) breaking the [Consistent Reality Logic](consistent-reality-logic); [Surprises](surprises), which can ruin [Cognitive Immersion](cognitive-immersion); and players' own [Avatars](avatars), which can ruin [Emotional Immersion](emotional-immersion) if they do not portray the emotions players expect them to."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "overcome",
            "game-mastery"
        ],
        "instantiated_by": [
            "surprises",
            "spatial-immersion",
            "avatars",
            "cognitive-immersion",
            "emotional-immersion",
            "smooth-learning-curves",
            "game-world",
            "characters",
            "narrative-structures",
            "freedomof-choice",
            "consistent-reality-logic"
        ],
        "modulated_by": [],
        "conflicts": [
            "surprises",
            "status-indicators",
            "downtime",
            "invisible-walls",
            "disruptionof-focused-attention",
            "gameswithin-games"
        ]
    }
}