{
    "name": "Individual Rewards",
    "texts": {
        "definition": "The reward, or parts of the reward, for reaching a goal or performing an action in the game is given to only one of the players.",
        "description": [
            "Games, even those with team play, where individual players can fulfill goals usually have [Individual Rewards](individual-rewards). This motivates all players that have a possibility of completing the goals to try and complete them. However, [Individual Rewards](individual-rewards) can improve the chances of whole teams to succeed with and can therefore be seen as positive effects even by those who do not directly receive the rewards."
        ],
        "examples": [
            "in single-player games the rewards are naturally [Individual Rewards](individual-rewards). In \"Tetris\" it is the player who performs the actions and fills in the rows who gets the reward.",
            "in \"Diplomacy\" the player who is performing the attack command will be able to conquer the area even though there might be several other players supporting this action with their own armies.",
            "the items given as a reward for completing a goal in a roleplaying game are usually distributed amongst the players as [Individual Rewards](individual-rewards)."
        ],
        "usage": [
            "[Individual Rewards](individual-rewards) is best suited for games where the [Ownership](ownership) of the goals of the players is clear. In these cases the players feel that they are rewarded for their own performance in the game and this can increase the sense of achievement. [Individual Rewards](individual-rewards) have many of the same requirements and possibilities as general [Rewards](rewards) do but tend to focus upon [New Abilities](new-abilities), [Improved Abilities](improved-abilities), and receiving personal [Resources](resources) and [Tools](tools). This as these types of [Rewards](rewards) can be linked to [Units](units) or [Avatars](avatars) that are directly under one player's control. In games without [Team Play](team-play), raising a player's [Score](score) or letting a player win the game has to be [Individual Rewards](individual-rewards).",
            "[Individual Rewards](individual-rewards) can be used together with [Shared Rewards](shared-rewards) when there is a possibility for separating the [Reward](rewards) into categories where some can be [Shared Rewards](shared-rewards) and some [Individual Rewards](individual-rewards). This is the usual case in fantasy roleplaying games where fungibles, such as the experience points and the gold, are shared between the players but the rare magical items are given to individual players. It is, of course, also possible to create systems where all the [Rewards](rewards) from even [Mutual Goals](mutual-goals) are [Individual Rewards](individual-rewards) in order to heighten the [Delayed Reciprocity](delayed-reciprocity) effect or create [Conflict](conflict) situations between players performing [Cooperation](cooperation) or [Collaborative Actions](collaborative-actions)."
        ],
        "consequences": [
            "[Individual Rewards](individual-rewards), just like [Rewards](rewards) in general, increase player commitment to the game, especially in the case where the player performing the actions for reaching the goal is rewarded. If an [Individual Reward](individual-rewards) goes to a player, who has not participated in the actions, is it usually regarded as unfair towards the players who did participate. However, if the players have agreed on this kind of [Rewards](rewards) beforehand, this use of [Individual Rewards](individual-rewards), together with [Cooperation](cooperation) and [Mutual Goals](mutual-goals), gives rise to [Delayed Reciprocity](delayed-reciprocity), where the player receiving the [Reward](rewards) usually feels compelled to pay the favor back. There is, however, often a possibility for [Betrayal](betrayal) in these situations which poses potential [Social Dilemmas](social-dilemmas) for the players.",
            "[Individual Rewards](individual-rewards) are natural in cases of [Competition](competition) and [Conflict](conflict) between the players and in many cases getting the [Individual Reward](individual-rewards) from the other players is the main motivation for playing the game in first place. This is especially true for games of direct [Competition](competition) with [Symmetric Goals](symmetric-goals) such as \"Chess\" and \"Soccer\", but the same applies to [Races](race) without [Interferable Goals](interferable-goals). The [Reward](rewards) itself in these cases might be just to win the other players and it can be perceived as a raise in [Social Status](social-statuses). [Individual Rewards](individual-rewards) can in games with [Team Play](team-play) give rise to [Races](race) between players within the same team, and may pose [Social Dilemmas](social-dilemmas) to players when the [Race](race) has [Interferable Goals](interferable-goals) or players can lessen the chance of other team members to succeed by not helping them.",
            "[Social Dilemmas](social-dilemmas) can be constructed by having [Individual Rewards](individual-rewards) for individual use of [Shared Resources](shared-resources). In these cases players must make [Tradeoffs](tradeoffs) between the individual benefits they can receive and the benefits of helping the group. Player must also judge the potential risks and disadvantages in antagonizing the other players who have access to the [Resources](resources).",
            "[Single-Player Games](single-player-games) naturally only have [Individual Rewards](individual-rewards)."
        ]
    },
    "relations": {
        "instantiates": [
            "social-dilemmas",
            "race",
            "rewards",
            "betrayal",
            "delayed-reciprocity"
        ],
        "modulates": [
            "social-statuses",
            "conflict",
            "collaborative-actions",
            "competition",
            "cooperation",
            "team-play",
            "mutual-goals"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "shared-rewards"
        ],
        "conflicts": [
            "shared-rewards"
        ]
    }
}