{
    "name": "Investments",
    "texts": {
        "definition": "Committing Resources for a certain amount of time to something in order to reap the rewards later.",
        "description": [
            "Games where players have to use [Resources](resources) without immediate results give players the opportunity to make [Investments](investments). This requires players to make difficult decisions based upon uncertain futures, and some games, especially strategy games, contain many different layers of [Investments](investments) to create complex gameplay experiences. Games from other genres often also contain [Investments](investments), but these [Investments](investments) are usually not as directly perceivable."
        ],
        "examples": [
            "\"Tetris\" has an incentive mechanism for taking risks in form of [Investments](investments) in order to reap greater rewards as the simultaneous removal of several rows brings in more points than removing them one by one. Players, in effect, make [Investments](investments) by creating situations where, for example, the four block stick would fit and remove four rows at the same time.",
            "the research ladders in the \"Civilization\" series bind valuable [Resources](resources) for a long time without direct rewards. The progress in research, however, will give a significant advantage in military power later in the game. A lower layer of [Investments](investments) is the building of the combat and settlement units. They take time and [Resources](resources) to build and they are not necessarily useful right away.",
            "Developing the character's skills and attributes in roleplaying games is a direct form of [Investments](investments). Raising the skills and attributes is costly and there are no direct rewards or benefits from the game system point of view for doing so. These skills and attributes, however, are often useful in the long run."
        ],
        "usage": [
            "[Investments](investments) require that players voluntarily let a form of [Consumers](consumers) destroy [Resources](resources) in order to gain the [Rewards](rewards) later in the game. However, the [Investments](investments) must have some form of \"Perceivable Consequences\" for players in order for them to be willing to invest [Resources](resources) or time into the [Investments](investments). There are three main design choices when designing [Investments](investments): choosing the [Resources](resources) that can be used in the [Investments](investments), deciding on the relationship between the kinds of [Rewards](rewards) given and the different kinds of [Resources](resources) used, and determining the relationships between different amounts of [Investments](investments) and how this affects [Rewards](rewards). [Budgeted Action Points](budgeted-action-points) are always a form of [Investment](investments) as they are the players basic [Resources](resources) for performing actions in the game.",
            "The simplest case of [Investments](investments) is when the [Resources](resources) and the [Rewards](rewards) are of the same kind, such as putting money in a bank account to get a certain interest rate back or [Betting](betting) on the outcome of an action. The [Resources](resources) and [Rewards](rewards) in these cases are usually fungible currencies of some kind within the economy of the game system. The next category is to use chains of [Producer-Consumers](producer-consumer) with [Converters](converters) to create a \"ladder\" of refinements of [Resources](resources) from basic [Resources](resources) to [Construction](construction) of [Units](units) and new [Producers](producers) and [Converters](converters). Treadmilling, having to perform repetitive actions in order to get basic [Resources](resources) such as experience points and new items, exist in many MMORPGs and belongs to this category. In this case, the raw [Resource](resources) is basically the players' time. In [Self-Facilitated Games](self-facilitated-games), the [Investment](investments) of time, as well as other [Extra-Game Consequences](extra-game-consequences) into maintaining game sessions, can have [Social Status](social-statuses) as the primary, possibly intended, [Reward](rewards). The last category of direct [Investments](investments) is to use the more basic [Resources](resources) to obtain [New Abilities](new-abilities), [Privileged Abilities](privileged-abilities), and [Skill](skills) improvements for the [Units](units) and [Characters](characters) under the players' control. In the case of [Multiplayer Games](multiplayer-games), the improvement of individual players' abilities takes the role of improvement of [Units](units) and forms the basis for [Team Development](team-development).",
            "The game system [Rewards](rewards) can be roughly classified into [Arithmetic Rewards for Investments](arithmetic-rewardsfor-investments) and [Geometric Rewards for Investment](geometric-rewardsfor-investments) regardless of the type of [Reward](rewards) compared to the [Investment](investments). [Randomness](randomness) of the exact specification of the [Rewards](rewards) lessens the [Predictable Consequences](predictable-consequences) of [Investments](investments), while [Rewards](rewards) whose usefulness or value are in [Paper-Rock-Scissors](paper-rock-scissors) relationships with [Investments](investments) of other players increase both the risk and potential reward of the [Investment](investments). [Diminishing Returns](diminishing-returns) together with either of the previous types can be used to encourage more [Varied Gameplay](varied-gameplay) and to maintain [Player Balance](player-balance). All these affect players' [Risk/Reward](risk-reward) choices to do [Investments](investments).",
            "The [Rewards](rewards) associated with the [Investments](investments) can be different from the [Resources](resources) used in the [Investment](investments) itself. For example, investing experience points in raising weapon [Skills](skills) in a fantasy-oriented roleplaying game is associated with the game system [Reward](rewards) of performing better in combat. This kind of [Character Development](character-development) is, of course, also associated with non-game system [Rewards](rewards) of achievement and recognition.",
            "Games can allow players to make [Investments](investments) through [Extra-Game Actions](extra-game-actions) to achieve [Game Mastery](game-mastery) or make artistic use of in-game actions that they have [Creative Control](creative-control) over. Further, [Social Organizations](social-organizations) and [Self-Facilitated Games](self-facilitated-games) require or encourage players to make [Investments](investments) that have [Extra-Game Consequences](extra-game-consequences) in the form of invested time and effort."
        ],
        "consequences": [
            "[Investments](investments) are a form of [Resource Management](resource-management), and usually a [Committed Goal](committed-goals), as [Resources](resources) are typically bound in the [Investments](investments). Bringing [Investments](investments) of any form into game designs promotes [Stimulated Planning](stimulated-planning), as the player has to plan ahead the use of [Resources](resources) and weight this with the possible later [Rewards](rewards). This is the case even in the \"Tetris\" example<B>: </B>the player has to plan how to use the blocks to get more points by removing several rows at the same time. In this case, as in most [Investments](investments), there are also risks involved, and the players have to decisions by assessing the involved [Risk/Reward](risk-reward) relations.",
            "[Investments](investments) are a direct form of [Extended Actions](extended-actions) with [Delayed Effects](delayed-effects): there is a time delay between the action of investing the [Resources](resources) and having the effect of that action. The difference between [Investments](investments) and other forms of [Delayed Effect](delayed-effects) is that the [Resources](resources) used in the [Investment](investments) are tied up between the action and the effect. The main incentives for the players to make [Investments](investments) are, of course, the possible [Rewards](rewards) associated with the outcome of the [Investment](investments). This kind of longer term planning is a common feature in everyday life, and games just make these decision points more explicit."
        ]
    },
    "relations": {
        "instantiates": [
            "social-statuses",
            "predictable-consequences",
            "stimulated-planning",
            "resource-management",
            "budgeted-action-points",
            "rewards",
            "delayed-effects",
            "social-organizations",
            "committed-goals",
            "team-development"
        ],
        "modulates": [
            "character-development",
            "resources",
            "skills"
        ],
        "instantiated_by": [
            "extended-actions",
            "predictable-consequences",
            "consumers",
            "units",
            "construction",
            "score",
            "betting",
            "new-abilities",
            "privileged-abilities",
            "characters",
            "game-mastery",
            "creative-control"
        ],
        "modulated_by": [
            "arithmetic-rewardsfor-investments",
            "geometric-rewardsfor-investments",
            "diminishing-returns",
            "risk-reward",
            "ownership"
        ],
        "conflicts": []
    }
}