{
    "name": "Invisible Walls",
    "texts": {
        "definition": "Invisible Walls are impassible obstacles that limit the players' movement, but not vision, to areas that appear to be part of the game world.",
        "description": [],
        "examples": [
            "some of the early flight simulator games used [Invisible Walls](invisible-walls) to limit the area the player can enter. When encountering an [Invisible Wall](invisible-walls) the plane essentially remained in the same location, even though it still seemed to fly over the terrain."
        ],
        "usage": [
            "[Invisible Walls](invisible-walls) can be used to create [Inaccessible Areas](inaccessible-areas). Although [Invisible Walls](invisible-walls) may break [Immersion](immersion) they can be preferable to having [Deadly Traps](deadly-traps), such as bottomless chasms or a sea of lava, to limit the area within which the player can move.",
            "[Invisible Walls](invisible-walls) can be fitted within the [Consistent Reality Logic](consistent-reality-logic) of a game using scientific explanations (transparent plastic armor or force shields) or magic (hexes and pentagrams) depending, of course, on the nature of the game itself. Further, these explanations can be used within the game area to create puzzles requiring [Memorizing](memorizing)."
        ],
        "consequences": [
            "[Invisible Walls](invisible-walls) are typically used to limit the area within which the players can move, but still allowing the illusion of a larger world. However, when the players reach and notice the [Invisible Wall](invisible-walls) they can easily loose their sense of [Immersion](immersion) as the wall typically breaks the [Consistent Reality Logic](consistent-reality-logic) of the game."
        ]
    },
    "relations": {
        "instantiates": [
            "memorizing",
            "inaccessible-areas"
        ],
        "modulates": [],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": [
            "immersion",
            "consistent-reality-logic"
        ]
    }
}