{
    "name": "Last Man Standing",
    "texts": {
        "definition": "The goal of being the last survivor.",
        "description": [
            "Many games have the players compete against each other in gameplay where the players are one after one eliminated. As these games usually reward the last player remaining, this give the players to metaphorically be the [Last Man Standing](last-man-standing)."
        ],
        "examples": [
            "Deathmatches in first-person shooters can be seen as example of un-winnable [Last Man Standing](last-man-standing) goals since the eliminated opponents respawn.",
            "\"Russian Roulette\" is the archetypical [Last Man Standing](last-man-standing) goal.",
            "\"Poker\" can be seen as using the pattern since players may be eliminate from a betting turn by folding and there can only be one winning hand each turn.",
            "The live-action game \"Killer\" as each player given the assignment of assassinating one other player in a circular arrangement. The completion of an assignment results in one getting the eliminated players assignment and the game continues until there is only one player left."
        ],
        "usage": [
            "Designing [Last Man Standing](last-man-standing) consists either of creating direct [Eliminate](eliminate) goals towards other players and giving all players those goals or of designing [Overcome](overcome) goals where the [Penalty](penalties) of losing is elimination.",
            "The elimination of a player in [Last Man Standing](last-man-standing) does not have to immediately make it impossible to complete the goal. If each player has a [Limited Resource](limited-resources), typically [Lives](lives), which determines if the player can continue striving towards the goal, [Last Man Standing](last-man-standing) allows players to form [Dynamic Alliances](dynamic-alliances) against those who have the most [Lives](lives) or resources remaining."
        ],
        "consequences": [
            "The goal in [Last Man Standing](last-man-standing) is to [Eliminate](eliminate) all opponents, usually fellow competitors, while being able to [Survive,](survive) creating natural [Conflict](conflict) situations between the players. [Last Man Standing](last-man-standing) can be seen as the compound goal of having a set of [Eliminate](eliminate) goals as a [Collection](collection). Depending on if the elimination is from a round in the game or from the whole game, which can be modulated through the use of [Lives](lives), the pattern may or may not support [Player Elimination](player-elimination). When the different events leading to player being eliminated are, or can be viewed as, separate games or parts of gameplay, [Last Man Standing](last-man-standing) can be treated as a [Tournament](tournaments).",
            "[Last Man Standing](last-man-standing) provides a [Symmetric Goal](symmetric-goals) with [Competition](competition) for all players, having as many closures as the number of players (or [Lives](lives) of the players) minus one. The value of these closures naturally increases as the number of players competing decrease, making the goal support [Higher-Level Closures as Gameplay Progresses](higher-level-closuresas-gameplay-progresses). As the elimination of one player decreases or voids that player's chance of fulfilling the goal, [Last Man Standing](last-man-standing) is an [Interferable Goal](interferable-goals)."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "competition",
            "overcome",
            "collection",
            "survive",
            "symmetric-goals",
            "interferable-goals",
            "dynamic-alliances",
            "tournaments"
        ],
        "modulates": [],
        "instantiated_by": [
            "eliminate"
        ],
        "modulated_by": [
            "lives",
            "limited-resources",
            "player-elimination"
        ],
        "conflicts": []
    }
}