{
    "name": "Levels",
    "texts": {
        "definition": "A level is a part of the game in which all player actions take place until a certain goal has been reached or an end condition has been fulfilled.",
        "description": [
            "The difference between [Levels](levels) in a game may be in content, aesthetics, or a combination of both. Commonly used differences between levels in early arcade games, such as \"Missile Command\", are different color themes and speed of enemy units, thereby creating different levels of difficulty. By contrast, most of the current first-person shooters and real-time strategy games have new environments to be explored in each level, i. e., each level presents new enemies and puzzles for the player. In some games, the levels can also have different primary activities the player has to perform repetitively."
        ],
        "examples": [
            "In \"Marble Madness\", the player has to guide a ball from the start of a level to the goal. Each level has different obstacles and routes to reach the goal and has different color themes.",
            "Each level in \"Asteroids\" contains a certain number of asteroids, and the player can progress to the next level after shooting all of them. The higher levels get more difficult, as the asteroids become faster and more numerous."
        ],
        "usage": [
            "To implement levels in a game, the designer must decide how many levels the game should contain and how they differ and relate to each other. In order to be perceived as part of the same game, the levels should adhere to the general [Consistent Reality Logic](consistent-reality-logic) of the game but typically with at least some local variation.",
            "One way to differentiate levels is to change the theme from level to level. As the change from one level to another typically signifies a change from one location to another, this can be used as a means to change theme, for example, from forest to cave or from railway station to factory. The theme can then be used to set the boundaries for the [Consistent Reality Logic](consistent-reality-logic), so that only game elements that fit the theme are used within the level.",
            "Another way to differentiate between levels is by changing the end conditions and the primary activities of the players. Having different types of goals that require different fields of expertise in each level (see the patterns concerning goals and game mastery) guarantees [Varied Gameplay](varied-gameplay) and includes the possibility of having [Unknown Goals](unknown-goals) as the player progresses from level to level.",
            "The combination of theme, end condition, and primary activities sets the boundaries for what actual game elements should be used in a given level. The use of game elements such as [Resource Locations](resource-locations), [Save Points](save-points), [Clues](clues), [Helpers](helpers), [Controllers](controllers), [Resource Generators](resource-generators), [Obstacles](obstacles), [Enemies](enemies), [Boss Monsters](boss-monsters), and the spatial relationships between them, can then be used to provide additional [Varied Gameplay](varied-gameplay) and [Surprises](surprises). [Spawn Points](spawn-points) for the player [Avatars](avatars) are especially important as they determine the players' starting conditions and can be used to create [Tension](tension) or [Time Limit](time-limits) if this is in line with the theme or the primary activities of the level.",
            "The spatial construction of a level affects how players are made aware of the existence of possibly selectable further levels and how to reach them. Being able to directly observe the other levels through [Invisible Walls](invisible-walls) or [Inaccessible Areas](inaccessible-areas) is an obvious way to do this, but [Game State Overview](game-state-overview) as well as [Clues](clues) and [Helpers](helpers) can also be used. The latter option is in some cases easier to fit within the [Consistent Reality Logic](consistent-reality-logic) of the game.",
            "The completion of a level in most of the currently popular genres consists of achieving a [Traverse](traverse) goal by moving through the level from the start point to the [Goal Point](goal-points). Reaching this goal is often symbolized by the activation of a [Controller](controllers), such as opening the main door to the next level, or by defeating a [Boss Monster](boss-monsters).",
            "Levels can be used to support [Smooth Learning Curves](smooth-learning-curves) and [Right Level of Difficulty](right-levelof-difficulty) by making the initial levels small, or easy in other ways, to complete. Completing these initial levels, the players should get familiar with using the interface and with the primary activities of the game, making it possible at the later levels to concentrate more on achieving [Game Mastery](game-mastery)."
        ],
        "consequences": [
            "The concept of [Levels](levels) lets the game designer delimit the [Game World](game-world) and thereby the complexity of the game as well as giving players [Limited Foresight](limited-foresight). [Levels](levels) can also be used to progress the [Narrative Structure](narrative-structures) in a controlled fashion through the use of [Closure Points](closure-points) when changing [Levels](levels) are [Irreversible Actions](irreversible-actions). These progressions of the story in games are usually done by [Cut Scenes](cut-scenes) between [Levels](levels) but can also be done through the different events and game elements that occur in the new level.",
            "The existence of a level assumes the existence of the next level or the completion of the game, providing explicit short-term [Exploration](exploration) goals for the players of finding the next level. The completion of a level thereby provides strong [Hovering Closures](hovering-closures), especially if [Save Points](save-points) only exist between the levels. The levels always create a [Hierarchy of Goals](hierarchyof-goals), be it linear, as is the case with the most shoot-'em-ups, or structured in a more elaborate way, as is done, for example, in the different worlds in \"Super Mario 64\".",
            "By being different both as to structure and gameplay, the levels can provide [Varied Gameplay](varied-gameplay) and [Surprises](surprises). Each level also has the possibility to support [Exploration](exploration) goals, which may be extended to a larger scale if the players have a choice between the order in which to complete levels."
        ]
    },
    "relations": {
        "instantiates": [
            "limited-foresight",
            "game-world",
            "varied-gameplay",
            "consistent-reality-logic",
            "closure-points",
            "hovering-closures"
        ],
        "modulates": [
            "surprises",
            "inaccessible-areas",
            "narrative-structures",
            "varied-gameplay",
            "game-mastery",
            "smooth-learning-curves",
            "right-levelof-difficulty"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "save-points",
            "resource-generators",
            "irreversible-actions",
            "helpers",
            "inaccessible-areas",
            "spawn-points",
            "enemies",
            "clues",
            "obstacles",
            "boss-monsters",
            "cut-scenes"
        ],
        "conflicts": []
    }
}