{
    "name": "Memorizing",
    "texts": {
        "definition": "Games where players gain benefit by remembering facts about the game or game state.",
        "description": [
            "Knowing what can happen in games is an advantage to players, and when players are shown information temporarily, they have an advantage of [Memorizing](memorizing) that information."
        ],
        "examples": [
            "Many card games give players benefits for [Memorizing](memorizing) played cards, as this allows them to predict what cards they will be dealt or what possible card hands other players can have. Although not forbidden by the rules of the games, casinos have rules that forbid card counting and ban players who are identified [Memorizing](memorizing) the cards.",
            "The games in the \"Simon\" toy by Mattel show patterns to players by playing sounds and showing lights. The players' goals are to repeat the patterns, which makes [Memorizing](memorizing) the primary game skill."
        ],
        "usage": [
            "[Memorizing](memorizing) can either be applicable for all game sessions of a game or be specific for individual game sessions. The first type is the learning of [Strategic Knowledge,](strategic-knowledge) such as the distributions of effect determined by [Randomness](randomness), and is present in all games, but may be explicitly encouraged by game design where players receive [Extra-Game Information](extra-game-information). If this form of information can be used to directly solve specific goals, for example those related to [Puzzle Solving](puzzle-solving), the possibility of [Memorizing](memorizing) lessens the [Replayability](replayability). Explicitly supporting [Memorizing](memorizing) in games is usually done by having [Imperfect Information](imperfect-information) that becomes [Perfect Information](perfect-information) for a while and then reverts to [Imperfect Information](imperfect-information) as presented by the game system.",
            "Whether they change between game sessions, the locations of [Deadly Traps](deadly-traps), [Invisible Walls](invisible-walls), and [Strategic Locations](strategic-locations) are typical aspects of games worth [Memorizing](memorizing), and may be made into explicit goals of [Exploration](exploration). The initiation of events with [Delayed Effects](delayed-effects) can also require [Memorizing](memorizing), if the game does not provide [Progress Indicators](progress-indicators) for when the effect will take place.",
            "Changing the game state so new memorization is required for each game session can be achieved by [Reconfigurable Game Worlds](reconfigurable-game-world), using closed [Discard Piles](discard-piles), [Randomness](randomness) of the placement of game elements, and using [Fog of War](fogof-war) to hide other players' actions. When using new information for each game session, [Memorizing](memorizing) is one of the design options available to game designers for designing [Overcome](overcome) goals or [Polyathlons](polyathlons)."
        ],
        "consequences": [
            "[Memorizing](memorizing) can give players [Cognitive Immersion](cognitive-immersion) in games and is a skill that can determine [Game Mastery](game-mastery). The use of [Memorizing](memorizing) is not totally dependent on either [Imperfect Information](imperfect-information) or [Perfect Information](perfect-information) but rather players' gameplay is affected by a lack of knowledge, which can be how to use information presence in the game.",
            "The lack of knowledge can be either regarding the game state or regarding the rules of the game and can create additional challenges to the rewards from [Gain Information](gain-information) goals, if access to the gained information is not provided continuously by the game.",
            "Memorization of the rules is not usually a designed feature of games but nevertheless affects gameplay. Smooth execution of [Self-Facilitated Games](self-facilitated-games) requires that players spend time [Memorizing](memorizing) the rules, but may be eased by providing [Book-Keeping Tokens](book-keeping-tokens) and handouts. Players are motivated to do this since failure to remember rules give them a [Limited Set of Actions](limited-setof-actions) compared to other players, and failure to follow rules may cause rulearguments, which can usually not be corrected if the game state has change too much. The presence of [Game Masters](game-masters) makes [Memorizing](memorizing) most of the rules optional to the players but may still be interesting for reasons of [Empowerment](empowerment). Computer-based games allow players to start playing the games without any knowledge of rules and make the learning of them a combination of [Exploration](exploration) and [Memorizing](memorizing)."
        ]
    },
    "relations": {
        "instantiates": [
            "cognitive-immersion",
            "empowerment",
            "game-mastery"
        ],
        "modulates": [
            "overcome",
            "polyathlons"
        ],
        "instantiated_by": [
            "deadly-traps",
            "reconfigurable-game-world",
            "discard-piles",
            "strategic-knowledge",
            "fogof-war",
            "gain-information",
            "invisible-walls",
            "delayed-effects",
            "randomness",
            "puzzle-solving",
            "strategic-locations"
        ],
        "modulated_by": [
            "exploration",
            "perfect-information",
            "imperfect-information"
        ],
        "conflicts": [
            "limited-setof-actions",
            "replayability",
            "progress-indicators"
        ]
    }
}