{
    "name": "Moveable Tiles",
    "texts": {
        "definition": "These are Tiles that can move during gameplay either as the effect of player actions or game events.",
        "description": [
            "[Moveable Tiles](moveable-tiles) are very common in platform games from \"Super Mario Bros.\" to \"Crash Bandicoot\" to \"Super Monkey Ball\". In these games, the [Moveable Tiles](moveable-tiles) mainly consist of constantly moving platforms the player has to use to reach certain places in the game. The main challenge for the player in such cases is to time and coordinate his movements according to the movement of the tiles. Another common use of [Moveable Tiles](moveable-tiles) is to allow the player to push, pull, or otherwise move the tiles around the [Game World](game-world), usually to block enemies or to reach otherwise inaccessible areas."
        ],
        "examples": [
            "One of the levels in \"Super Monkey\" \"Ball\" consists almost exclusively of moving tiles, where each tile contains bananas for bonus scores. The tiles move in a very predictable pattern by first contracting to the center of the level and then again spreading out."
        ],
        "usage": [
            "Besides the considerations that need to be made for other [Tiles](tiles), the design of [Moveable Tiles](moveable-tiles) requires decisions regarding the movement patterns, such as how the movement is activated and how the movement can be stopped, if necessary. Movement patterns can either be predetermined, decided on the fly using [Randomness](randomness), or determined by the actions made either by game elements on the tile or through [Controllers](controllers). The activation of the movement may be due to certain events or actions (maybe requiring some form of [Resources](resources)), or the movement may be constant so that activation is not required, and the movement may continue only for a limited amount of time. The movement of the tile may also end or change direction when blocked by an [Obstacle](obstacles). When the movement is caused by player actions, this provides a form of [Reconfigurable Game World](reconfigurable-game-world).",
            "Another decision to be made when using [Moveable Tiles](moveable-tiles) is whether the game elements on the [Moveable Tiles](moveable-tiles) need to move in order to stay on the tile or if they are automatically carried by the tile when it is moving. For example, in almost all cases of lifts in platform games, the player's character is automatically carried on the lift tile. On the other hand, to stay on the [Moveable Tiles](moveable-tiles) in \"Super Monkey Ball\", the player has to explicitly move the ball."
        ],
        "consequences": [
            "[Moveable Tiles](moveable-tiles) are a typical use of [The Show Must Go On](the-show-must-go-on), as the players usually cannot affect the movement of the tiles once set in motion. These types of [Moveable Tiles](moveable-tiles) are also examples of such [Ultra-Powerful Events](ultra-powerful-events) that do not make the players lose control over their game elements; rather, the [Moveable Tiles](moveable-tiles) in this casebring in more complexity and variation to the game system. [Moveable Tiles](moveable-tiles) that are not under players' control can be used to create [Timing](timing) challenges that require [Rhythm-Based Actions](rhythm-based-actions) as well as [Strategic Knowledge](strategic-knowledge) when the player actions have to be coordinated according to the movement of several [Moveable Tiles](moveable-tiles).[Moveable Tiles](moveable-tiles) also make [Aim & Shoot](aim-shoot) actions more difficult, as the movement of the tiles need to be considered."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "the-show-must-go-on",
            "timing"
        ],
        "modulates": [
            "tiles",
            "reconfigurable-game-world"
        ],
        "instantiated_by": [],
        "modulated_by": [
            "controllers"
        ],
        "conflicts": []
    }
}