{
    "name": "Multiplayer Games",
    "texts": {
        "definition": "Games that have more than one player.",
        "description": [
            "The scope of [Multiplayer Games](multiplayer-games) is vast, and most games in general are played in social situations, which by their nature require more than one person participating in the game. The number of players varies from just two players competing directly to thousands of players participating in the same game."
        ],
        "examples": [
            "\"Chess\" has two players competing against one another by taking turns.",
            "MMORPGs can have thousands of players playing the same game instance simultaneously and tens or even hundreds of thousands of players participating in the game instance asynchronously."
        ],
        "usage": [
            "Although it may seem that the main requirement for [Multiplayer Games](multiplayer-games) is that the game supports several players, even [Single-Player Games](single-player-games) can be a possible foundation for making [Multiplayer Games.](multiplayer-games) This can be accomplished by organizing players in [Tournaments](tournaments), introducing [Ghosts](ghosts), or some other [Meta Game](meta-games) elements or [Extra-Game Actions](extra-game-actions), these games can become [Multiplayer Games](multiplayer-games) as long as players can affect the gameplay of the other players or compare their individual efforts against each other.",
            "Many design choices are unique to [Multiplayer Games](multiplayer-games) or are significantly modified by the presence of other players: [Smooth Learning Curves](smooth-learning-curves) and providing the [Right Level of Difficulty](right-levelof-difficulty) can be more difficult to achieve, although [Balancing Effects](balancing-effects) can help; [Player Balance](player-balance) can be achieved not only through [Balancing Effects](balancing-effects) but also through [Handicaps](handicaps) such as differences in [Skills](skills) or [Asymmetric Resource Distribution](asymmetric-resource-distribution), the latter of which can also be the original source of the imbalances; [Game Masters](game-masters) can be used and can allow the other players greater [Freedom of Choice](freedomof-choice) and stronger \"Illusions of Influence\"; [Tiebreakers](tiebreakers) may be required to determine winners of [Overcome](overcome) goals unless [Tied Results](tied-results) are to be possible; [Player Elimination](player-elimination) may exist and force individual players to quit their play sessions before the game sessions end due to [Early Elimination](early-elimination); [Agents](agents) can be used to simulate other players to allow [Multiplayer Games](multiplayer-games) to be played alone.",
            "[Persistent Game Worlds](persistent-game-worlds), which by their definition have to be shared between several players, represent one way to achieve [Multiplayer Games](multiplayer-games) with a potentially limitless number of participating players. These types of [Multiplayer Games](multiplayer-games) have [Dedicated Game Facilitators](dedicated-game-facilitators) to maintain the game state, but [Self-Facilitated Games](self-facilitated-games) are also possible, although, the number of participating players has to be lower, or else the game state synchronization becomes difficult."
        ],
        "consequences": [
            "[Multiplayer Games](multiplayer-games) naturally provide a focus point for [Social Interaction](social-interaction) between the players, and it is impossible to have [Social Organizations](social-organizations), or have [Identification](identification) with groups, in games without having more than one player playing the same game instance. Having several players in a game allows the game design to have [Team Play](team-play) and modulates [Game Mastery](game-mastery) by making it possible for players to develop specific [Competence Areas](competence-areas) for their [Characters](characters). [Multiplayer Games](multiplayer-games) also provide some forms of [Game Mastery](game-mastery), some which are not applicable in other games, for example [Negotiation](negotiation) and [Creative Control](creative-control). [Multiplayer Games](multiplayer-games) often give players [Limited Planning Ability](limited-planning-ability), as the goals and plans may be difficult to deduce and they can significantly affect future game states. [Synchronous Games](synchronous-games) are by their nature also [Multiplayer Games](multiplayer-games), as there must be several players sharing the same game situation.",
            "[Save-Load Cycles](save-load-cycles) are more cumbersome to use in [Multiplayer Games](multiplayer-games), since players must negotiate when to load previous game states."
        ]
    },
    "relations": {
        "instantiates": [
            "downtime",
            "synchronous-games",
            "identification"
        ],
        "modulates": [
            "social-organizations",
            "game-mastery",
            "meta-games",
            "social-interaction"
        ],
        "instantiated_by": [
            "tournaments",
            "persistent-game-worlds"
        ],
        "modulated_by": [
            "early-elimination",
            "meta-games",
            "competence-areas",
            "ghosts",
            "downtime",
            "dedicated-game-facilitators",
            "illusionof-influence",
            "skills",
            "game-masters",
            "creative-control",
            "freedomof-choice",
            "tiebreakers",
            "tied-results",
            "balancing-effects",
            "limited-planning-ability",
            "right-levelof-difficulty",
            "smooth-learning-curves",
            "team-play",
            "player-elimination",
            "asymmetric-resource-distribution",
            "player-balance",
            "handicaps",
            "agents",
            "characters"
        ],
        "conflicts": []
    }
}