{
    "name": "Outstanding Features",
    "texts": {
        "definition": "Outstanding Features are parts of the Game World that cannot be manipulated but by their shape, color, or texture convey information to players.",
        "description": [
            "For players to be able to position themselves in [Game Worlds](game-world), there needs to be distinguishing features, those that more strongly attract players' attention to [Outstanding Features](outstanding-features) and can make players aware of where game elements exist or how to navigate the [Game World](game-world)."
        ],
        "examples": [
            "The rivers in \"Civilization\" indicate that cities that are located near them have better production rates."
        ],
        "usage": [
            "[Outstanding Features](outstanding-features) can be achieved in many forms, from the barely noticeable to that of explicit [Extra-Game Information](extra-game-information) describing to the players the game effects of game elements. When not using explicit [Outstanding Features](outstanding-features), the two main design choices can be categorized into first whether the feature should lure or dissuade, and second if the feature should be understandable before any consequences of nearby game elements are noticeable, or after those game elements (e. g., [Deadly Traps](deadly-traps)) have taken effect. The former may make [Surprises](surprises) more difficult, while the second allows for [Strategic Knowledge](strategic-knowledge) if the same [Outstanding Features](outstanding-features) are used again in the game. [Traces](traces) and [Clues](clues) that cannot be manipulated are other examples of [Outstanding Features](outstanding-features).",
            "The actual design of [Outstanding Features](outstanding-features) can range from simple variations in the appearance of the [Game World](game-world) to [Obstacles](obstacles) that give players' [Movement Limitations](movement-limitations) due to their placement. An easy way to create [Outstanding Features](outstanding-features) is to introduce local [Symmetry](symmetry) in an otherwise unsymmetrical environment. If the [Outstanding Features](outstanding-features) have dynamic appearance or can change between different appearances, they can be used as [Status Indicators](status-indicators), for example, to show the status of [Alarms](alarms)."
        ],
        "consequences": [
            "[Outstanding Features](outstanding-features) give players landmarks to support [Game World Navigation](game-world-navigation) in [Game Worlds](game-world), thereby making [Exploration](exploration) goals easier to complete. Another typical use of [Outstanding Features](outstanding-features) is to provide information where abstract game elements, such as [Chargers](chargers), [Resource Locations](resource-locations), and [Resource Generators](resource-generators), are located within the [Game World](game-world). [Strategic Locations](strategic-locations) that do not depend on physical game elements are usually also marked by [Outstanding Features](outstanding-features) in the immediate environment. In a similar fashion, [Outstanding Features](outstanding-features) can be used to let players know or guess the presence of [Deadly Traps](deadly-traps) but might then limit the chances of [Surprises](surprises) working.",
            "In all these cases, [Outstanding Features](outstanding-features) work as [Clues](clues) and noticing them is an \"Illusionary\" Reward, since they may not necessarily aid the players."
        ]
    },
    "relations": {
        "instantiates": [
            "status-indicators",
            "illusionary-rewards"
        ],
        "modulates": [
            "deadly-traps",
            "game-world-navigation",
            "exploration",
            "resource-generators",
            "chargers",
            "game-world",
            "resource-locations",
            "strategic-locations",
            "alarms"
        ],
        "instantiated_by": [
            "symmetry",
            "movement-limitations",
            "clues",
            "traces",
            "obstacles"
        ],
        "modulated_by": [],
        "conflicts": [
            "surprises"
        ]
    }
}