{
    "name": "Paper-Rock-Scissors",
    "texts": {
        "definition": "Sets of three or more actions form cycles where every action has an advantage over another action.",
        "description": [
            "This pattern is based on the children's game with the same name in which players try to outwit each other by guessing what the other ones will do and by tricking other players into take a wrong guess on one's own action. The original game is very simple; after a count to three, both players make one out of three gestures, depicting rock, paper, or scissors. Rock beats (\"smashes\") scissors, scissors beat (\"cut\") paper and paper beats (\"covers\") rock. That there is no winning strategy is the essence of the pattern: players have to somehow figure out what choice is the best at each moment. In general, this may be detectable through variations in the game state or through knowledge about players' tactics and plans."
        ],
        "examples": [
            "The relations between monsters and weapons in \"Quake\" form a [Paper-Rock-Scissors](paper-rock-scissors) relationship, so no weapon was best against all monsters, and players had to switch between weapons to make maximum use of the weapons."
        ],
        "usage": [
            "Games with immediate consequences of choices related to [Paper-Rock-Scissor](paper-rock-scissors) usually have these kinds of choices often in the game to allow people to keep records over other players' behavior. [Quick Games](quick-games) using the pattern, such as the game that lent its name to the pattern, usually are played repeatedly so some form of [Meta Game](meta-games) can be used to allow players to gain knowledge of their opponents' strategies.",
            "A common way to implement the pattern for having long-term effects is through [Investments](investments) to gain [Asymmetric Abilities](asymmetric-abilities), either through [Units](units) or [Character Development](character-development). For this kind of use of the pattern, players can be given knowledge about other players through [Public Information](public-information) or, in the case of games with [Fog of War](fogof-war), through sending [Units](units)."
        ],
        "consequences": [
            "[Paper-Rock-Scissor](paper-rock-scissors) introduces [Symmetry](symmetry) between actions or tactics in a game. It can be implemented either so its choices have immediate consequences (as in the game that gave the pattern its name) or so it has long-term effects. In both cases, it promotes [Tension](tension), either until the moment when the choices are revealed or until the success of the chosen strategies is evident. A [Paper-Rock-Scissor](paper-rock-scissors) pattern introduces a form of [Randomness](randomness) and limited [Predictable Consequences](predictable-consequences) unless players can either gain knowledge about the other players' current activities or keep record over other players' behavior, as otherwise a player has no way of foreseeing what tactics are advantageous. If the game supports knowledge collection, the correct use of the strategies allows for [Game Mastery](game-mastery)."
        ]
    },
    "relations": {
        "instantiates": [
            "meta-games",
            "symmetry",
            "player-balance",
            "game-mastery",
            "tension",
            "randomness"
        ],
        "modulates": [
            "investments",
            "asymmetric-goals",
            "asymmetric-abilities"
        ],
        "instantiated_by": [
            "character-development",
            "asymmetric-abilities",
            "units"
        ],
        "modulated_by": [
            "public-information"
        ],
        "conflicts": [
            "predictable-consequences"
        ]
    }
}