{
    "name": "Pick-Ups",
    "texts": {
        "definition": "Pick-Ups are game elements that exist in the game world and can be collected by players, usually by moving an avatar or Units in contact with the Pick-Up.",
        "description": [
            "Common examples of [Pick-Ups](pick-ups) include weapons, ammunition, and health packs in first-person shooters; money and energy in platform games; and food, wood, money, and metals in real-time strategy games."
        ],
        "examples": [
            "the ammunition packs in \"Quake 3\" are [Pick-Ups](pick-ups) that replenish the players' ammunition."
        ],
        "usage": [
            "[Pick-Ups](pick-ups) are in essence [Resources](resources), and as such, the fundamental game design choice regarding a [Pick-Up](pick-ups) is to decide what the resource is to be used for: is it to gain advantages in possible actions against opponents, to fulfill goals such as [Delivery](delivery), to directly increase winning possibilities or is the resource usable for several different purposes and thus requiring \"Trade-Offs\"? The nature of the [Pick-Up](pick-ups) may not be completely revealed to the player who collects it until it is collected, allowing the game to change the nature of the [Pick-Up](pick-ups) depending on players' positioning, thereby providing [Balancing Effects](balancing-effects). These kinds of [Pick-Ups](pick-ups) can also cause disadvantages to the players.",
            "As [Resource](resources) s that exist in the game world, the design of [Pick-Ups](pick-ups) is linked to the design of [Resource Locations](resource-locations), and the design choices available for the locations have to be considered in parallel with those of the [Pick-Ups](pick-ups). The production of the [Pick-Ups](pick-ups) is another design choice that has to be considered. Is the [Pick-Up](pick-ups) only produced once (maybe at the beginning of the game) and thus providing [Limited Resources](limited-resources) on a global level, or is a type of [Pick-Up](pick-ups) a [Renewable Resource](renewable-resources) that is produced during gameplay? In the latter case, is the location of the production a known place (and thereby a [Strategic Location](strategic-locations)) or is it random? The production may be tied to a \"Resource Generator,\" which may be influenced or destroyed by player actions. The production of the [Pick-Ups](pick-ups) may also require actions by the players, for example, providing [Resources](resources) to a [Converter](converters). In any case, the production of [Pick-Ups](pick-ups) also follows the methods outlined in the more abstract [Producer](producers) pattern.",
            "Most [Pick-Ups](pick-ups) affect numerical characteristics of the [Avatar](avatars) or [Unit](units) that collected the [Pick-Up](pick-ups), e. g., by increasing the player's [Score](score) or an \"Avatar's\" hit points. The simplest way of implementing these is having a specific increase or decrease of one attribute of the game element each time a [Pick-Up](pick-ups) is taken. However, one can also have cut-off limits to promote [Player Balance](player-balance) (e. g., not letting health packs or ammunition replenish past a certain level) or having [Diminishing Returns](diminishing-returns).",
            "A less common type of [Pick-Up](pick-ups), which may also affect numerical characteristics, is a [Tool](tools). [Tools](tools) provide players with [Privileged Abilities](privileged-abilities) but may require resources when used.",
            "A special type of [Pick-Up](pick-ups) is a [Power-Up](power-ups), which gives players a time-limited advantage often consisting of increased efficiency at an action or by providing a [Privileged Ability](privileged-abilities). Other special [Pick-Ups](pick-ups) are those whose only function is to increase a player's [Score](score)."
        ],
        "consequences": [
            "[Pick-Ups](pick-ups) are a very common way to provide [Renewable Resources](renewable-resources) to players, and as such, they provide [Supporting Goals](supporting-goals) requiring [Collecting](collecting) and possibly [Maneuvering](maneuvering). More formalized, [Collection](collection) goals can be constructed by requiring players to get all [Pick-Ups](pick-ups) before being able to advance in the game, e. g., eating all the pills in \"Pac-Man\" before completing the level.",
            "Since the successful collection of [Pick-Ups](pick-ups) has a clear effect in the [Game World](game-world), and it is usually easy to distinguish [Pick-Ups](pick-ups) in the game environment, they make easy goal objectives for [Gain Ownership](gain-ownership) goals. The absence of a [Pick-Up](pick-ups) from a location is a form of [Trace](traces) that players can use to infer activities in the game."
        ]
    },
    "relations": {
        "instantiates": [
            "resource-locations",
            "strategic-locations",
            "collecting",
            "supporting-goals"
        ],
        "modulates": [
            "score",
            "collection",
            "renewable-resources",
            "maneuvering",
            "gain-ownership"
        ],
        "instantiated_by": [
            "delivery"
        ],
        "modulated_by": [
            "renewable-resources",
            "limited-resources",
            "traces",
            "balancing-effects"
        ],
        "conflicts": []
    }
}