{
    "name": "Preventing Goals",
    "texts": {
        "definition": "Goals where the objective is to prevent a completion of another goal.",
        "description": [
            "Some goals are defined as the aim of preventing another goal to be completed. This can be done by actively working against the other goal or by simply ensuring that the goal is not being pursued."
        ],
        "examples": [
            "The goal of the goalkeeper in \"Soccer\" is to prevent the opposing team's players from score goals.",
            "The goal in \"Backgammon\" is to move each individual piece to the inner table and one can prevent the other player from achieving this in two ways: by hitting the opponent's piece when moving one's own pieces or by blocking the piece by placing two or more pieces on area of the game board. The first case directly affects the opponent's piece as it interferes with the game state (the position of the piece) defining the opponent's goal. The second case indirectly prevents the goal as it does not affect the piece but may block future moves of the piece."
        ],
        "usage": [
            "[Preventing Goals](preventing-goals) are closely linked to [Interferable Goals](interferable-goals) (and thereby [Conflict](conflict)) as [Preventing Goals](preventing-goals) can be easily constructed by explicitly rewarding the interference of an [Interferable Goal](interferable-goals). However, [Preventing Goals](preventing-goals) do not have to require that players actively change the game state, as hindering the change of the game state, rather than changing it, may be enough to complete the goal. Thus, [Preventing Goals](preventing-goals) can be completed by simply doing [No-Op](no-ops) actions if no other player is trying to achieve the goal, which may be the result of successful [Negotiation](negotiation).",
            "The creation of a [Preventing Goal](preventing-goals) is easily done by choosing a low-level goal that has to be prevented: [Construction](construction) gives \"Elimination\", \"Elimination\" gives [Survive](survive), [Capture](capture) gives [Evade](evade), [Gain Ownership](gain-ownership) gives [Guard](guard), [Guard](guard) gives [Rescue](rescue), [Gain Information](gain-information) gives [Conceal](conceal), [Traverse](traverse) gives [Herd](herd), and so on. The players can always create these, but the game designer can encourage them by encoding [Preventing Goals](preventing-goals) with explicit [Rewards](rewards).",
            "The possibility of one player completing a [Preventing Goal](preventing-goals) is closely linked to another player's possibility of completing the goal that is to be prevented. As long as there is a theoretical possibility for the other goal to be completed, the [Preventing Goal](preventing-goals) is not fulfilled. This means that unless the player has sufficient information (through [Perfect Information](perfect-information) or [Game State Overview](game-state-overview)) to determine if the underlying goal is achievable, the state of the [Preventing Goal](preventing-goals) is unknown. This can be implemented by having the system indicate when the preventing goal is fulfilled or imposing a [Time Limit](time-limits) on the prevention of the underlying goal."
        ],
        "consequences": [
            "The player or [Agent](agents) that has a [Preventing Goal](preventing-goals) is automatically an [Enemy](enemies) in a [Conflict](conflict) with the player who has the goal that is to be prevented. [Preventing Goals](preventing-goals) are by their nature [Asymmetric Goals](asymmetric-goals), [Excluding Goals](excluding-goals), and [Incompatible Goals](incompatible-goals) to the goals that are to be prevented. As [Preventing Goals](preventing-goals) are defined as goals of avoiding specific conditions within game states to occur, which can also be described as maintaining the game state in the inverse of the condition, [Preventing Goals](preventing-goals) are [Continuous Goals](continuous-goals). Games with [Symmetric Goals](symmetric-goals) as main goals, such as \"Chess\" and \"Go\", usually have a set of [Preventing Goals](preventing-goals) to the main goal to require players to make [Tradeoffs](tradeoffs) between being offensive or defensive.",
            "Naturally, a [Preventing Goal](preventing-goals) makes the goal that it is based upon more difficult to complete, affecting the [Right Level of Difficulty](right-levelof-difficulty) of that goal as well as giving the players with that goal [Limited Planning Ability](limited-planning-ability).",
            "Players may always choose to prevent other players' goals without explicitly stated [Preventing Goals](preventing-goals) with in-game [Rewards](rewards). This means that [Preventing Goals](preventing-goals) can always emerge during gameplay as [Player Defined Goals](player-defined-goals)."
        ]
    },
    "relations": {
        "instantiates": [
            "continuous-goals",
            "conflict",
            "interferable-goals",
            "incompatible-goals",
            "asymmetric-goals",
            "excluding-goals",
            "limited-planning-ability"
        ],
        "modulates": [
            "negotiation"
        ],
        "instantiated_by": [
            "herd",
            "rescue",
            "construction",
            "perfect-information",
            "enemies",
            "player-defined-goals",
            "capture",
            "evade",
            "conceal",
            "guard",
            "survive",
            "eliminate"
        ],
        "modulated_by": [
            "time-limits",
            "game-state-overview"
        ],
        "conflicts": []
    }
}