{
    "name": "Randomness",
    "texts": {
        "definition": "Effects or events in the game cannot be exactly predicted.",
        "description": [
            "[Randomness](randomness) is the process of making effects and events unpredictable in games. It does not necessarily make games totally unpredictable, as the [Randomness](randomness) usually has a structure where players can know the chances for certain effects and events."
        ],
        "examples": [
            "Very few card games do not randomize the cards by shuffling them before giving the players their cards. Not doing so would ruin nearly all games, and especially games that include [Betting](betting).",
            "Many roleplaying games use random encounters to spice up the [Game World](game-world) and give the players the impression that there is more to the [Game World](game-world) than they experience."
        ],
        "usage": [
            "[Randomness](randomness) can be introduced into games to lessen [Predictable Consequences](predictable-consequences) and give players [Limited Foresight](limited-foresight) and [Limited Planning Abilities](limited-planning-ability). This is usually done for two reasons: either to simulate events in the real world that are chaotic and unpredictable or to generate essential [Asymmetric Resource Distribution](asymmetric-resource-distribution) or [Imperfect Information](imperfect-information) in the games.",
            "Examples of real-world concepts that are often modeled in games partially through [Randomness](randomness) include [Combat](combat), and especially [Damage](damage), and the starting conditions for [Characters](characters). The use of [Skills](skills) that represent many actions or actions done in hazardous situations also make use of [Randomness](randomness) to abstract complex situations into a manageable situation in game terms. The use of [Randomness](randomness) in these cases often causes [Tension](tension), as it is part of actions that players have initiated but they do not control, and initiating them becomes a [Risk/Reward](risk-reward) choice for players.",
            "Generating [Asymmetric Resource Distribution](asymmetric-resource-distribution) and [Imperfect Information](imperfect-information) can be done either before the actual game play begins, as for example in many games with [Betting](betting), but can also find use during gameplay. The time until [Delayed Effects](delayed-effects) take place is one example of how [Randomness](randomness) can be used during gameplay. A more complex use is to randomize future events in the [Narrative Structure](narrative-structures) to create [Never Ending Stories](never-ending-stories).",
            "Common game elements used to create [Randomness](randomness) are [Dice](dice) and [Cards](cards), in the latter case, often to create randomized [Card Hands](card-hands) through [Drawing Stacks](drawing-stacks) or dealing out [Cards](cards). The main difference between them is that of memory and static distribution. The roll of [Dice](dice) is unaffected by previous rolls, so the randomization process can be seen as having no memory and the chances for any result are exactly the same as they were the previous time. [Cards](cards), on the other hand, use outcome like a form of [Non-Renewable Resources](non-renewable-resources), so [Memorizing](memorizing) what [Cards](cards) have been used allows players to have better chances of predicting what cards have not been used yet. Further, [Cards](cards) allow the distribution to be changed explicitly during gameplay by adding or removing [Cards](cards) from those that are randomly selected. Tiles can also be used to create [Randomness](randomness), most commonly through [Tile-Laying](tile-laying).",
            "In computers, [Randomness](randomness) is typically generated through pseudo-random sequences that are not random but seem random. In [Self-Facilitated Games](self-facilitated-games), low-level uses of [Paper-Rock-Scissors](paper-rock-scissors) can serve the same purpose for generating [Randomness](randomness)."
        ],
        "consequences": [
            "[Randomness](randomness) makes it impossible to have [Perfect Information](perfect-information) about the effects of actions in the game. [Randomness](randomness) also allows players to have a [Perceived Chance to Succeed](perceived-chanceto-succeed) that does not depend on any skill they have, and thereby reduces pressure on their performance. It does this while still allowing players to have an [Illusion of Influence](illusionof-influence) and feel like they have or lack [Luck](luck), as long as they have some influence on how the randomization is done. As long as players feel this [Illusion of Influence](illusionof-influence) or are emotionally affected by the outcome, [Randomness](randomness) can provide [Tension](tension), as is often done in [Quick Games](quick-games).",
            "[Randomness](randomness) makes the [Predictable Consequences](predictable-consequences) in games vaguer and makes players have a bounded [Uncertainty of Information](uncertaintyof-information). This can encourage players to perform [Memorizing](memorizing) of the distributions to gain [Strategic Knowledge](strategic-knowledge) that can be used to make better [Risk/Reward](risk-reward) choices. The presence of it in games is a weak form of a [Balancing Effect](balancing-effects), as it is not affected by any players' skills and affects all players impartially. This tends to lessen the chance for [Perceivable Margins](perceivable-margins) depending on players' skills in games, makes [Game Mastery](game-mastery) less noticeable, and can lessen the risk (or chance) of [Analysis Paralysis](analysis-paralysis).",
            "As the [Randomness](randomness) used in games typically is bounded within certain values and has a static probability distribution, the use of [Randomness](randomness) can support [Strategic Knowledge](strategic-knowledge) in that players that have played the game before can know the distribution of the [Randomness](randomness) and use it in their planning.",
            "[Randomness](randomness) can create an unstable form of [Player Balance](player-balance). It is unstable because all players may have equal chances to receive what is randomized, but as soon as the outcome becomes apparent, players may feel disadvantaged. The use of [Randomness](randomness) to determine effects can limit the power of [Game Masters](game-masters) if the process is conducted so that all players can see it."
        ]
    },
    "relations": {
        "instantiates": [
            "limited-foresight",
            "strategic-knowledge",
            "player-balance",
            "memorizing",
            "balancing-effects",
            "risk-reward",
            "imperfect-information",
            "tension",
            "luck",
            "limited-planning-ability"
        ],
        "modulates": [
            "never-ending-stories",
            "quick-games",
            "characters",
            "perceived-chanceto-succeed",
            "narrative-structures",
            "asymmetric-resource-distribution",
            "betting",
            "skills",
            "illusionof-influence",
            "delayed-effects",
            "predictable-consequences",
            "uncertaintyof-information",
            "game-masters"
        ],
        "instantiated_by": [
            "damage",
            "combat",
            "cards",
            "drawing-stacks",
            "dice"
        ],
        "modulated_by": [],
        "conflicts": [
            "perceivable-margins",
            "perfect-information",
            "game-masters",
            "game-mastery",
            "analysis-paralysis"
        ]
    }
}