{
    "name": "Replayability",
    "texts": {
        "definition": "The level to which a game provides new challenges or experiences when played again.",
        "description": [
            "Many games are designed to be played many times. In order for these to be interesting, the game must offer new challenges to players or give players new experiences that are perceived as entertaining enough to merit continued playing. The degree to which a game provides these incentives determines its level of [Replayability](replayability)."
        ],
        "examples": [
            "\"Chess\" and \"Go\" have so many possible outcomes that players have very little chance of ever playing two games that are exactly the same. This means that every game session will have new challenges in which players can test their skills.",
            "The multiplayer first-person shooters \"Team Fortress Classic\" and \"Return to Castle Wolfenstein\" and the \"Battlefield\" series allow players to choose a character class to play. This gives them special abilities, which means that beyond the normal differences in gameplay due to varieties in players and levels, players also have different possibilities of what to do and have different roles in their teams."
        ],
        "usage": [
            "[Replayability](replayability) can be achieved by letting the challenges differ between game instances, by letting challenges be solved in several different ways, or by letting players compare results between games through [Trans-Game Information](trans-game-information).",
            "Games that provide [Cognitive Immersion](cognitive-immersion) and have a huge potential game state space seldom offer players exactly the same challenges and thereby provide one form of [Replayability](replayability). [Dedicated Game Facilitators](dedicated-game-facilitators) that are aware of players who have played the game before can change the setup of the particular game instances to provide another way to achieve [Replayability](replayability) by altering the challenges. This can for example be achieved through [Reconfigurable Game World](reconfigurable-game-world), although some games allow the players to reconfigure the [Game World](game-world) without the presence of a [Dedicated Game Facilitator](dedicated-game-facilitators). Different challenges are also provided in games that give [Varied Gameplay](varied-gameplay) by having roles that players have to choose before gameplay proper begins, and by arranging that these roles have [Asymmetric Goals](asymmetric-goals) or [Asymmetric Abilities](asymmetric-abilities).",
            "Letting players complete the game or parts of the game in different ways can be done through [Selectable Sets of Goals](selectable-setsof-goals) or otherwise through the support of [Varied Gameplay](varied-gameplay) within the game. [Optional Goals](optional-goals) give [Freedom of Choice](freedomof-choice) of how to try and solve the overall game. The [Replayability](replayability) of such games increases by letting the players measure how many [Optional Goals](optional-goals) they have completed, for example, by using a [Score](score) or having [Easter Eggs](easter-eggs) that give access to [Inaccessible Areas](inaccessible-areas).",
            "[Replayability](replayability) is often acquired by supporting players to measure the level of their successes or failures. [Score](score) and [High Score Lists](high-score-lists) can be used for this in [Single-Player Games](single-player-games), and allow the players to have a measure of their [Game Mastery](game-mastery), either to let players measure their own skill or to allow a [Social Status](social-statuses) among other players. [Tournaments](tournaments), with the exception of [Polyathlons](polyathlons), allow for a similar type of [Replayability](replayability) as a game is typically played several times to create the outcome of the [Tournament](tournaments). [Near Miss Indicators](near-miss-indicators) can show players how close they were to succeeding, encouraging them to try again and possibility also increasing their chances of succeeding by the information the provide.",
            "[Save-Load Cycles](save-load-cycles) and [Reversability](reversability) provide [Replayability](replayability) on a fundamental level within games. These allow players to do [Experimenting](experimenting) and to choose the length of play sessions, but they have little effect, or negative effect, on [Replayability](replayability) of the game as a whole.",
            "Games that are challenging or provide experiences based upon the lack of knowledge of players, i. e., [Imperfect Information](imperfect-information), are difficult to combine with [Replayability](replayability). This is due to the [Trans-Game Information](trans-game-information) players acquire when they successfully perform [Memorizing](memorizing) of what happens in the game, i. e., when they can apply specific facts learned in one game instance in another game instance. This information can affect [Replayability](replayability) in many ways: [Surprises](surprises) in [Narrative Structures](narrative-structures) will no longer be [Surprises](surprises), [Tension](tension) will be less effective when players experience the same situations, [Puzzle Solving](puzzle-solving) will become trivial if it is not changed between game instances, [Unknown Goals](unknown-goals) will be known in later game instances, and [Exploration](exploration) will be pointless since the environment is already known to the player. An exception to this is presented by [Conceal](conceal) goals in [Multiplayer Games](multiplayer-games), as the challenges in these are to find new hiding places."
        ],
        "consequences": [
            "[Replayability](replayability) in a game offers players enjoyment of a game beyond a single game session. For games that require player skill, [Replayability](replayability) becomes automatic as players strive to achieve, test, and show [Game Mastery](game-mastery). Similarly, when players have [Strategic Knowledge](strategic-knowledge) in games, the games have a certain level of [Replayability](replayability), as players can make use of [Strategic Knowledge](strategic-knowledge) and improve it between game sessions as [Trans-Game Information](trans-game-information)."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "inaccessible-areas"
        ],
        "instantiated_by": [
            "high-score-lists",
            "reconfigurable-game-world",
            "strategic-knowledge",
            "asymmetric-abilities",
            "tournaments",
            "conceal",
            "selectable-setsof-goals",
            "optional-goals",
            "asymmetric-goals",
            "easter-eggs",
            "freedomof-choice",
            "game-mastery",
            "varied-gameplay",
            "reversability",
            "score"
        ],
        "modulated_by": [
            "strategic-knowledge",
            "near-miss-indicators",
            "cognitive-immersion",
            "dedicated-game-facilitators",
            "imperfect-information"
        ],
        "conflicts": [
            "surprises",
            "unknown-goals",
            "memorizing",
            "narrative-structures",
            "tension",
            "puzzle-solving",
            "exploration"
        ]
    }
}