{
    "name": "Resources",
    "texts": {
        "definition": "Game elements that are used by players to enable actions in a game.",
        "description": [
            "[Resources](resources) are the representation of a commodity that is used in the game to fund actions or is depleted by other players' actions. The commodity may exist as a physical game element or as a purely virtual one, or change between both. Common [Resources](resources) in computer games include health and ammunition in first-person shooters, money and units in real-time strategy games, hit points and mana points in roleplaying games, action points in turn-based games, and players and money in sport management games."
        ],
        "examples": [
            "The board game \"Space Hulk\" gives each unit a number of action points at the beginning of a turn. These points are a form of [Resources](resources) that pay for the actions of the units.",
            "\"Victoria\" is an example of a computer game with complex use of resource refinement, for example producing a Tank unit in the game requires the production of the Tank commodity. This commodity, in turn, requires [Resources](resources) that are refined from other [Resources](resources), et cetera."
        ],
        "usage": [
            "The primary question regarding a [Resource](resources) is what it is used for. Generalizing, a [Resource](resources) is used to win a comparison with other players in an evaluation function or can sometimes be converted into actions (possibly providing [Privileged Abilities](privileged-abilities)) or other more valuable [Resources](resources). [Resources](resources) are typically used or consumed by paying for actions through [Budgeted Action Points](budgeted-action-points), becoming part of objects built through [Construction](construction) actions, or being destroyed due to [Damage](damage). Other actions that require the use of [Resources](resources) are [Aim & Shoot](aim-shoot) and [Betting](betting).",
            "When [Resources](resources) can be used for several different purposes, for example, as [Budgeted Action Points](budgeted-action-points), they can be used to modulate the [Right Level of Complexity](right-levelof-complexity) and force players to make [Tradeoffs](tradeoffs). Examples of games using one [Resource](resources) for multiple purposes include the board game \"Carolus Magnus\", where markers can be used to strengthen a fractions control over an area or the players control over the fraction, and the card game \"San Juan\" where each card represents a good, a colonist, money, and a building.",
            "After determining the use of a [Resource](resources), the next question is how players gain access to the [Resources](resources). Players may start with [Non-Renewable Resources](non-renewable-resources) to promote [Stimulated Planning](stimulated-planning) for the whole game session, actions may be require to collect the [Resources](resources) from the [Game World](game-world), [Resource Generators](resource-generators), or [Chargers](chargers), or the [Resources](resources) may be rewards for completing certain goals. Regardless of how players achieve the [Resources](resources), the game may be set up to promote either [Symmetric Resource Distribution](symmetric-resource-distribution) or [Asymmetric Resource Distribution](asymmetric-resource-distribution) to enforce different strategies and [Varied Gameplay](varied-gameplay). However, [Asymmetric Resource Distribution](asymmetric-resource-distribution) may negatively affect [Player Balance](player-balance), unless used in a controlled fashion to provide [Handicaps](handicaps). Goals that give [Resources](resources) as [Rewards](rewards) are in most cases [Supporting Goals](supporting-goals). In addition to completing goals and [Collecting](collecting) them, players may be able to redistribute [Resources](resources) among them through actions such as [Trading](trading) and [Bidding](bidding).",
            "The [Resources](resources) available at the beginning of game play may be the only resources that exist, or they may be [Renewable Resources](renewable-resources). In the latter case, they may be produced from [Resource Generators](resource-generators), handed out at regular time intervals, or be [Rewards](rewards) for completing goals. All these options are examples of how [Producers](producers) can create [Resources](resources), and together with how the [Resources](resources) are consumed, they form [Producer-Consumer](producer-consumer) patterns. When the resources are collected from the [Game World](game-world), several additional design choices are required, including the location of the [Resources](resources), who can see them, and whether there are [Clues](clues) to where they can be found. Are they [Secret Resources](secret-resources) that are hidden by [Fog of War](fogof-war) or can they only be detected by [Privileged Abilities](privileged-abilities)? Are they [Rewards](rewards) for finding [Easter Eggs](easter-eggs)? Do they appear in different amounts or concentrations? What time is required to collect them? What game elements can collect them? Does the possession of them affect game element characteristics? Are they physical entities in the game and, if so, can they be converted to virtual ones? Do players have influence over how they are divided between players through [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties)?",
            "Once possession of a [Resource](resources) is achieved, does it need to be stored in a [Container](container), and is there a maximum of how much of a resource that can be stored? Does the [Resource](resources) need to be used before a certain [Time Limit](time-limits) has expired? Can the [Resources](resources) be lost as an effect of [Penalties](penalties)?",
            "The next question is how control of resources is decided. Is it a [Shared Resource](shared-resources) whose use several players need to agree upon through [Negotiation](negotiation), or is it manipulated by all players through [Indirect Control](indirect-control)? Is the ownership changeable, i. e., can other players steal [Resources](resources) by various actions that have [Transfer of Control](transferof-control) effects, or can the players change [Resources](resources) through [Trading](trading)? When [Resources](resources) are contested but also used to produce [Units](units), the struggle for [Resources](resources) can become a [Red Queen Dilemma](red-queen-dilemmas) where gaining control over larger amounts of [Resources](resources) can only be achieved by consuming larger amounts of [Resources](resources).",
            "In games where several different types of resources are used, knowing how and when to convert one form of resource to another may be part of the [Strategic Knowledge](strategic-knowledge) of the game. The conversion may have inefficient exchange rates (by use of [Diminishing Returns](diminishing-returns)), may require access to a [Converter](converters), or may only be possible through [Trading](trading) with other players.",
            "[Resources](resources) usually have to fit within the [Consistent Reality Logic](consistent-reality-logic) of the game, the main exception being [Time Limits](time-limits) to prevent [Analysis Paralysis](analysis-paralysis) and [Resources](resources) that are primarily used to determine winning conditions. In this light, the concept of [Score](score) can be seen as a [Resource](resources), which is used to determine the winner of a game.",
            "[Units](units) are common [Resources](resources) in god games. The games \"Lemmings\" and \"Pikmin\" both make use of different types of [Units](units) that players have to direct to achieve goals while making [Tradeoffs](tradeoffs) between various actions and what [Units](units) to use. The equivalent to these [Resources](resources) in games using [Avatars](avatars) is [Lives](lives).",
            "The introduction of [Time Limits](time-limits) or [The Show Must Go On](the-show-must-go-on) in games makes time a [Resource](resources) that has to be used efficiently. The computer game \"Space Hulk\" uses two modes of play: a strategic mode, where nothing happens but which is time limited, and a real-time mode, where the [Time Limit](time-limits) is replenished but commands cannot be given to [Units](units), to force players to promote [Tension](tension) together with [Stimulated Planning](stimulated-planning)."
        ],
        "consequences": [
            "[Resources](resources) provide players with quantifiable measures to judge their progress and plan possible future actions, and thereby provide one way for players to have [Emotional Immersion](emotional-immersion) in games. The [Resources](resources) can either exist from the beginning of gameplay or be created through [Producers](producers), and are either destroyed by [Consumers](consumers), transformed through [Converters](converters), or part of [Closed Economies](closed-economies). Games where the goal consist of [Collecting](collecting) various types of [Resources](resources) can use the number of owned [Resources](resources) as a [Score](score), and in games that have a separate [Score](score) system, [Resources](resources) are often used as a second order [Score](score) system to function as [Tiebreakers](tiebreakers). The presence of [Resources](resources) in [Game Worlds](game-world) can motivate [Area Control](area-control) goals and[Exploration](exploration) goals in the case of [Secret Resources](secret-resources). [Resources](resources) are often also used to give [Characters](characters) acting as [Consumers](consumers) or [Converters](converters) the ability to perform actions. In some games, the distribution of [Resources](resources) between players decides the order of [Turn Taking](turn-taking)."
        ]
    },
    "relations": {
        "instantiates": [
            "strategic-knowledge",
            "stimulated-planning",
            "penalties",
            "red-queen-dilemmas",
            "score",
            "varied-gameplay",
            "tradeoffs",
            "easter-eggs",
            "rewards",
            "collecting"
        ],
        "modulates": [
            "exploration",
            "emotional-immersion",
            "player-balance",
            "construction",
            "tiebreakers",
            "area-control",
            "turn-taking",
            "characters",
            "game-world",
            "supporting-goals"
        ],
        "instantiated_by": [
            "time-limits",
            "units",
            "clues",
            "the-show-must-go-on",
            "lives",
            "budgeted-action-points",
            "indirect-control",
            "score"
        ],
        "modulated_by": [
            "damage",
            "shared-resources",
            "bidding",
            "time-limits",
            "resource-generators",
            "trading",
            "closed-economies",
            "consumers",
            "chargers",
            "producers",
            "asymmetric-resource-distribution",
            "container",
            "secret-resources",
            "renewable-resources",
            "limited-resources",
            "ownership",
            "transferof-control",
            "handicaps",
            "diminishing-returns",
            "betting",
            "investments",
            "symmetric-resource-distribution"
        ],
        "conflicts": []
    }
}