{
    "name": "Resource Generators",
    "texts": {
        "definition": "Resource Generators are specific places or game elements producing resources, in effect tying the production of resources in the game to a particular place in the game world.",
        "description": [
            "Games that have resources appear during gameplay usually have specific areas where these resources appear or specific game elements that produce the resources. Both the areas and the producing game elements are [Resource Generators](resource-generators)."
        ],
        "examples": [
            "The place where the bonus items appear in \"Pac-Man.\"",
            "\"WarCraft,\" as well asmany other real-time strategy games, have specific locations, such as cities, which generate resources for the player controlling the location."
        ],
        "usage": [
            "The [Resource Generator](resource-generators) is an instantiating pattern of the [Producer](producers) pattern and as such the concerns which have to be taken into account when instantiating a [Producer](producers) are valid also for the [Resource Generator](resource-generators). Many variables need to be decided on when creating a [Resource Generator](resource-generators): What resources are produced? If several are produced, what is the distribution and is it under the player's control? When are the resources produced, and are there any indications when this will occur and can the player modify the production? Are the produced resources [Pick-Ups](pick-ups)? Is the [Resource Generator](resource-generators) a physical object, and is it moveable or destroyable? If it is not a physical object, is it an [Outstanding Feature](outstanding-features) in the environment so that it can be observed? Is the resource a [Limited Resource](limited-resources), i. e. is a limited amount produced during the game or are the resources available at the start of the game the only resources in the game? Does the generator need other [Resources](resources) to produce? Is the generator a [Charger](chargers) that produces [Resources](resources) that are not represented in the game world and only produces them when a player is activating the generator?",
            "[Resource Generators](resource-generators) do not have to generate passive game elements. Many games make use of [Spawn Points](spawn-points) to create [Units](units), which can be seen as [Resources](resources) to the players. Another example is generators that generate [Enemies](enemies). The players can often destroy these generators in order to prevent them from swarming the game area continuously with [Enemies](enemies).",
            "A [Converter](converters) is an example of [Resource Generators](resource-generators) that need other resources to produce their resource and which can be used to set up complex chains of refinement. A [Mule](mule) is a special form of [Converter](converters) set up by the player by dedicating a character to perform monotonous actions."
        ],
        "consequences": [
            "[Resource Generators](resource-generators) are ways to provide [Renewable Resources](renewable-resources) in [Game Worlds](game-world). [Resource Generators](resource-generators) can become [Strategic Locations](strategic-locations) in [Levels](levels) depending on the importance of the resource being generated. They are typically the objectives for [Gain Ownership](gain-ownership), [Exploration,](exploration) or [Eliminate](eliminate) goals. [Resource Generators](resource-generators) are variants of [Controllers](controllers) when they are physical game elements. If they are not physical game elements, or [Outstanding Features](outstanding-features) in the game environment, knowledge of their location can become more valuable [Strategic Knowledge](strategic-knowledge) than other [Strategic Locations](strategic-locations), and the production generated from them create [Surprises](surprises) to the players.",
            "The production from a [Resource Generator](resource-generators) typically spawns [Ephemeral Goals](ephemeral-goals) as soon as they appear or make a goal have a [Dynamic Goal Characteristics](dynamic-goal-characteristics). [Trading](trading) is a natural option for actions in games where different players are access to different [Resource Generators](resource-generators)."
        ]
    },
    "relations": {
        "instantiates": [
            "exploration",
            "strategic-locations",
            "ephemeral-goals",
            "renewable-resources",
            "trading"
        ],
        "modulates": [
            "gain-ownership",
            "levels",
            "resources",
            "game-world",
            "controllers"
        ],
        "instantiated_by": [
            "dynamic-goal-characteristics",
            "spawn-points",
            "chargers"
        ],
        "modulated_by": [
            "mule",
            "eliminate",
            "limited-resources",
            "outstanding-features"
        ],
        "conflicts": []
    }
}