{
    "name": "Resource Management",
    "texts": {
        "definition": "The players have to plan, manage, and control resource flows within the game in order to reach the goals of the game.",
        "description": [
            "All games where the use of [Resources](resources) is not simply used for bookkeeping require players to perform [Resource Management](resource-management). This includes deciding how to use [Resources](resources) to perform different actions and strive towards different goals as well as planning on how to acquire new [Resources](resources) and judging which [Resources](resources) will be most valuable in the future."
        ],
        "examples": [
            "Almost all strategy games, including real-time ones, have a strong [Resource Management](resource-management) component. The final goal is usually just to overcome the opponents by maximizing the use of the [Resources](resources) available.",
            "\"Magic: The Gathering\", as well as other collectable card games, has [Resource Management](resource-management) in at least three layers. First, when playing a single game instance the cards in the deck selected for the game are the [Resources](resources) that have to be managed to overcome the opponents; second, the cards for that deck usually have to be selected from a much larger collection of cards available; and third, managing the whole collection consists of buying new cards, trading cards with other people, and other methods of obtaining the cards. The last layer of [Resource Management](resource-management) often involves the use of extra-game [Resources](resources), usually real money.",
            "Professional team sports such as \"Soccer\" and \"Ice Hockey\" have a high level [Resource Management](resource-management) layer for managing the composition of the teams."
        ],
        "usage": [
            "The basic building block for instantiating [Resource Management](resource-management) in the game is to have some sort of [Limited Resources](limited-resources), which have a direct impact on the possibilities of reaching the goals of the game through the use of [Producers](producers) and [Consumers](consumers). In \"Chess\", for example, the players have 16 pieces each at the start, and these are [Non-Renewable Resources](non-renewable-resources). The use of [Renewable Resources](renewable-resources) as [Limited Resources](limited-resources) often creates more complex games, especially when there are [Producer-Consumer](producer-consumer) chains with [Converters](converters) for creating the final [Resources](resources) from the basic [Renewable Resources](renewable-resources). For example, in \"Age of Empires\", the basic [Resources](resources), such as wood and food, first have to be gathered from [Resource Locations](resource-locations) back to the stockpiles, the [Containers](container), and then these [Resources](resources) can be refined in [Converters](converters) to [Units](units). In some games, the renewal rate of the [Renewable Resources](renewable-resources) can also be one of the [Resources](resources) to be managed.",
            "Interesting variations of [Resource Management](resource-management) are [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties) where the [Resources](resources) to be managed are, as the name implies, [Rewards](rewards) or [Penalties](penalties) of the game and [Attention Swapping](attention-swapping), where the players' attention is the basic [Resource](resources) to be managed. In many cases of team-oriented [Multiplayer Games](multiplayer-games), the players themselves are also [Resources](resources), which have to be managed as part of [Team Development](team-development). This management level can lead to [Social Organizations](social-organizations) where there is a hierarchy of control similar to the hierarchy of military operations.",
            "In any case, [Resource Management](resource-management) can become uninteresting if there are no [Tradeoffs](tradeoffs) with associated [Risk/Reward](risk-reward) structures. This can happen especially in cases where the availability of the [Resources](resources) is out of balance or where there is a dominant strategy for maximizing the utility of the [Resources](resources).",
            "[Book-Keeping Tokens](book-keeping-tokens) are not used for [Resource Management](resource-management) since they do not require any active decisions, investments, or risks on any players' behalf."
        ],
        "consequences": [
            "[Resource Management](resource-management) gives players a [Freedom of Choice](freedomof-choice) of how to use [Producers](producers) and [Consumers](consumers) in a game and often causes [Gain Ownership](gain-ownership) goals. Games with [Resource Management](resource-management) usually involve long-term [Stimulated Planning](stimulated-planning), and this kind of strategic thinking can lead to [Cognitive Immersion](cognitive-immersion). Games involving management of complex [Producer-Consumer](producer-consumer) chains can make [Resource Management](resource-management) a means through which players can develop [Game Mastery](game-mastery). The [Resource Management](resource-management) involved in these games ranges from controlling the immediate [Resources](resources), for example [Units](units) in a strategy game, to making long term [Investments](investments), such as research in \"Civilization\" to increase the number of different [Unit](units) types available.",
            "If it is possible to quantify how well the players have performed [Resource Management](resource-management), this can be used as a [Tiebreaker](tiebreakers)."
        ]
    },
    "relations": {
        "instantiates": [
            "cognitive-immersion",
            "stimulated-planning",
            "risk-reward",
            "freedomof-choice",
            "game-mastery",
            "tradeoffs"
        ],
        "modulates": [
            "right-levelof-complexity",
            "social-organizations",
            "team-development",
            "tiebreakers"
        ],
        "instantiated_by": [
            "attention-swapping",
            "combat",
            "renewable-resources",
            "betting",
            "investments",
            "units",
            "limited-resources"
        ],
        "modulated_by": [
            "consumers",
            "ownership",
            "container",
            "producers",
            "gain-ownership",
            "converters"
        ],
        "conflicts": []
    }
}