{
    "name": "Rhythm-Based Actions",
    "texts": {
        "definition": "Actions that require players to time their actions several times in a row.",
        "description": [
            "Real-time games require players to act due to events that occur in the game. When these required actions occur in rhythm, they force players to perform [Rhythm-Based Actions](rhythm-based-actions), where the timing and stability over time can be just as important as performing the right action."
        ],
        "examples": [
            "\"Pappa the Rapper\" as well as dancing games such as \"Dance Dance Revolution\" require players to hit various buttons in certain combinations while following certain rhythms. Gameplay is eased by having music or songs that have the same rhythm the players must follow.",
            "Early sports games such as \"Decathlon\" primarily stimulated sports by requiring players to perform long sequences of [Rhythm-Based Actions](rhythm-based-actions) and judging the outcome from how well the players kept the rhythm."
        ],
        "usage": [
            "[Rhythm-Based Actions](rhythm-based-actions) are basically sequences of [Extended Actions](extended-actions) that require [Timing](timing) in [Real-Time Games](real-time-games). Depending on the nature of the actions, feedback to players takes different forms in [Rhythm-Based Actions](rhythm-based-actions): where the actions represent dancing and other non-dangerous activities, [Progress Indicators](progress-indicators) and [Illusionary Rewards](illusionary-rewards) usually provide feedback to how well players are executing the actions, but few [Rewards](rewards) or [Penalties](penalties) that affect the actual activity are given; where the actions are related to [Overcome](overcome) goals or [Combat](combat) actions such as [Combos](combos), failing to keep the rhythm often ends [Extended Actions](extended-actions) but has no further [Penalties](penalties); and where the [Rhythm-Based Actions](rhythm-based-actions) have to do with movement-related [Combos](combos), the effect of failing to keep the rhythm often means that players have to suffer the [Penalties](penalties) associated with [Deadly Traps](deadly-traps).",
            "[Ultra-Powerful Events](ultra-powerful-events),[Moveable Tiles](moveable-tiles), and [Enemies](enemies) with [Reconnaissance](reconnaissance) goals can all be used to require [Rhythm-Based Actions](rhythm-based-actions) in games. The [Right Level of Difficulty](right-levelof-difficulty) of these actions can easily be modulated by the tempo that has to be followed and by providing the [Right Level of Complexity](right-levelof-complexity) of the actions that have to be performed in that tempo."
        ],
        "consequences": [
            "[Rhythm-Based Actions](rhythm-based-actions) are actions performed with the intentions of achieving temporal [Configuration](configuration) goals in [Real-Time Games](real-time-games). The motivation for the [Rhythm-Based Actions](rhythm-based-actions) often comes from [Game Worlds](game-world) where [The Show Must Go On](the-show-must-go-on), and the players are either supposed to follow the rhythm of an [Agent](agents) giving mentorshipor to avoid dangers in the world.",
            "By requiring repetitious actions, either in tempo or in type of action, [Rhythm-Based Actions](rhythm-based-actions) can give [Sensory-Motoric Immersion](sensory-motoric-immersion) and is one type of player skill that can be the basis for [Game Mastery](game-mastery) in games and give variation to [Polyathlons](polyathlons)."
        ]
    },
    "relations": {
        "instantiates": [
            "game-mastery"
        ],
        "modulates": [
            "configuration",
            "overcome"
        ],
        "instantiated_by": [
            "deadly-traps",
            "extended-actions",
            "timing",
            "combos",
            "moveable-tiles",
            "the-show-must-go-on"
        ],
        "modulated_by": [
            "right-levelof-complexity",
            "illusionary-rewards",
            "reconnaissance",
            "progress-indicators",
            "right-levelof-difficulty"
        ],
        "conflicts": []
    }
}