{
    "name": "Roleplaying",
    "texts": {
        "definition": "Players have characters with at least somewhat fleshed out personalities. The play is centered on making decisions on how these characters would take actions in staged imaginary situations.",
        "description": [
            "Imaginary situations and the nature of the players' characters in [Roleplaying](roleplaying) can be almost anything from Conan-style hack'n'slash fantasy to animals wishing to escape from the zoo to bored housewives in the suburbs. Even though the genre of roleplaying games is more or less centered on fantasy, science fiction, and horror themes, roleplaying in general can take form in any kind of setting."
        ],
        "examples": [
            "\"Dungeons &amp; Dragons\", perhaps the best known tabletop fantasy roleplaying game, is actually a game system that can be used in different [Game Worlds](game-world). These [Game Worlds](game-world) can be totally player-created, but there are also commercial game worlds available. The gameplay is based on the group of players that roleplay members of a party going adventuring in sometimes exquisitely detailed fantasy settings with elaborate plot structures. In \"Dungeons &amp; Dragons\", most often only one of the players is the [Game Master](game-masters) (actually Dungeon Master but [Game Master](game-masters) is the more generic term) who acts as the game facilitator presenting and resolving the imaginary situations to the players. The gameplay is usually almost wholly based on verbal communication between the players and the [Game Master](game-masters). Rules, resolution tables, and dice are used to resolve the conflict situations, which usually involve combat between players and monsters.",
            "In Live Action Roleplaying Games (LARPs) the players act out their characters in real life and not only sit around the table talking to each other. The real world is used as the basis for the setting of the game, and sometimes the players put in countless hours of work to make the settings and their characters fit the theme of the game as well as possible. LARPs, of course depending on the play style, are usually more oriented on acting out the roles of the characters than tabletop roleplaying games, and some play styles are closer to improvisational theater than playing games."
        ],
        "usage": [
            "Two main elements of [Roleplaying](roleplaying) games are the players' [Characters](characters) and the imaginary [Game World](game-world), which is often a [Player Constructed World](player-constructed-worlds) and [Persistent Game World](persistent-game-worlds). In immediate [Social Interaction](social-interaction) situations, such as in tabletop [Roleplaying](roleplaying) games, the [Game World](game-world) itself is in the players' imagination. These [Game Worlds](game-world), however, may have extensive amounts of background information available to the players that may include detailed histories, geographies, novels, short stories, campaign settings, and even movies.",
            "Computerized online roleplaying games, such as MUDs and MMORPGs, have and maintain their [Game Worlds](game-world) in digital format. Text-based MUDs also use the players' imagination as an important \"game engine\" for making the [Game Worlds](game-world) come alive while the current MMORPGs shift the focus from the players' imagination to offering [Immersion](immersion) in detailed audio-visual representations of the [Game World](game-world).",
            "The players must obviously somehow have access to the [Characters](characters) in the [Game World](game-world). Many games, especially computer roleplaying games, offer ready-made [Characters](characters) with different kinds of [Skills](skills) and abilities for the players, but it seems that the [Emotional Immersion](emotional-immersion) is more vivid and likely if the players have at least some [Creative Control](creative-control) over their [Characters](characters) and especially [Character Development](character-development) during gameplay. Even seemingly small things, such as changing the color of the hair of an [Avatar](avatars), allow possibilities for further [Identification](identification) with the players' [Characters](characters).",
            "[Roleplaying](roleplaying) games are often played by groups of players promoting [Team Play](team-play) in general. Games with more stable teams also offer possibilities for not only [Character Development](character-development) for single players but for [Team Development](team-development) for members of the team."
        ],
        "consequences": [
            "[Roleplaying](roleplaying), strictly defined, is based on [Identification](identification) between the players and their [Characters](characters) in situations of [Social Interaction](social-interaction). As [Roleplaying](roleplaying) requires that both players doing the roleplaying and players watching it accept the acting, [Roleplaying](roleplaying) requires [Cooperation](cooperation) between the players to create an [Alternative Reality](alternative-reality). It is possible to imagine solitary [Roleplaying](roleplaying) situations, but they are often marginal cases of [Roleplaying](roleplaying) in general. Single-player computer roleplaying games are an example of these situations and they are usually more about [Resource Management](resource-management) of the [Characters](characters) in the game than proper [Roleplaying](roleplaying).",
            "[Roleplaying](roleplaying) games naturally tend to have strong [Narrative Structures](narrative-structures) to motivate the existence of the [Characters](characters) and to also widen the possibilities for [Identification](identification) and deepen possible [Emotional Immersion](emotional-immersion). Especially [Roleplaying](roleplaying) games with human [Game Masters](game-masters) are more or less based on [Storytelling](storytelling), where players and [Game Master](game-masters) together create and tell the story. The [Storytelling](storytelling) in [Roleplaying](roleplaying) games not only drives the game forward but is also a consequence of events in the game and explains events or provides more [Emotional Immersion](emotional-immersion) to the events taking place. All [Roleplaying](roleplaying) games happen in imaginary [Game Worlds](game-world), with the possible exception of some of the therapeutic uses of [Roleplaying](roleplaying), and these [Game Worlds](game-world) are shared fantasies created during the gameplay by the players themselves. Even in cases where players use commercial [Game Worlds](game-world) as the setting for their campaigns, players have to make these settings alive while playing the game, making them [Player Constructed Worlds](player-constructed-worlds)."
        ]
    },
    "relations": {
        "instantiates": [
            "emotional-immersion",
            "creative-control",
            "storytelling",
            "alternative-reality",
            "social-interaction"
        ],
        "modulates": [
            "persistent-game-worlds",
            "team-play",
            "narrative-structures"
        ],
        "instantiated_by": [
            "game-masters",
            "storytelling"
        ],
        "modulated_by": [
            "avatars",
            "character-development",
            "team-development",
            "identification",
            "characters",
            "game-world",
            "player-constructed-worlds"
        ],
        "conflicts": []
    }
}