{
    "name": "Safe Havens",
    "texts": {
        "definition": "Save Havens are locations in the game world where game elements under the players' control are safe from the actions of other players or the game events.",
        "description": [],
        "examples": [
            "\"Super Mario\" 64 has [Safe Havens](safe-havens) between the worlds since the player is safe from the threats and has time to think what to do next.",
            "many first-person shooters have [Safe Havens](safe-havens), some that are temporary and some that cannot be entered after being left. These [Safe Havens](safe-havens) are used to avoid the possibility of spawn killing, i. e. the player being killed immediately after having been being brought back into the game."
        ],
        "usage": [
            "There are two requirements for a place to be a [Safe Haven](safe-havens): first, there should be no environmental elements, such as [Deadly Traps](deadly-traps), that can negatively affect players. Second, no hostile [Agents](agents) or players should be able to affect the area. However, the [Safe Haven](safe-havens) does not have to be permanent, for example it can either be safe under a certain [Time Limit](time-limits) or until the players in the [Safe Haven](safe-havens) perform certain actions. Some [Safe Havens](safe-havens) also make it impossible for players to have negative consequences of their own actions. These forms of [Safe Havens](safe-havens) support [Experimenting](experimenting).",
            "One variant to hinder hostile activities within a [Safe Haven](safe-havens) is to allow hostile [Agents](agents) or players in the area but make hostile actions impossible within the [Safe Haven](safe-havens). Sometimes these kinds of [Safe Havens](safe-havens) are safe only for the lower ranking players. For example, the home cities in \"Dark Age of Camelot\" are safe only for low level characters. By making the [Safe Haven](safe-havens) a neutral area, players can be offered the possibility for [Negotiation](negotiation) and forming [Dynamic Alliances](dynamic-alliances).",
            "[Safe Havens](safe-havens) are often combined with [Spawn Points](spawn-points) to ensure that the [Spawning](spawning) of [Avatars](avatars) or [Units](units) the [Game World](game-world) cannot immediately be followed by attacks by other players. In games with [Team Play](team-play) this allows the teams to at least have a minimal area they always control. Placing [Resource Generators](resource-generators) inside such [Safe Havens](safe-havens) will further enhance the [Balancing Effect](balancing-effects).",
            "One kind of \"Save Haven\" can be constructed by making [Avatars](avatars) and [Units](units) indestructible for a short period of time after spawning. This approach is typically used in multiplayer games with no teams and games where the \"Save Haven\" is publicly accessible to all players."
        ],
        "consequences": [
            "[Safe Havens](safe-havens) naturally create [Goal Points](goal-points) for [Traverse](traverse) goalsand thereby also [Strategic Locations](strategic-locations). As the players can pause and reconsider their next moves there, this also promotes [Stimulated Planning](stimulated-planning) and can be used to lessen [Tension](tension) or to modulate the gameplay to shift between stressful periods and calmer periods."
        ]
    },
    "relations": {
        "instantiates": [
            "stimulated-planning",
            "strategic-locations"
        ],
        "modulates": [
            "save-points",
            "goal-points",
            "stealth",
            "rescue",
            "traverse",
            "inaccessible-areas",
            "spawn-points",
            "negotiation",
            "dynamic-alliances",
            "experimenting",
            "spawning",
            "strategic-locations"
        ],
        "instantiated_by": [],
        "modulated_by": [],
        "conflicts": [
            "time-limits",
            "deadly-traps"
        ]
    }
}