{
    "name": "Self-Facilitated Games",
    "texts": {
        "definition": "Games that require that the players ensure that the rules are being followed and require the players to perform any necessary book-keeping actions.",
        "description": [
            "[Self-Facilitated Games](self-facilitated-games) are those that do not progress unless players perform actions, including actions that are not based upon the intention of reaching goals but for updating the game state indifferently of any players' intentions. Examples of games that are not self-facilitating are betting games in casinos, computer and video games, arcade games, pinball games and novelty games."
        ],
        "examples": [
            "tabletop roleplaying games require that one of the people playing the game takes the role of a game master, not being able to enjoin character development but to have creative control over the story in the game.",
            "all board games and card games require that the players perform all necessary administrative and book-keeping actions and check that the rules are being followed."
        ],
        "usage": [
            "[Self-Facilitated Games](self-facilitated-games) require the will of all the players in [Multiplayer Games](multiplayer-games) to uphold the game state and the game rules, the latter which can be seen as [Strategic Knowledge](strategic-knowledge). The [Memorizing](memorizing) this demands can be made easier in a number of ways: the rules of the game can be made as explicit and deterministic so that any player can perform them while the others watch; [Turn Taking](turn-taking) in [Turn-Based Games](turn-based-games) can be used so that only one player at a time performs actions and the others can check the correctness of the actions; and [Book-Keeping Tokens](book-keeping-tokens) can be used to minimize the amount of the game state that has to be remembered by all players.",
            "Player can be given [Privileged Abilities](privileged-abilities) to help facilitate the game, for example temporary judges. [Game Masters](game-masters) are permanent [Dedicated Game Facilitators](dedicated-game-facilitators) where the facilitators are still perceivable as players with [Privileged Abilities](privileged-abilities), and thereby combining [Dedicated Game Facilitator](dedicated-game-facilitators) with [Self-Facilitated Games](self-facilitated-games). These powers, as well as [Investments](investments) players make to run [Self-Facilitated Games](self-facilitated-games) can give them [Social Status](social-statuses).",
            "Practically any game can be the basis for a [Meta Game](meta-games) based on [Betting](betting) which is facilitated by the players themselves."
        ],
        "consequences": [
            "[Self-Facilitated Games](self-facilitated-games) allow players to set up game sessions independently from outer factors through [Extra-Game Actions](extra-game-actions) as long as the required game elements exist. Although stories and [Storytelling](storytelling) can emerge from [Self-Facilitated Games](self-facilitated-games), for example the story-telling game \"Once Upon a Time\", these games have difficulties having pre-created [Narrative Structures](narrative-structures) that have [Tension](tension) or [Surprises](surprises) due to problems of timing. This does not have to be a problem for [Emotional Immersion](emotional-immersion) though, the creation of [Narrative Structures](narrative-structures) through [Storytelling](storytelling) in [Player Constructed Worlds](player-constructed-worlds) are often an important reason for wanting to participate in these games.",
            "[Ultra-Powerful Events](ultra-powerful-events) are difficult to enforce as players may replace any results with [Player Decided Results](player-decided-results), potentially creating [Player Balance](player-balance) but just as likely causing arguments. Likewise, [Time Limits](time-limits) are harder to enforce and especially events based upon [The Show Must Go On](the-show-must-go-on).",
            "Since the players need to interpret the rules together through [Negotiation](negotiation), rule arguments are likely in [Self-Facilitated Games](self-facilitated-games). For this reason, many games that are self-facilitated normally have judges in [Tournaments](tournaments) of the game or when [Betting](betting) is involved. Sports are examples of [Real-Time Games](real-time-games) and [Synchronous Games](synchronous-games) that are [Self-Facilitated Games](self-facilitated-games) where judges are especially common since rule interpretation depends on physical actions in the real world. However, players can also change the rules in [Self-Facilitated Games](self-facilitated-games) through [Negotiation](negotiation), giving the [Empowerment](empowerment) to enforce [Player Balance](player-balance) through [Handicaps](handicaps). Another way players can be given [Handicaps](handicaps) in [Self-Facilitated Games](self-facilitated-games) is due to the players' ability to revert the game to a previous game state, in effect enforcing [Replayability](replayability)."
        ]
    },
    "relations": {
        "instantiates": [
            "social-statuses",
            "player-decided-results",
            "negotiation",
            "memorizing",
            "empowerment",
            "investments",
            "reversability",
            "synchronous-games"
        ],
        "modulates": [
            "tournaments",
            "multiplayer-games",
            "player-constructed-worlds",
            "betting"
        ],
        "instantiated_by": [
            "turn-taking",
            "game-masters"
        ],
        "modulated_by": [
            "strategic-knowledge",
            "privileged-abilities",
            "storytelling",
            "handicaps"
        ],
        "conflicts": [
            "surprises",
            "time-limits",
            "dedicated-game-facilitators",
            "narrative-structures"
        ]
    }
}