{
    "name": "Shared Penalties",
    "texts": {
        "definition": "The penalty for a failure to meet a requirement in the game is shared between some or all of the participating players.",
        "description": [
            "Games where players, willingly or by force, strive towards achieving common goals usually have [Shared Penalties](shared-penalties) for failing those goals. These penalties may be the loss of common resources or the division of penalties between individual players but the penalties are treated as one penalty for failing one action or goal."
        ],
        "examples": [
            "in Reiner Knizia's \"Lord of the Rings\" if the players do not cooperate well enough to overcome Sauron they all lose the game.",
            "failure to perform a quest in a roleplaying game can sometimes result in the loss of a certain amount of experience points for all the players in the team.",
            "the loss against the other team in \"Soccer\" and other team-oriented sports is, obviously, a shared loss for the team members."
        ],
        "usage": [
            "[Shared Penalties](shared-penalties) are typically designed for games where players have [Team Play](team-play) or perform [Collaborative Actions](collaborative-actions). However, not all players receiving the [Shared Penalties](shared-penalties) have to be the causes, or even aware of the reasons, of the [Penalties](penalties) they have to share. However, if players do not have a good [Game State Overview](game-state-overview) that explains the reason for the [Shared Penalties](shared-penalties) they may lose any [Illusion of Influence](illusionof-influence) they have. The loss of [Shared Resources](shared-resources) is a natural way to create [Shared Penalties](shared-penalties) without singling out any player and can make an [Individual Penalty](individual-penalties) be perceived as [Shared Penalties](shared-penalties). The combination of [Individual Rewards](individual-rewards) and [Shared Penalties](shared-penalties) often gives rise to [Social Dilemmas](social-dilemmas).",
            "[Shared Penalties](shared-penalties) has some natural structural similarities to [Shared Rewards](shared-rewards), especially as to how the [Penalty](penalties) or the [Reward](rewards) is shared between the participating players. However, [Shared Rewards](shared-rewards) are more closely related to reaching the goals while [Shared Penalties](shared-penalties) can be applied also to other kinds of failures than just to failures in reaching a goal. For example, the player making a mistake in \"Ice Hockey\" is taken out from the play for a while, which is at the same time an [Individual Penalty](individual-penalties) for the player, but also a [Shared Penalty](shared-penalties) for the team as they have one player less in play during the time the [Penalty](penalties) is in effect. This is also the case in [Team Elimination](team-elimination) where [Player Elimination](player-elimination) of one player makes the team less efficient.",
            "The kind of [Shared Penalty](shared-penalties) in which the failure of one player has an effect on the efficiency of the whole team is very common in any team-oriented game, from first-person shooters to roleplaying games. Usually the [Individual Penalty](individual-penalties) goes to the player making the mistake, but it is also possible to have other methods from [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties) to using [Randomness](randomness) to distribute the [Penalty](penalties).",
            "The other natural [Shared Penalty](shared-penalties) in team-oriented games is, of course, the failure to reach the [Mutual Goal](mutual-goals) in the game such as having scored more goals in \"Soccer\" than the opposing team. The [Penalty](penalties), however, can be more elaborate and explicit than just losing the game as the previous roleplaying game example demonstrates."
        ],
        "consequences": [
            "[Shared Penalties](shared-penalties), especially when used together with [Shared Rewards](shared-rewards), is a strong way to create more stable and committed [Alliances](alliances) even in the case of [Dynamic Alliances](dynamic-alliances) and can be used to promote [Team Play](team-play). Using [Shared Penalties](shared-penalties) for individual failures in [Team Play](team-play) leads almost invariably to situations where the players in the team tend, or strive, to have the same competence levels.",
            "[Shared Penalties](shared-penalties) give more focus on reaching the [Mutual Goals](mutual-goals) of an [Alliance](alliances) as it gives a certain amount of social control to all the members of the [Alliance](alliances). The use of explicit [Shared Penalties](shared-penalties), where the participating players lose something in the case of failure, is quite rare in games as it is perceived as something which might lead to social conflicts between the players. [Shared Penalties](shared-penalties) can be used in this way to create and maintain [Social Organizations](social-organizations).",
            "Although [Shared Penalties](shared-penalties) are incompatible with [Tiebreakers](tiebreakers), game designs can motivate players to avoid [Tied Results](tied-results) by giving [Shared Penalties](shared-penalties) when they occur."
        ]
    },
    "relations": {
        "instantiates": [
            "penalties",
            "social-dilemmas",
            "mutual-goals"
        ],
        "modulates": [
            "individual-penalties",
            "collaborative-actions",
            "alliances",
            "team-play",
            "social-organizations",
            "mutual-goals"
        ],
        "instantiated_by": [
            "tied-results",
            "team-elimination"
        ],
        "modulated_by": [
            "shared-resources",
            "player-elimination"
        ],
        "conflicts": [
            "individual-penalties",
            "tiebreakers",
            "illusionof-influence"
        ]
    }
}