{
    "name": "Social Interaction",
    "texts": {
        "definition": "Social Interaction is when two or more players have two-way communication between each other, i.e., the other players can respond to the individual player's communication.",
        "description": [
            "[Social Interaction](social-interaction) requires some form of communication, and the lowest level of communication in this context is that at least parts of the game state are common to the players; that is, they have actions available that make game state changes that can be interpreted as meaningful actions by other players. That shows that [Social Interaction](social-interaction) is not only about exchanges of messages but also covers situations of making something together, exchanging gifts, displaying social status and even actions of direct conflict.",
            "The most common situation of [Social Interaction](social-interaction) is when two or more players have gathered in a face-to-face situation to play a game, for example, \"Poker\" or \"Bridge\", or when children set up a game of \"Hide &amp; Seek\" outside while their parents are playing their own games in the living room. Nowadays, Massively Multiplayer Online Games allow thousands, even hundreds of thousands, of players to share the same virtual world, the game state, and to interact in many different ways within that world."
        ],
        "examples": [
            "The board game\"Diplomacy\" has a specific diplomacy phase each turn where players have a possibility to discuss the game situation. In the board game version, this [Social Interaction](social-interaction) normally happens in a face-to-face situation where the non-verbal signs can be even more important than the verbal communication itself in determining the trustworthiness and the stability of the newly forged alliance. Even in blind \"Diplomacy\", where there are no other methods of communication between the players other than by making game state changes, there is [Social Interaction](social-interaction), as the players share the game state and it is possible to determine the other players' intentions and even to form alliances. [Social Interaction](social-interaction) in this variant of the game is very different when players interact face-to-face.",
            "Many massively multiplayer online roleplaying games provide several methods of [Social Interaction](social-interaction) for the players. Those that are [Avatar](avatars) based, for example \"Anarchy Online\" and \"Dark Age of Camelot\", allow the players to customize parts of their repertoire for non-verbal communication through emoting. Even without special emote gestures the non-verbal communication in these games is possible using the \"Avatar's\" orientation, speed of movement, and basic actions, such as jumping, to convey information about the player's intention (moving towards a target), current feelings (changing direction in rapid fashion to state boredom), and guidance (jumping up and down in the same place to direct other players into a specific location)."
        ],
        "usage": [
            "To promote [Social Interaction](social-interaction) in games, players need a reason to communicate with each other. Generalizing, reasons for [Social Interaction](social-interaction) can be divided into those where players want something from other players, those that require players to perform [Collaborative Actions](collaborative-actions) together, or those that affect how such [Cooperation](cooperation) takes place. Wanting something from other players is often based upon [Asymmetric Resource Distribution](asymmetric-resource-distribution) and solved through [Trading](trading) but can also be based on gaining [Social Status](social-statuses). Coordinating [Collaborative Actions](collaborative-actions) through [Social Interaction](social-interaction) is usually motivated by [Shared Resources](shared-resources) and [Shared Rewards](shared-rewards) but can also be required due to [Player Decided Results](player-decided-results) or [Secret Alliances](secret-alliances). This need for coordinating actions is of course common in games with [Team Play](team-play), for example, to make best use of [Privileged Abilities](privileged-abilities). [Social Interaction](social-interaction) in these kinds of activities---and others that require [Cooperation](cooperation) ---can be modulated by [Betrayal](betrayal), [Delayed Reciprocity](delayed-reciprocity), [Bluffing](bluffing), and [Uncommitted Alliances](uncommitted-alliances). Games with [Game Masters](game-masters) or where players do [Storytelling](storytelling) automatically have [Social Interaction](social-interaction) between the players.",
            "[Social Interaction](social-interaction) outside making game state changes requires some kinds of [Communication Channel](communication-channels) between players and can be crudely divided into two categories: natural (or spontaneous) and stimulated [Zagal99]. Natural [Social Interaction](social-interaction) arises from the social situation itself in [Synchronous Games](synchronous-games) and, even though the communication might be about the game, the unfolding of the game itself does not require or rely on the [Social Interaction.](social-interaction) This is the case in \"Chess\" where there might even be intense talking and gesturing between the players but the gameplay itself does not require the players to communicate outside the game or during [Game Pauses](game-pauses). Games of stimulated [Social Interaction](social-interaction), on the other hand, require or rely on players to communicate, that is, the game is impossible to play, or the gameplay experience is extremely impoverished, without players having the ability to communicate. [Multiplayer Games](multiplayer-games) based on dynamics of [Cooperation](cooperation) and [Competition](competition), such as \"Diplomacy\", and games based on asymmetric communication between players, such as \"Pictionary\", are good examples of games that have stimulated [Social Interaction](social-interaction).",
            "Both natural and stimulated [Social Interaction](social-interaction) require methods of communication between the players. One of the basic rules of thumb to create or encourage [Social Interaction](social-interaction) is to provide several different methods of communication for players both within and outside the game. The possibility of [Indirect Information](indirect-information) is very often required to make [Social Interaction](social-interaction) fluid and flexible to the communication styles of people.",
            "The pace of the game, in conjunction with the communication methods available, has a direct impact on the [Social Interaction](social-interaction) of the game. Consider, for example, the differences between the [Social Interaction](social-interaction) in a team-based first-person shooter [Real-Time Game](real-time-games) where the first version allows for natural speech interaction using a walkie-talkie style system and the second only allows typed messages. The second version also illustrates a situation where actions related to communication block actions related to playing the game, that is, both communication and player actions are impossible at the same time, which is an unwanted feature in a game based on fast actions. On the other hand, games based on players performing their actions more or less asynchronously while having a synchronous method of communication, such as the previously mentioned walkie-talkie system, can even hinder [Social Interaction](social-interaction). [Turn Taking](turn-taking) can slow down [Social Interaction](social-interaction) but gives all players the opportunity to participate.",
            "[Social Interaction](social-interaction) is of course difficult to have in [Single-Player Games](single-player-games) but can be simulated through [Agents](agents) or be part of [Meta Games](meta-games) based around a [Single-Player Game](single-player-games)."
        ],
        "consequences": [
            "[Social Interaction](social-interaction) is one of the most complex activities performed in games and thereby gives players a large [Freedom of Choice](freedomof-choice) on how to take part in such activities. [Social Interaction](social-interaction) between players is a way to give players [Emotional Immersion](emotional-immersion), and if players think that they can affect how other players play the game, it also gives an [Illusion of Influence](illusionof-influence). [Social Interaction](social-interaction) is naturally required if a group of players are trying to do [Collaborative Actions](collaborative-actions) or[Cooperation](cooperation). Most forms of [Negotiation](negotiation) ---for example, [Trading](trading), establishing [Dynamic Alliances](dynamic-alliances), or maintaining [Alliances](alliances) ---often use of [Social Interaction](social-interaction). [Bluffing](bluffing) also requires [Social Interaction](social-interaction), and [Social Dilemmas](social-dilemmas) rely heavily upon itto provide [Emotional Immersion](emotional-immersion). [Social Organizations](social-organizations) require frequent [Social Interaction](social-interaction) between the members of the organization to be stable and for members to feel [Identification](identification) with the organization and maintain their [Social Status](social-statuses). Similarly, [Player Constructed Worlds](player-constructed-worlds) need [Social Interaction](social-interaction) to coordinate the construction and maintenance of the [Game World](game-world).",
            "The vast majority of games are played in a social situation where [Social Interaction](social-interaction) between the players is at least as important an aspect of playing the game as the outcome of the game itself, and this is especially common in [Persistent Game Worlds](persistent-game-worlds). [Social Interaction](social-interaction) is in itself sometimes the main reason for playing the game, for example, even hardcore fans of roleplaying games agree that a major part of the fun comes from the pure [Social Interaction](social-interaction) required by [Roleplaying](roleplaying)."
        ]
    },
    "relations": {
        "instantiates": [
            "collaborative-actions",
            "alliances",
            "emotional-immersion",
            "illusionof-influence",
            "freedomof-choice",
            "social-organizations",
            "bluffing"
        ],
        "modulates": [
            "player-constructed-worlds"
        ],
        "instantiated_by": [
            "shared-resources",
            "social-dilemmas",
            "dynamic-alliances",
            "persistent-game-worlds",
            "team-play",
            "game-masters",
            "turn-taking",
            "storytelling",
            "roleplaying",
            "cooperation",
            "trading"
        ],
        "modulated_by": [
            "social-statuses",
            "shared-resources",
            "indirect-information",
            "competition",
            "agents",
            "identification",
            "betrayal",
            "secret-alliances",
            "shared-rewards",
            "social-organizations",
            "uncommitted-alliances",
            "game-pauses",
            "asymmetric-resource-distribution",
            "privileged-abilities",
            "delayed-reciprocity",
            "player-decided-results",
            "bluffing",
            "synchronous-games",
            "multiplayer-games"
        ],
        "conflicts": []
    }
}