{
    "name": "Spectators",
    "texts": {
        "definition": "People, possibly former, current, or future players, who observe the actions that players do in a game without being able to affect the game themselves.",
        "description": [
            "Not all people who can observe the development of a game played are players. Those who cannot directly affect the game as a player are [Spectators](spectators). While these do not experience gameplay directly, they can gain an experience from watching the game and can learn or prepare to play the game."
        ],
        "examples": [
            "players whose avatars are killed in \"Counterstrike\" have to wait until the next game begins before being able to play. Depending on the server, they may be able to watch as [Spectators](spectators) while they are waiting or can only view a scoreboard.",
            "most tournaments have spectators to the individual games that are played. This allows people participating in the tournament but not in the individual game to follow the gameplay as well as letting other interested people follow the whole tournament."
        ],
        "usage": [
            "[Spectators](spectators) can either be people who will not be players at all in a game session at all or be used to give players information about the game while not playing or being able to act within it. In either case, they need to be provided with [Public Information](public-information) in order to be considered [Spectators](spectators) as they otherwise have no information about the game state. Players currently in the game can temporarily become [Spectators](spectators) by [Ultra-Powerful Events](ultra-powerful-events) or [Turn Taking](turn-taking) and [Spectator](spectators) can be used to instantiate [Downtime](downtime) as a form of [Penalty](penalties). Late arriving players can be given a [Game State Overview](game-state-overview) by being [Spectators](spectators) for a short period of time before joining the game while games which have [Player Elimination](player-elimination) and especially [Early Elimination](early-elimination) can use [Spectators](spectators) to allow the eliminated players to continue to follow the gameplay.",
            "[Spectators](spectators) that never become players in a game instance can still affect the outcome of the game. The most common form is by encouraging or discouraging specific players or teams, but some games such as \"Who wants to be a Millionaire?\" let [Spectators](spectators) give players advice."
        ],
        "consequences": [
            "The use of [Spectators](spectators) in games allows players to show their [Game Mastery](game-mastery) and from this display gain [Social Status](social-statuses). Allowing people to be [Spectators](spectators), as for example is common in [Tournaments](tournaments), make it possible for these players to gain [Strategic Knowledge](strategic-knowledge) about the game and make perform mentorshipthrough showing how to perform actions possible. The use of [Spectators](spectators) allows people that are not players in one game to be players in [Meta Games](meta-games) based upon the game.",
            "[Spectators](spectators) allow [Social Interaction](social-interaction) for players of games, even if the games are [Single-Player Games](single-player-games)."
        ]
    },
    "relations": {
        "instantiates": [
            "social-statuses",
            "downtime",
            "strategic-knowledge",
            "penalties"
        ],
        "modulates": [
            "early-elimination",
            "tournaments",
            "game-mastery",
            "game-state-overview",
            "player-elimination"
        ],
        "instantiated_by": [
            "turn-taking",
            "public-information"
        ],
        "modulated_by": [
            "meta-games"
        ],
        "conflicts": []
    }
}