{
    "name": "Stealth",
    "texts": {
        "definition": "Stealth is the goal to move through a certain area and perform an action without being detected.",
        "description": [
            "Sometimes favorable conditions in a game can be achieved by not having one's actions noticed by other players. When this is the case, players have [Stealth](stealth) goals that force them to plan actions that minimize the risks of being noticed while still completing the required actions."
        ],
        "examples": [
            "\"Thief: The Dark Project\" and the other games in the series exemplify a game using [Stealth](stealth). The player is a master thief, Garrett, who lives in a medieval fantasy world and performs his duties by relieving the rich nobles of their riches. The main goal is to collect the valuable items, while the secondary goal is to avoid being detected by the [Guards](guard) while moving around the [Level](levels) s.",
            "Many children's' games are based on one person trying to find the other players while at the same time trying to [Guard](guard) an area that is a safe zone for the other players. If the other players, by a combination of stealth and running, make it to the safe zone they are home free and do not have to be the player guarding the safe zone in the next game."
        ],
        "usage": [
            "[Stealth](stealth) is a compound goal pattern using [Conceal](conceal) together with [Evade](evade) with a secondary goal involving [Movement](movement) or other actions from the player, normally [Rescue](rescue), [Traverse](traverse), [Delivery](delivery), [Camping](camping), or [Gain Ownership](gain-ownership) (including gaining [Area Control](area-control) simply by being undetected in a particular place). Designing the [Stealth](stealth) goal consists not only of choosing between the different design options of these patterns, but also determining what player actions can reveal the players and what the [Tradeoffs](tradeoffs) are between the various [Risk/Reward](risk-reward) relations for each action in a given context.",
            "Longer [Stealth](stealth) goals can be divided into parts that require short [Stealth](stealth) goals to be fulfilled in order to avoid [Guards](guard) and [Alarms](alarms), short bursts of action to [Overcome](overcome) enemy [Units](units) without them activating [Alarms](alarms), and [Tension](tension) -filled moments when the best option for the player is to perform [No-Ops](no-ops). The complexity of [Stealth](stealth) goals can be increased by letting [Guards](guard) have [Reconnaissance](reconnaissance) goals so that players have to take their [Movement](movement) into consideration."
        ],
        "consequences": [
            "[Stealth](stealth) is the goal of trying to [Conceal](conceal) one's location while having to move. [Stealth](stealth) goals may require players to pace themselves as quick [Movement](movement) may have too high risks, and sometimes any action or [Movement](movement) may cause the goal to fail. [Stealth](stealth) can thus create [Tension](tension) as players may have no [Freedom of Choice](freedomof-choice) except to perform [No-Op](no-ops) actions to continue to [Conceal](conceal) themselves hoping not to be detected by opponents (which actually represents a form of [Area Control](area-control)). The slow tempo and possible pauses in completing [Stealth](stealth) goalsgive players a chance to make use of [Strategic Knowledge](strategic-knowledge), for example the locations of [Alarms](alarms), making the game with the pattern have [Stimulated Planning](stimulated-planning).",
            "Most cases of [Stealth](stealth) rely on opponents having [Guard](guard) or [Reconnaissance](reconnaissance) as [Preventing Goals](preventing-goals), making [Stealth](stealth) and these goals[Excluding Goals](excluding-goals). Giving players [Stealth](stealth) goals combined with [Herd](herd) goals increases the chances of failure and may limit the[Right Level of Difficulty](right-levelof-difficulty) of the goals."
        ]
    },
    "relations": {
        "instantiates": [
            "evade",
            "stimulated-planning",
            "tension",
            "movement",
            "area-control"
        ],
        "modulates": [
            "delivery",
            "rescue"
        ],
        "instantiated_by": [
            "reconnaissance"
        ],
        "modulated_by": [
            "safe-havens",
            "guard",
            "alarms",
            "risk-reward",
            "tradeoffs",
            "traverse",
            "gain-ownership",
            "camping"
        ],
        "conflicts": [
            "herd"
        ]
    }
}