{
    "name": "Symmetric Goals",
    "texts": {
        "definition": "The players have goals with the same definition, for example, to be the first one to reach a certain area or amount of points, solve a problem, find an item, or overcome the opponent.",
        "description": [
            "[Symmetric Goals](symmetric-goals) are goals that several different players have that can be generalized to fit the same definition without changing the structure of the individual goal definitions. For example, \"Chess\" has the goals \"capture the white king\" and \"capture the black king,\" which although not exactly the same, can be generalized as \"capture the other player's king,\" which has the same basic structure and clarifies what actions are necessary to complete the goal."
        ],
        "examples": [
            "An archetypical [Symmetric Goal](symmetric-goals) is that of a simple race: to be the first player to reach a goal.",
            "A typical example of a [Symmetric Goal](symmetric-goals) is to surround the highest number of empty spaces in Japanese versions of \"Go\"."
        ],
        "usage": [
            "If the relevant information is available, [Symmetric Goals](symmetric-goals) can allow players to anticipate other players' strategies, so setting the [Right Level of Complexity](right-levelof-complexity) in a game with [Symmetric Goals](symmetric-goals) depends on how information is presented. Allowing [Perfect Information](perfect-information) may allow [Strategic Knowledge](strategic-knowledge) but also [Analysis Paralysis](analysis-paralysis) so that a [Time Limit](time-limits) might be necessary. [Imperfect Information](imperfect-information) or [Game State Overview](game-state-overview) may support [Strategic Knowledge](strategic-knowledge) to a certain extent but without ending up with [Analysis Paralysis](analysis-paralysis). Combining [Unknown Goals](unknown-goals) with [Symmetric Goals](symmetric-goals) is difficult, since players may infer other players' goals from the similarity in actions between them.",
            "Further, some [Symmetric Goals](symmetric-goals) are [Interferable Goals](interferable-goals), e. g., [Last Man Standing](last-man-standing) and [King of the Hill](kingofthe-hill), while others can either be totally under player's control or not, e. g., [Race](race). The choice of whether to use [Symmetric Goals](symmetric-goals) that are also [Interferable Goals](interferable-goals) depends on the game designer's choice of having a presence of [Role Reversal](role-reversal), [Conflict](conflict), or [Competition](competition) in the game.",
            "Goals where players engage in direct competition against each other, for example [Overcome](overcome), are by their nature [Symmetric Goals](symmetric-goals). In contrast, if the [Symmetric Goal](symmetric-goals) is defined without reference to individual players or their elements, the goal can be a \"Mutual Goal.\""
        ],
        "consequences": [
            "[Symmetric Goals](symmetric-goals) provide one form of [Symmetry](symmetry) in games, and in traditional games, together with [Symmetric Resource Distribution](symmetric-resource-distribution) and [Symmetric Information](symmetric-information), it been a common technique in ensuring [Player Balance](player-balance). However, to provide a [Right Level of Complexity](right-levelof-complexity), these games usually provide a large possible set of game states with few [Closure Points](closure-points) and many game states that match the goal states. This usually leads players to developing different strategies and quickly achieving different positions in the game, making the players have [Asymmetric Goals](asymmetric-goals) as subgoals towards each other even though the main goals in a game instance remain symmetric.",
            "[Mutual Goals](mutual-goals) between players are always [Symmetric Goals](symmetric-goals)."
        ]
    },
    "relations": {
        "instantiates": [],
        "modulates": [
            "conflict",
            "competition"
        ],
        "instantiated_by": [
            "last-man-standing",
            "overcome",
            "mutual-goals",
            "kingofthe-hill",
            "race"
        ],
        "modulated_by": [
            "interferable-goals"
        ],
        "conflicts": [
            "unknown-goals",
            "asymmetric-goals"
        ]
    }
}