{
    "name": "Team Play",
    "texts": {
        "definition": "Players in a group or a team coordinate their actions, abilities, and roles in order to reach a common goal.",
        "description": [
            "Games may put players in the same teams to try to achieve goals together. These teams may be explicitly defined at the beginning of the game sessions, and possibly extended over several game sessions, or they may occur dynamically during gameplay. The former kinds of teams are usually quite stable, or the teams have at least stable roles for players with different kinds of abilities and competences. Managing the team composition itself is part of [Team Play](team-play)."
        ],
        "examples": [
            "The players in a \"Soccer\" team have different roles in the team from goalkeeping to attacking, the players usually have different abilities, and during the match they have to coordinate their actions to beat the opposing team.",
            "Members of teams in roleplaying games usually have different kinds of abilities, and the teams form around players whose abilities complement each other. For example, the classic fantasy roleplaying group consists of a wizard who can cast attack spells, a priest who can heal and cast protective spells, a thief who can open locks and detect traps, and a couple of fighters who can handle the actual combat with the monsters. This kind of [Team Play](team-play) is also very widespread in current MMORPGs."
        ],
        "usage": [
            "[Team Play](team-play) can either be between players in [Multiplayer Games](multiplayer-games) or simulated through [Units](units) that are under one player's control. [Team Play](team-play) does not require formalized teams as it can exist in [Dynamic Alliances](dynamic-alliances) as well, but it does require that the participants have some form of [Mutual Goal](mutual-goals) or [Shared Resource](shared-resources) that has to be managed. The possibility of [Team Play](team-play) in games requires that the game designer not only take [Player Balance](player-balance) into account but also [Team Balance](team-balance) to balance the game.",
            "Teams involved in [Team Play](team-play) are a stable form of [Alliance](alliances) and they are governed by the same principles. Often, especially when the teams are stable, they are also [Social Organizations](social-organizations) with the associated [Social Statuses](social-statuses) of the team members and methods of identifying the other team members such as [Handles](handles). [Team Play](team-play) is almost impossible without at least some kind of a [Mutual Goal](mutual-goals) for the members of the team. The team members are more committed to reaching the [Mutual Goals](mutual-goals) and more committed to the team itself when the individual members feel that their individual contribution is important and significant; that is, that they have an [Illusion of Influence](illusionof-influence). One way to accomplish this is to give the members of the team [Asymmetric Abilities](asymmetric-abilities) or [Privileged Abilities](privileged-abilities) and also to design the goals and the opposition in such way that it requires the coordinated use of these abilities, for example, maintaining [Area Control](area-control) over several different areas or requiring [Area Control](area-control) of one area while at the same time completing some other goal. Another way is to structure gameplay in such fashion that it creates [Orthogonal Unit Differentiation](orthogonal-unit-differentiation) between the members of the team, as is the case in \"Soccer\" and \"Ice Hockey\". Some goals, such as [King of the Hill](kingofthe-hill), only need one player to achieve the goal but are easier to achieve if other players provide support. [Individual Rewards](individual-rewards) for completing goals that also benefit formalized teams can promote [Team Play](team-play). It is possible to reward the players during the gameplay with [New Abilities](new-abilities) to heighten [Asymmetric Abilities](asymmetric-abilities) and to promote [Team Development](team-development).",
            "The [Rewards](rewards) for reaching the [Mutual Goal](mutual-goals) of the team are often [Shared Rewards](shared-rewards) and the [Penalties](penalties) for failures are often [Shared Penalties](shared-penalties), as in [Team Elimination](team-elimination). In some cases, [Player-Decided Distribution of Rewards & Penalties](player-decided-distributionof-rewards-penalties) can be used to further encourage the [Social Interaction](social-interaction) between team members. [Individual Penalties](individual-penalties) for the team members in many cases are at the same time [Shared Penalties](shared-penalties) for the whole team if the [Individual Penalty](individual-penalties) has an effect on the efficiency of the team.",
            "Even the perceived possibility of [Betrayal](betrayal) by one or some of the team members can obstruct the [Team Play](team-play), especially when the teams are supposed to be stable. Players who perceive that other players do not do their best, or that they even hinder team performance, lose much of their commitment to the team. It is also obvious that the players who are ready to commit [Betrayal](betrayal) do not enhance [Team Play](team-play).",
            "If the game has a possibility for [Player Killing](player-killing), it has to be decided whether the members of a team can hurt the other members of the team."
        ],
        "consequences": [
            "[Team Play](team-play) is based around some form of formalized [Cooperation](cooperation). As members of a team have to coordinate their actions during the actual gameplay, [Team Play](team-play) creates [Collaborative Actions](collaborative-actions) and promotes [Constructive Play](constructive-play). When teams are maintained between game sessions, they can form stable [Social Organizations](social-organizations) due to the constant [Social Interaction](social-interaction) between the members of the team. The persistence of a team allows for [Team Development](team-development) to occur, while the [Social Interaction](social-interaction) within the team allows individual players to gain a [Social Status](social-statuses) and a [Competence Area](competence-areas). These effects can give players [Empowerment](empowerment) as can the feeling of taking part in [Collaborative Actions](collaborative-actions) that otherwise would not be possible."
        ]
    },
    "relations": {
        "instantiates": [
            "competence-areas",
            "constructive-play",
            "cooperation",
            "social-interaction"
        ],
        "modulates": [
            "shared-resources",
            "multiplayer-games",
            "kingofthe-hill"
        ],
        "instantiated_by": [
            "asymmetric-abilities",
            "units",
            "social-organizations",
            "mutual-goals",
            "area-control"
        ],
        "modulated_by": [
            "individual-penalties",
            "collaborative-actions",
            "penalties",
            "shared-penalties",
            "planned-character-development",
            "team-balance",
            "empowerment",
            "team-development",
            "dynamic-alliances",
            "illusionof-influence",
            "new-abilities",
            "privileged-abilities",
            "shared-rewards",
            "roleplaying",
            "player-killing",
            "orthogonal-unit-differentiation",
            "individual-rewards",
            "handles",
            "team-elimination",
            "cooperation"
        ],
        "conflicts": []
    }
}