{
    "name": "Tiebreakers",
    "texts": {
        "definition": "A rule that distinguishes outcomes in a game from each other so that what would otherwise be a tie in the results can be treated as having quantitative differences.",
        "description": [
            "Many games have as important parts of gameplay that the actions performed are compared against each other, and players try to perform better than the others or in some cases try to at least not be the one who performed the worst. In these games, tied results can be problematic since they may remove the overall sense of game play and special rules, [Tiebreakers](tiebreakers), are used to make it impossible to have tied results."
        ],
        "examples": [
            "Highscore lists in games usually give precedence to older results when new score has the same value as older scores.",
            "the board game \"Puerto Rico\" is won by having the highest amount of victory points. In the case of two or more players having the same amount, the winner is determined by who of those players have the greatest amounts of money and goods."
        ],
        "usage": [
            "[Tiebreakers](tiebreakers) are introduced to avoid [Tied Results](tied-results) and can be achieved in two ways. The first way is to ensure that the primary goal cannot be achieved by two or more players simultaneously and the second way is to have additional rules that are used when [Tied Results](tied-results) happen. Examples how [Tied Results](tied-results) can be avoided in the first place is to make sure players have [Excluding Goals](excluding-goals), making [Tournaments](tournaments) where the number of victories or points cannot be the same, or having [Dynamic Goal Characteristics](dynamic-goal-characteristics) so that [Perceivable Margins](perceivable-margins) are required to win.",
            "When [Tied Results](tied-results) can exist, the additional rules introduced to create [Tiebreakers](tiebreakers) usually try to continue measuring the success or failure of the results by how efficiently the results were achieved. This is usually through how players have performed [Resource Management](resource-management) of the [Resources](resources) that influenced the main results. So for example, in soccer tournaments winning games may give points, but if two teams have the same score one can compare goal differences to determine which team had the most overwhelming victories. When the [Tiebreaker](tiebreakers) can itself be tied, additional [Tiebreakers](tiebreakers) can be added until the likelihood of [Tied Results](tied-results) become insignificant or impossible."
        ],
        "consequences": [
            "[Tiebreakers](tiebreakers) are needed to differentiate results between players, or sometimes between players and [Agents](agents), and therefore are often present in any game with [Overcome](overcome) goals, or [Multiplayer Games](multiplayer-games) with [Conflict](conflict) or [Competition](competition). Their presences increase the [Tension](tension) and level of [Conflict](conflict) in these games since they make it impossible to have [Negotiation](negotiation) to create [Uncommitted Alliances](uncommitted-alliances) with the aims of achieving [Tied Results](tied-results) with [Shared Rewards](shared-rewards) or [Shared Penalties](shared-penalties).",
            "[Tiebreakers](tiebreakers) are most commonly needed when the values used to measure success or failure for different players are independent from each other, for example [Races](race) where players cannot affect each other or where the increase or decrease of one player's [Score](score) does not affect other players' [Score](score) values. In some cases, as for example [Tournaments](tournaments) and \"Highscore Lists\", the values that have to be compared are not even from the same game sessions."
        ]
    },
    "relations": {
        "instantiates": [
            "conflict",
            "excluding-goals",
            "tension"
        ],
        "modulates": [
            "high-score-lists",
            "conflict",
            "competition",
            "tournaments",
            "overcome",
            "multiplayer-games",
            "race",
            "score"
        ],
        "instantiated_by": [
            "perceivable-margins",
            "tournaments"
        ],
        "modulated_by": [
            "resources",
            "resource-management"
        ],
        "conflicts": [
            "shared-penalties",
            "negotiation",
            "shared-rewards",
            "uncommitted-alliances",
            "tied-results"
        ]
    }
}