{
    "name": "Time Limits",
    "texts": {
        "definition": "The Time Limit for completing an action, reaching a goal, staying in a certain mode of play, or finishing a game session has a limit based on either game time or real time.",
        "description": [
            "The [Time Limit](time-limits) s can be hybrid between the game time and real time in a game. [Time Limits](time-limits) can limit the duration of the game instance in games in which there are otherwise no natural end conditions for the game."
        ],
        "examples": [
            "\"Soccer\" has a [Time Limit](time-limits) of 90 minutes for a single game instance. The teams try to score as many goals as possible during this time.",
            "\"Chess\" can have [Time Limits](time-limits) for both making one move or for the whole duration of the game. The [Time Limit](time-limits) for the whole duration of the game can be based on game time, i. e. how many moves are allowed, or in real time, for example, stating that the whole duration of the game instance can be maximum of five minutes.",
            "some level based games have [Time Limits](time-limits) for completing the level. If the players are unable to complete the level within the [Time Limit](time-limits) they have to restart the level from the beginning or face other negative consequences."
        ],
        "usage": [
            "[Time Limits](time-limits) can be used from at least three different points of view: first, to create [Tension](tension) for the players for achieving a goal or performing some actions in the game; second, to limit the effect of consequences of player actions and game events, such as effects of some types of [Penalties](penalties), [Rewards](rewards), and [Power-Ups](power-ups); and third, to limit the lifespan of game instances or modes of play or to make [Tied Results](tied-results) possible. The first point of view can be the effect of [The Show Must Go On](the-show-must-go-on) as players may experience [Penalties](penalties) if they remain passive. An example of the third point of view is to make [Resources](resources) expire after a certain [Time Limit](time-limits), something that often occurs naturally with [Shared Resources](shared-resources) through other players' exploitation of the [Resources](resources). All these three kinds of [Time Limits](time-limits) are somewhat cumbersome to use in [Self-Facilitated Games](self-facilitated-games) unless the measuring of the time is designed as an integral part of the gameplay. [Game Pauses](game-pauses) with [Real-Time Games](real-time-games) can disrupt the effect of [Time Limits](time-limits) for reaching goals and performing actions. For example, if the player is allowed to pause the game in \"Tetris\" the natural [Time Limit](time-limits) on planning is destroyed.",
            "Modulating [Tension](tension) for reaching goals with [Time Limits](time-limits) requires that the players are given clear indications of the goals with [Goal Indicators](goal-indicators) and also that there is [Status Indicator](status-indicators) of the time left or at least a [Progress Indicator](progress-indicators) of how much the players have achieved so far. [Progress Indicators](progress-indicators) are also good to use when the [Time Limits](time-limits) are used in [Delayed Effects](delayed-effects). A slightly special case of this kind of modulation is to have a [Time Limit](time-limits) on the life time of [Ephemeral Goals](ephemeral-goals) where the goal is available for the players only for a certain amount of time during the game. This is sometimes used in setting up specific missions in MMORPGs.",
            "[Power-Ups](power-ups) and [Penalties](penalties) for the players often use [Time Limits](time-limits) to balance the gameplay and provide more [Varied Gameplay](varied-gameplay). The [Time Limit](time-limits) can be used with \"Privileged Actions\", \"New Abilities, Improved Abilities, Decreased Abilities, Ability Losses\", and [Game Pauses](game-pauses) as well as other patterns. The [Time Limit](time-limits) does not only have to concern how long a [Power-Up](power-ups) persists or how long an action lasts but can also be how long it takes before a new [Power-Ups](power-ups) appears or the action can be performed again, in both cases determining, in a sense, the interval for [Renewable Resources](renewable-resources) to appear.",
            "Games in which modes of play or game instances do not have natural end conditions often use [Time Limits](time-limits) as end conditions, for example, in \"Soccer\" or in some [Quick Games](quick-games). Games with [Continuous Goals](continuous-goals), such as [Preventing Goals](preventing-goals), sometimes use [Time Limits](time-limits) also in similar fashion to determine winning conditions. For example, in [King of the Hill](kingofthe-hill) variants the winner is the first player to remain the king for a certain period of time, say three minutes, which also acts as an end condition for the game instance."
        ],
        "consequences": [
            "[Time Limits](time-limits) make time a [Resource](resources), more specifically a [Limited Resource](limited-resources), for players. They automatically give players [Limited Planning Ability](limited-planning-ability), which can give game design the [Right Level of Difficulty](right-levelof-difficulty), and make the players have to accept [Tradeoffs](tradeoffs) between which actions they want to perform, including evaluating the [Tradeoffs](tradeoffs) themselves. [Time Limits](time-limits) may be used to control the contraction of [Shrinking Game Worlds](shrinking-game-world), create [Tick-Based Games](tick-based-games), or limit how often [Resources](resources) can be invested when situations where[Arithmetic Rewards for Investments](arithmetic-rewardsfor-investments) exist.",
            "[Time Limits](time-limits) when the players have some indication of the duration of the [Time Limit](time-limits) naturally create [Anticipation](anticipation) and sometimes [Hovering Closures](hovering-closures) and modify also the [Tension](tension) structures of games. Often [Time Limit](time-limits) is used to have more pressure on the players to achieve a goal, leave areas in the [Game World](game-world), such as [Deadly Traps](deadly-traps) and [Safe Havens](safe-havens), or to perform other types of actions, for example, [Trading](trading) and [Puzzle Solving](puzzle-solving). [Time Limits](time-limits) used for [Turn Taking](turn-taking), and [Game Pauses](game-pauses) in general, limit the possible [Downtime](downtime). [Time Limits](time-limits) on game instances can also alleviate some of the downsides of [Early Elimination](early-elimination) as the eliminated players have a clear indication how long that game instance is going to last."
        ]
    },
    "relations": {
        "instantiates": [
            "resources",
            "tradeoffs",
            "limited-planning-ability",
            "right-levelof-difficulty",
            "limited-resources"
        ],
        "modulates": [
            "early-elimination",
            "continuous-goals",
            "evade",
            "race",
            "kingofthe-hill",
            "ephemeral-goals",
            "preventing-goals",
            "new-abilities",
            "improved-abilities",
            "decreased-abilities",
            "ability-losses",
            "game-pauses",
            "turn-taking",
            "puzzle-solving",
            "empowerment",
            "tension",
            "anticipation",
            "hovering-closures",
            "resources",
            "arithmetic-rewardsfor-investments",
            "quick-games",
            "analysis-paralysis",
            "trading",
            "renewable-resources"
        ],
        "instantiated_by": [
            "deadly-traps",
            "shared-resources",
            "delayed-effects",
            "the-show-must-go-on"
        ],
        "modulated_by": [
            "goal-indicators",
            "progress-indicators",
            "status-indicators",
            "tied-results"
        ],
        "conflicts": [
            "safe-havens",
            "downtime",
            "game-pauses"
        ]
    }
}